Repository: Savraska2/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/creating_movements.po
Languages: ru

source: Click the **Switch Output Port Display Mode** button (|switch_output_port|) in the bottom bar of the Stage Schematic pane until you see the letters on each side of the nodes, instead of the default circles.
ru: Нажмите кнопку **Переключениеотображения выходного порта** (|switch_output_port|) в нижней панели окна Stage Schematic, пока не увидите буквы на каждой стороне узлов вместо кружков по умолчанию.

source: **To set the center of an object:**
ru: **Чтобы установить центр объекта:**

source: Place the mouse pointer over the object left port and wait for the double-arrow button to appear.
ru: Наведите указатель мыши на левый порт объекта и дождитесь появления кнопки с двойной стрелкой.

source: Click and **drag up or down the double-arrow** button to scroll the options available: letters and numbers for columns, and letters for all the other types of objects.
ru: Нажмите и **перетащите вверх или вниз кнопку с двойной стрелкой**, чтобы прокрутить доступные параметры: буквы и цифры для столбцов и буквы для всех других типов объектов.

source: **To set the way a child object overlaps its parent object:**
ru: **Чтобы установить способ, которым дочерний объект перекрывает свой родительский объект:**

source: Set the *same letter* for the two ports at the end of a link to overlap the objects without an offset.
ru: Установите *одинаковую букву* для двух портов в конце ссылки, чтобы перекрывать объекты без смещения.

source: Set the *following letter* in alphabetical order on the **left port** of the **child object** to offset it to the left: for each successive letter there is an offset of 8 inches to the left.
ru: Установите *следующую букву* в алфавитном порядке на **левом порту дочернего объекта**, чтобы сместить его влево: для каждой последующей буквы имеется смещение в 8 дюймов влево.

source: Set the *following letter* in alphabetical order on the **right port** of the **parent object** to offset it to the right: for each successive letter there is an offset of 8 inches to the right.
ru: Установите *следующую букву* в алфавитном порядке на **правом порту родительского объекта**, чтобы сместить его вправо: для каждой последующей буквы есть смещение на 8 дюймов вправо.

source: Using Hooks
ru: Использование крюков

source: Hooks are reference points that can be defined for any animation level directly in the viewer, by using the **Hook** tool (|hook|).
ru: Крюки - это опорные точки, которые можно определить для любого уровня анимации непосредственно в окне просмотра с помощью инструмента **Крюк** (|hook|).

source: Once defined for a column/layer, they can be used in the Stage Schematic to link another object to it in relation to a specific hook, or to move it, according to any of its hook sets.
ru: После того, как они определены для столбца/слоя, они могут использоваться в схеме этапа для связывания с ним другого объекта по отношению к конкретному крюку или для его перемещения в соответствии с любым из его наборов крюков.

source: In the first case the hook is used as a tracking point to link another object (a column/layer or camera) to a specific feature of the animation level. For example, if you have a character carrying a lamp, you can track the lamp position with a hook, and link a radial gradient to it (placed over the lamp for every frame of the animation) to create a glow.
ru: В первом случае крюк используется в качестве точки отслеживания, чтобы связать другой объект (столбец/слой или камеру) с определенной особенностью уровня анимации. Например, если у вас есть персонаж, несущий лампу, вы можете отследить положение лампы с помощью крючка и привязать к нему радиальный градиент (размещенный над лампой для каждого кадра анимации), чтобы создать свечение.

source: In the second case, the hook is used as the center of the column/layer where the hooked level will be exposed, thus creating a different center and offset for each level frame. For example, if you have a walking animation cycle, you can set a new center following the character’s feet with a hook, and make the level move accordingly to prevent a moon-walking effect on the background.
ru: Во втором случае крюк используется в качестве центра столбца/слоя, где будет зацеплен уровень зацепления, создавая тем самым разные центр и смещение для каждого кадра уровня. Например, если у вас есть цикл анимации при ходьбе, вы можете установить новый центр, следуя за ногами персонажа с помощью крюка, и заставить уровень двигаться соответствующим образом, чтобы предотвратить эффект лунной прогулки на заднем плане.

source: Hooks can also be split and passed from one drawing feature to another, automatically creating an offset position. For example, the hook following the character’s foot feature can pass from one foot to another, in order to make the character move continuously onward.
ru: Крюки также могут быть разделены и переданы из одного объекта рисунка в другой, автоматически создавая положение смещения. Например, крюк, следующий за особенностью ноги персонажа, может переходить с одной ноги на другую, чтобы персонаж непрерывно двигался вперед.

source: The hook set 2 follows the lamp, while the hook set 1 follows the character’s feet, passing from one feet to another when both are on the ground.
ru: Набор крюков 2 следует за лампой, а набор крюков 1 следует за ногами персонажа, переходя от одной ноги к другой, когда оба находятся на земле.

source: A hook can be created starting from any frame. Once it is created, it will appear on the following level frames in the same position, from where it can be moved.
ru: Крюк может быть создан, начиная с любого кадра. Как только он будет создан, он появится на следующих уровнях кадров в том же положении, откуда он может быть перемещен.

source: You can use up to 20 hooks for each level; each hook is labeled with a number, to reference it in each level frame.
ru: Вы можете использовать до 20 крюков для каждого уровня; каждый крюк помечен номером, чтобы ссылаться на него в каждом уровне кадра.

source: By activating the **Snap** option, hooks for the current level can be accurately placed by snapping them exactly to the same position of hooks defined for the other animation levels visible in the viewer. In case the current level is a Toonz Vector level, hooks will snap also to the center of any closed shapes it may contain (e.g. rectangles, circles or single vector shapes closed with the Tape tool). This option may prove useful especially when defining hooks for cutout animation models (see :ref:`Creating Cutout Animation <creating_cutout_animation>` ).
ru: Активировав опцию **Привязка**, можно точно установить крюки для текущего уровня, привязав их точно к тому же положению крюков, которое определено для других уровней анимации, видимых в окне просмотра. В случае, если текущий уровень является векторным уровнем Toonz, крюки также будут привязываться к центру любых закрытых фигур, которые он может содержать (например, прямоугольники, круги или отдельные векторные фигуры, закрытые инструментом Скотч). Эта опция может оказаться полезной, особенно при определении крюков для моделей перекладной анимации (см. :ref:`Создание перекладной анимации <creating_cutout_animation>`).

source: Hook information is saved along with each level, as a file in XML format, named as the file but with the *_hooks* suffix. For example, hooks defined for the level ``mouse`` will be saved in the file ``mouse_hooks.xml`` .
ru: Информация о крюках сохраняется вместе с каждым уровнем в виде файла в формате XML, именуемого как файл, но с суффиксом *_hooks*. Например, крюки, определенные для уровня ``мышь``, будут сохранены в файле ``мышь_hooks.xml``.

source: Hooks are also visible in Onion Skin mode (see :ref:`Using Onion Skin <using_onion_skin>` ).
ru: Крюки также видны в режиме Кальки (см. :ref:`Использование кальки <using_onion_skin>`).

source: Hooks can be also used to create a cutout animation model, as they allow you to link the model sections according to specific pivot points (see :ref:`Creating Cutout Animation <creating_cutout_animation>` ).
ru: Крюки могут также использоваться для создания модели перекладной анимации, поскольку они позволяют связывать разделы модели в соответствии с конкретными точками поворота (см. :ref:`Создание перекладной анимации <creating_cutout_animation>`).

source: **To define a hook for a level:**
ru: **Чтобы определить крюк для уровня:**

source: Select a frame from the level you want to set hooks for.
ru: Выберите кадр уровня, для которого вы хотите установить крюки.

source: Choose the **Hook** tool (|hook|).
ru: Выберите инструмент **Крюк** (|hook|).

source: Click to create a hook and drag to define the hook starting position.
ru: Нажмите, чтобы создать крюк, и перетащите, чтобы определить начальную позицию крюка.

source: Click elsewhere to create another hook and the related hook starting position.
ru: Щелкните в другом месте, чтобы создать другой крюк и соответствующую начальную позицию крюка.

source: **To select hooks:**
ru: **Чтобы выбрать крюки:**

source: Click a hook to select it.
ru: Нажмите на крюк, чтобы выбрать его.

source: Ctrl-click (PC) or Cmd-click (Mac) to add a hook to, or remove it from the selection.
ru: Кликните, зажав клавишу Ctrl (PC) или Cmd (Mac), чтобы добавить крюк или убрать его из выделения.

source: **To move selected hooks:**
ru: **Для перемещения выбранных крюков:**

source: Drag them to a new position.
ru: Перетащите их на новую позицию.

source: **Shift-drag** to constrain an horizontal or vertical movement.
ru: Перетащите, зажав клавишу **Shift**, чтобы ограничить горизонтальное или вертикальное движение.

source: Activate the **Snap** option to place the hook exactly at the same position of hooks defined for other animation levels visible in the viewer, or in case the level is a Toonz Vector level, also at the center of closed shapes.
ru: Активируйте опцию **Привязка**, чтобы поместить крюк точно в то же положение, что и крюки, определенные для других уровней анимации, видимых в окне просмотра, или в случае, если этот уровень является векторным уровнем Toonz, также в центре замкнутых фигур.

source: **To pass a hook from one position to another:**
ru: **Чтобы переместить крюк из одной позиции в другую:**

source: **Alt-click and drag** the hook to split it into two.
ru: **Удерживая нажатой клавишу Alt, перетащите** крючок, чтобы разделить его на две части.

source: Place the **double circle** where the hook has to be for the current frame.
ru: Поместите **двойной круг** там, где должен быть крюк для текущего кадра.

source: Place the **cross** where you want the reference point to be from the next frame onwards.
ru: Поместите **крестик** там, где вы хотите, чтобы точка отсчета находилась со следующего кадра.

source: **To delete a hook:**
ru: **Чтобы удалить крючок:**

source: Select the related hook in any frame and choose Edit → **Delete**.
ru: Выберите связанный крюк в любом кадре и выберите пункт меню Правка → **Удалить**.

source: **To link an object to a level hook:**
ru: **Чтобы связать объект с крюком уровня:**

source: Link the object to the column containing the hook.
ru: Свяжите объект со столбцом, содержащим крюк.

source: Place the mouse pointer over the column right port and wait for the double-arrow button to appear.
ru: Наведите указатель мыши на правый порт столбца и дождитесь появления кнопки с двойной стрелкой.

source: **Click and drag up** the double-arrow button to scroll the numbers available before letter A, and release the mouse button to define the hook number to be used.
ru: **Нажмите и перетащите вверх** кнопку с двойной стрелкой, чтобы прокрутить числа, доступные перед буквой A, и отпустите кнопку мыши, чтобы определить номер крюка, который будет использоваться.

source: Column 3 is linked to the hook set 2 of column 2, while column 2 is moving according to its own hook set 1.
ru: Столбец 3 связан с набором крюков 2 столбца 2, а столбец 2 движется в соответствии со своим собственным набором 1 крюков.

source: **To make the level move according to one of its hooks:**
ru: **Чтобы уровень двигался в соответствии с одним из его крюков:**

source: Place the mouse pointer over the left port of the column containing the hook, and wait for the double-arrow button to appear.
ru: Поместите указатель мыши над левым портом столбца, содержащего зацепку, и дождитесь появления кнопки с двумя стрелками.

source: **Click and drag up** the double-arrow button to scroll the numbers available before letter A, and release the mouse button to define the hook to be used.
ru: **Нажмите и перетащите вверх** кнопку с двойной стрелкой, чтобы прокрутить числа, доступные перед буквой A, и отпустите кнопку мыши, чтобы определить используемый крюк.

source: **To prevent an animation walking cycle from moon-walking:**
ru: **Чтобы предотвратить цикл анимации скольжения ног по полу:**

source: Define a hook by following these guidelines:
ru: Определите крюк, следуя этим рекомендациям:

source: Place the hook on the *same foot feature* along the whole sequence, for example the tip of the foot.
ru: Поместите крюк на *тот же элемент стопы* вдоль всей последовательности, например, на кончик стопы.

source: If the character is supposed to be moving horizontally on the ground, *the hook should always lie on the ground line* (without changing its vertical position along the sequence). If the feature you are following leaves the ground, still place the hook on the ground line, under the feature you were following.
ru: Если персонаж должен двигаться горизонтально по земле, *крючок всегда должен лежать на линии земли* (без изменения его вертикального положения вдоль последовательности). Если функция, которой вы следуете, сходит с земли, все равно поместите крюк на линию земли под той функцией, которой вы следовали.

source: When both feet are on the ground line you can split the hook to pass it form one foot to the other.
ru: Когда обе ноги находятся на линии земли, вы можете разделить крюк, чтобы передать его от одной ноги к другой.

source: If the animation is a cycle and you want the character to keep on walking, the last hook position has to be connected to the first one, and the hook has to pass from one foot to the other by splitting it, and then to the first one again by splitting it again.
ru: Если анимация является циклом, и вы хотите, чтобы персонаж продолжал идти, последняя позиция крючка должна быть связана с первой, и крюк должен пройти от одной ноги к другой, разделив ее, а затем на первый снова, разделив его снова.

source: Tracking Points
ru: Точки слежения

source: It is possible to automatically track specific regions in a sequence of images by using the **Tracker** tool (|tracker|). The results of the tool are a series of hooks that can be used to link an object to another (see above).
ru: Можно автоматически отслеживать определенные области в последовательности изображений с помощью инструмента **Трекер** (|tracker|). Результаты этого инструмента представляют собой серию крюков, которые можно использовать для связывания объекта с другим (см. выше).

source: When selected, the Tracker tool (|tracker|) allows you to define one or several regions in an image, by defining a center and a size; regions can also be connected to one another to better track points having a visual geometrical relationship. The region defined with the tool sets both, the *pattern* that the tracking system will try to recognize in the following images, and the *size* of the search area where it will look for it (that will be of approximately twice that region).
ru: При выборе инструмента Трекер (|tracker|) вы можете определить одну или несколько областей на изображении, указав центр и размер; области также могут быть связаны друг с другом, чтобы лучше отслеживать точки, имеющие визуальные геометрические отношения. Область, определенная с помощью инструмента, задает как *шаблон*, который система отслеживания будет пытаться распознать на следующих изображениях, так и *размер* области поиска, в которой она будет ее искать (примерно в два раза больше этой области).

source: Once areas to be tracked are defined in the first frame of a range, it's possible to automatically track the regions in a selected range, by specifying the following options:
ru: После того как области, которые нужно отслеживать, определены в первом кадре диапазона, можно автоматически отслеживать области в выбранном диапазоне, указав следующие параметры:

source: **Threshold** sets the amount of difference between the defined pattern and the recognized one. When using low values, the tracking system will look for an area with an almost identical pattern, and when using high values, will look for an area that can be quite different from the original one. This means that if the value is too low, it’s more likely for the tracking to fail on certain images; if too high, the tracking may fail by following the wrong areas.
ru: **Предел** устанавливает величину разницы между определенным шаблоном и распознанным. При использовании низких значений система отслеживания будет искать область с почти идентичным рисунком, а при использовании высоких значений - область, которая может сильно отличаться от исходной. Это означает, что если значение слишком низкое, более вероятно, что отслеживание не удастся на определенных изображениях; если оно слишком высокое, отслеживание может завершиться ошибкой, если следовать неправильным областям.

source: **Sensitivity** sets how often the defined pattern has to be updated according to the variation it may have in the following images. For the maximum value, the pattern will be updated after each image is tracked.
ru: **Чувствительность** устанавливает частоту обновления определенного шаблона в соответствии с его вариациями на следующих изображениях. Для максимального значения шаблон будет обновляться после отслеживания каждого изображения.

source: **Variable Region Size**, when activated, will look for the defined pattern considering also the different sizes that it can have in the following images.
ru: **Размер изменяемого региона** при активации будет искать определенный шаблон, учитывая также различные размеры, которые он может иметь на следующих изображениях.

source: **Include Background**, when activated, it considers the background as part of the defined pattern. It can be deactivated when tracking an element whose background does not affect the pattern, such as a green/blue screen background.
ru: **Включить фон**, при активации он рассматривает фон как часть определенного шаблона. Параметр можно отключить при отслеживании элемента, фон которого не влияет на рисунок, например, фон зеленого/синего экрана.

source: **To define a region to be tracked:**
ru: **Чтобы определить регион для отслеживания:**

source: Choose the **Tracker** tool (|tracker|) and click and drag in the image.
ru: Выберите инструмент **Трекер** (|tracker|) и щелкните и перетащите изображение.

source: Use the handles along the defined region bounding box to resize it.
ru: Используйте маркеры вдоль определенной области, ограничивающей кадр, чтобы изменить ее размер.

source: Click and drag elsewhere to define a second region: the center of the region will be labelled with a different letter.
ru: Щелкните и перетащите в другое место, чтобы определить второй регион: центр региона будет помечен другой буквой.

source: **To define a region connected to another one:**
ru: **Чтобы определить регион, связанный с другим:**

source: Choose the **Tracker** tool (|tracker|) and **select the region** to which you want to connect another region.
ru: Выберите инструмент **Трекер** (|tracker|) и **выберите регион**, к которому вы хотите подключить другой регион.

source: Click and drag elsewhere to define a connected region: the center of the region will be labelled with the same letter of the first one.
ru: Щелкните и перетащите в другое место, чтобы определить связанную область: центр области будет помечен той же буквой, что и первая.

source: **To delete a defined region:**
ru: **Чтобы удалить определенный регион:**

source: Choose the **Tracker** tool (|tracker|) and select the region you want to delete.
ru: Выберите инструмент **Трекер** (|tracker|) и выберите регион, который вы хотите удалить.

source: Choose Edit → **Delete**.
ru: Выберите пункт меню Правка → **Удалить**.

source: **To track a defined region in a series of images:**
ru: **Чтобы отслеживать определенный регион в серии изображений:**

source: Select the first image of the range you want to track.
ru: Выберите первое изображение диапазона, который вы хотите отслеживать.

source: Choose the **Tracker** tool (|tracker|) and define the regions to be tracked.
ru: Выберите инструмент **Трекер** (|tracker|) и определите регионы для отслеживания.

source: Select the frame range in the Xsheet/Timeline or in the Level Strip.
ru: Выберите диапазон кадров в Xsheet/Timeline или в Level Strip.

source: Choose Level → **Tracking**, set the tracking options and click the **Track** button.
ru: Выберите Уровень → **Трекинг**, настройте параметры отслеживания и нажмите кнопку **Старт**.

source: **To link an object to the tracked region:**
ru: **Чтобы связать объект с отслеживаемым регионом:**

source: Link the object to one of the hooks defined by the tracking process (see :ref:`Using Hooks <using_hooks>` ).
ru: Свяжите объект с одним из крюков, определенных процессом отслеживания (см. :ref:`Использование крюков <using_hooks>`).

source: Animating Objects
ru: Анимация объектов

source: You can animate the position, rotation, scale and shear (plus edit the center) of columns, pegbars, cameras and the table by using the Animate tool. Objects to be animated can be selected either in the Stage Schematic, the Viewer, the Xsheet/Timeline or by using a dropdown menu in the Animate tool's own options bar.
ru: Вы можете анимировать положение, вращение, масштаб и наклон (плюс редактировать центр) столбцов, штифтов, камер и стола с помощью инструмента Анимирования. Анимационные объекты можно выбрать либо в Stage Schematic, в окне просмотра, на Xsheet/Timeline или с помощью раскрывающегося меню на панели параметров инструмента Анимирования.

source: In the **Animate tool** (|animate|) options bar you can set the following:
ru: В панели параметров Инструмента **Анимирования** (|animate|) вы можете установить следующее:

source: **Object:**, lets you select which scene object is to be effected by the tool. Here will be listed all columns, cameras and pegbars created, plus the table itself.
ru: **Объект:**, позволяет выбрать, какой объект сцены должен быть обработан инструментом. Здесь будут перечислены все созданные столбцы, камеры и штифты, а также сам стол.

source: **Mode:**, lets you choose which transformation options to display in the tool options bar. Options are: **Position**, **Rotation**, **Scale**, **Shear**, **Center** and **All**.
ru: **Режим:**, позволяет выбрать, какие параметры преобразования отображать на панели параметров инструмента. Возможные варианты: **Положение**, **Вращение**, **Масштаб**, **Скос**, **Центр** и **Все**.
