Repository: Savraska2/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/creating_cutout_animation.po
Languages: ru

source: Creating Cutout Animation
ru: Создание перекладной анимации

source: Cutout animation is based on characters made of several sections connected together to create a character model. For example a basic model can be made of a drawing for the head, one for the body, one for each arm, and one for each leg.
ru: Перекладная анимация основана на персонажах, состоящих из нескольких частей, соединенных вместе для создания модели персонажа. Например, базовая модель может быть сделана из рисунка для головы, одного для тела, одного для каждой руки и одного для каждой ноги.

source: Animations in this case can be created not by adding drawings depicting the new animated poses, but by transforming (i.e. moving or rotating) the model sections individually at different frames, in order to create different actions.
ru: Анимации в этом случае могут быть созданы не путем добавления рисунков, изображающих новые анимированные позы, а путем преобразования (то есть перемещения или вращения) отдельных частей модели в разных кадрах для создания разных действий.

source: In OpenToonz it's possible to create links between a model's different sections and to set pivot points for each one of them, in order to better manage the animation. For example, you can link a hand to an arm at the wrist, and link the arm to the trunk at the shoulder: in this way when you move the trunk, you will move both arm and hand as well; when you move the arm, it will turn around the shoulder and the hand will follow its movement; when you move the hand, it will turn around the wrist.
ru: В OpenToonz можно создавать связи между различными разделами модели и устанавливать точки поворота для каждого из них, чтобы лучше управлять анимацией. Например, вы можете связать руку с рукой на запястье и связать руку с туловищем на плече: таким образом, когда вы двигаете туловище, вы также будете двигать рукой и рукой; когда вы двигаете руку, она поворачивается вокруг плеча, и рука будет следовать за ее движением; когда вы двигаете рукой, она поворачивается вокруг запястья.

source: **To create a cutout animation:**
ru: **Чтобы создать перекладную анимацию:**

source: Place each section (that can be a single drawing or an animated level) of your character in a different column/layer.
ru: Поместите каждый раздел (который может быть одним рисунком или анимированным уровнем) вашего персонажа в другой столбец/слой.

source: Use the **Skeleton** tool (|skeleton|) to link each section to the other and set the related pivot points.
ru: С помощью инструмента **Скелет** (|skeleton|) свяжите каждый раздел с другим и установите соответствующие точки поворота.

source: Create keyframes for each section at different frames to animate the cutout character.
ru: Создайте ключевые кадры для каждого раздела в разных кадрах, чтобы анимировать персонажа.

source: Using the Skeleton Tool
ru: Использование Инструмента Скелет

source: The **Skeleton** tool (|skeleton|) allows you to define a model by setting hierarchical links between its different sections exposed in different Xsheet columns (or Timeline layers), and animate it.
ru: Инструмент **Скелет** (|skeleton|) позволяет определять модель, устанавливая иерархические связи между различными ее разделами, представленными в разных столбцах Xsheet (или слоях Timeline) и анимировать ее.

source: It basically makes possible, by using a single and more immediate tool, the same tasks that could be achieved by using the Stage Schematic and the **Animate** tool (|animate|), when used to create links and animate the transformations of columns/layers (see :ref:`Linking Objects <linking_objects>` ). Indeed, any editing performed with the **Skeleton** tool (|skeleton|) can also be seen happening in the Stage Schematic and the columns/layers transformation values, and vice versa.
ru: По сути, это позволяет с помощью одного и более непосредственного инструмента выполнять те же задачи, которые можно выполнить с помощью схемы этапов и инструмента **Анимирования** (|animate|), когда он используется для создания ссылок и анимации преобразований столбцов/слоев (см. :ref:`Связывание объектов <linking_objects>`). Действительно, любое редактирование, выполняемое с помощью инструмента **Скелет** (|skeleton|), также может быть замечено происходящим в схеме этапа и значениях преобразования столбцов/слоев, и наоборот.

source: In the tool options bar you can set the following:
ru: На панели параметров инструмента вы можете установить следующее:

source: **Mode** sets the operation to perform with the tool. Options are: **Build Skeleton**, to create links between the different sections, **Animate**, to animate the character model, and **Inverse Kinematics**, to animate the character model using inverse kinematics.
ru: **Режим** устанавливает операцию, выполняемую с инструментом. Варианты: **Создать скелет**, чтобы создать связи между различными разделами, **Анимировать**, чтобы анимировать модель персонажа, и **Обратная кинематика**, чтобы анимировать модель персонажа, используя обратную кинематику.

source: **Global Key** when activated sets a key for all the object transformations as soon as a key is defined by animating the skeleton. This means that if you rotate a model section, automatically a key will be defined for the position, scaling and shearing transformations as well.
ru: **Глобальный ключ** при активации устанавливает ключ для всех преобразований объекта, как только ключ определен путем анимации скелета. Это означает, что если вы поворачиваете секцию модели, автоматически будет определен ключ для трансформации положения, масштабирования и сдвига.

source: **Show Only Active Skeleton** when activated displays only the pivot points and the skeleton from the current section up to the parent section: in this way it will be easier to manage characters with skeletons of a higher complexity.
ru: Параметр **Показать только активный скелет** если активирован, отображает только точки разворота и скелет от текущего раздела до родительского раздела: таким образом, будет легче управлять персонажами со скелетами более высокой сложности.

source: Building a Skeleton
ru: Построение скелета

source: When the **Skeleton** tool (|skeleton|) mode is set to **Build Skeleton**, it's possible to set pivot points and links between sections by using the handle available in the Viewer.
ru: Когда режим инструмента **Скелет** (|skeleton|) установлен на **Создать скелет**, можно устанавливать точки поворота и связи между разделами, используя дескриптор, доступный в окне просмотра.

source: The handle is made of a small circle, with an arm that by default extends upwards. This allows you to perform the following tasks:
ru: Указатель представляет собой небольшой круг с рычагом, который по умолчанию направлен вверх. Это позволяет выполнять следующие задачи:

source: Click and drag the **yellow circle** to set the pivot point position.
ru: Нажмите и перетащите **желтый круг**, чтобы установить положение точки поворота.

source: Click and drag the **square** at the end of the extended arm to set the link to another section.
ru: Нажмите и перетащите **квадрат** в конце расширенного рычага, чтобы установить ссылку на другой раздел.

source: The section pivot point can be moved, but *cannot* change its position during the animation: once it is set, or modified, it is retained during all the animation. If the pivot point is changed many times, and you want to set it back to its original position, right-click the section in the Stage Schematic and choose **Reset Center** from the menu that opens.
ru: Точка вращения секции может быть перемещена, но *не может* изменить свою позицию во время анимации: после того, как она установлена ​​или изменена, она сохраняется в течение всей анимации. Если точка поворота менялась много раз, и вы хотите вернуть ее в исходное положение, щелкните правой кнопкой мыши раздел в схеме сцены и выберите **Сброс центра** в открывшемся меню.

source: The handle refers to the current section; when you link a section to another, the link is graphically displayed connecting the centers of the two sections. When one or several sections are linked, all their links and the related centers, are displayed as well, configuring the skeleton for the model.
ru: Указатель ссылается на текущий раздел; когда вы связываете один раздел с другим, графически отображается ссылка, соединяющая центры двух разделов. Когда один или несколько разделов связаны, все их ссылки и связанные с ними центры также отображаются, конфигурируя каркас для модели.

source: Creating Basic Models
ru: Создание базовых моделей

source: A basic model is made of sections linked to each other by their centers. It's simpler to create if compared to a model based on hooks (see :ref:`Creating Models with Hooks <creating_models_with_hooks>` ), and has some limitations, but it is suitable for most of the cases of cutout animation.
ru: Базовая модель состоит из секций, связанных между собой своими центрами. Его проще создавать по сравнению с моделью, основанной на крюках (см. :ref:`Создание моделей с крюками <creating_models_with_hooks>`), и имеет некоторые ограничения, но подходит для перекладной анимации в большинстве случаев.

source: By default each section has a *center* that's placed at the center of the viewer. When creating a model, this center has to be moved to where the pivot point for that specific section has to be.
ru: По умолчанию каждый раздел имеет *центр*, который находится в центре окна просмотра. При создании модели этот центр должен быть перемещен туда, где должна быть точка поворота для этого конкретного сечения.

source: The **Skeleton** tool (|skeleton|) allows you, both, to change the center position of the currently selected model section, and to link it to the center of another section visible in the Viewer.
ru: Инструмент **Скелет** (|skeleton|) позволяет вам как изменить центральное положение выбранного в данный момент раздела модели, так и связать его с центром другого раздела, видимого в окне просмотра.

source: Usually it's simpler to start working from the parent section, then link the other sections one by one, following one limb at a time. For example first set the center of the model trunk, then set the arm pivot point and link the arm to the trunk, then set the forearm pivot point and link the forearm to the arm, then set the hand pivot point and link the hand to the forearm, and so on.
ru: Обычно проще начать работу с родительского раздела, а затем связать другие разделы один за другим, следуя по одному элементу за раз. Например, сначала установите центр туловища модели, затем установите точку поворота руки и свяжите руку с туловищем, затем установите точку поворота предплечья и свяжите предплечье с рукой, затем установите точку поворота руки и свяжите руку с предплечье и т.д.

source: In case the sections of your model are drawn in the right place, setting the pivot points and the links is all you have to do to define a skeleton. If they are not, you can set the section right position either before or after setting links by using the **Animate** tool or the **Skeleton** tool in **Animate** mode (see :ref:`Animating Objects <animating_objects>` and :ref:`Animating Models <animating_models>` ).
ru: Если разделы вашей модели нарисованы в нужном месте, все, что вам нужно сделать для определения каркаса, это установить точки поворота и ссылки. Если это не так, вы можете установить правильное положение сечения до или после установки ссылок с помощью инструмента **Анимирования** или инструмента **Скелет** в режиме **Анимировать** (см. :ref:`Анимирование объектов <animating_objects>` и :ref:`Анимирование моделей <animating_models>`).

source: **To select a model section:**
ru: **Чтобы выбрать раздел модели:**

source: Select the **Skeleton** tool (|skeleton|), set the mode to **Build Skeleton**, and click the section in the Viewer.
ru: Выберите инструмент **Скелет** (|skeleton|), установите режим **Создать скелет** и щелкните раздел в окне просмотра.

source: **To set the pivot point of the selected section:**
ru: **Чтобы установить точку вращения выбранного раздела:**

source: *Click and drag* the **yellow circle**.
ru: *Нажмите и перетащите* **желтый круг**.

source: **To Link the selected section to another section:**
ru: **Чтобы связать выбранный раздел с другим разделом:**

source: *Click and drag* the **square** at the top of the handle to the section you want to be parent. The section you drag to is highlighted by displaying its bounding box and a label displays information about the link you are going to create.
ru: *Нажмите и перетащите* **квадрат** в верхней части указателя в раздел, который вы хотите стать родительским. Перетаскиваемый раздел выделяется отображением ограничивающего прямоугольника, а метка отображает информацию о ссылке, которую вы собираетесь создать.

source: Release to set the link.
ru: Отпустите, чтобы установить ссылку.

source: **To Break the link between the selected section and its parent:**
ru: **Чтобы разорвать связь между выделенным разделом и его родителем:**

source: *Click and drag* the **square** at the middle of the graphical link between the linked sections away from the parent one.
ru: *Нажмите и перетащите* **квадрат** в середине графической ссылки между связанными разделами от родительского.

source: **To visualize only the skeleton from the current section up to the parent section:**
ru: **Для визуализации только скелета от текущего раздела до родительского раздела:**

source: Activate the **Show Only Active Skeleton** option in the tool options bar.
ru: Активируйте параметр **Показывать только активный скелет** на панели параметров инструмента.

source: Creating Models with Hooks
ru: Создание моделей с помощью крюков

source: Sometimes basic models may not produce the desired results because the positions of the pivot points in the skeleton are fixed, and therefore cannot follow the changes of model sections which are animated levels themselves.
ru: Иногда базовые модели могут не давать желаемых результатов, поскольку положения точек поворота в каркасе являются фиксированными и, следовательно, не могут следовать изменениям разделов модели, которые сами являются анимированными уровнями.

source: For example suppose you have a character whose trunk is an animated level made of several drawings of the trunk bending: as the animation of the trunk goes on, the limbs linked to it will not follow the movement of the trunk (because the trunk is neither moving nor rotating in terms of its transformation values).
ru: Например, предположим, что у вас есть персонаж, туловище которого представляет собой анимированный уровень, состоящий из нескольких рисунков изгиба туловища: при продолжении анимации туловища конечности, связанные с ним, не будут следовать за движением туловища (поскольку туловище не двигается или вращается с точки зрения его значений преобразования).

source: By using hooks you can specify, drawing by drawing, where the pivot points have to be placed: in this way the model will maintain its consistency even when different drawings from an animation level are used, during the course of the action (see :ref:`Using Hooks <using_hooks>` ).
ru: Используя крюки, вы можете указать, рисуя на чертеже, где должны быть расположены точки поворота: таким образом, модель будет сохранять свою согласованность даже при использовании различных рисунков с уровня анимации в ходе действия (см. :ref:`Использование крюков <using_hooks>`).

source: For example, by placing hooks on the drawings of the trunk and on the limbs (where they have to be connected), and defining the links by using hooks instead of centers, the limbs will follow the trunk even if it is bending.
ru: Например, путем размещения крючков на рисунках туловища и конечностей (где они должны быть соединены) и определения связей с использованием крюков вместо центров, конечности будут следовать за туловищем, даже если оно изгибается.

source: The **Skeleton** tool (|skeleton|) allows you, both, to set a hook as the pivot point for the section, and to link it to a specific hook of another section visible in the Viewer.
ru: Инструмент **Скелет** (|skeleton|) позволяет вам одновременно установить крюк в качестве точки поворота для раздела и связать его с конкретным крюком другого раздела, видимого в окне просмотра.

source: Hooks have to be placed for each character model section where you want the joints to be. For example, a trunk may have five hooks, one for the head, two for the arms and two for the legs; a forearm may have two hooks, one for the elbow and one for the wrist.
ru: Крюки должны быть размещены для каждого раздела модели персонажа, где вы хотите, чтобы были суставы. Например, туловище может иметь пять крючков, один для головы, два для рук и два для ног; предплечье может иметь два крючка, один для локтя и один для запястья.

source: When using the **Hook** tool (|hook|) for defining hooks for the model sections, the **Snap** option can be activated (see :ref:`Using Hooks <using_hooks>` ). In this way it's possible to place hooks exactly in the same position of hooks already defined for other animation levels visible in the Viewer, or, in case the level is a Toonz Vector level, at the center of closed shapes (e.g. rectangles, circles or single vector shapes closed with the **Tape** tool).
ru: При использовании инструмента **Крюк** (|hook|) для определения крюков для разделов модели можно активировать опцию **Привязка** (см. :ref:`Использование крюков <using_hooks>`). Таким образом, можно размещать крюки точно в том же положении, что и крюки, уже определенные для других уровней анимации, видимых в окне просмотра, или, если уровень является векторным уровнем Toonz, в центре закрытых фигур (таких как прямоугольники, круги или одиночные векторные фигуры, замкнутые с помощью инструмента **Скотч**).

source: This means that, in case the model sections are drawn in the right place, you can define perfectly overlapping hooks, so that limbs preserve their position when hooks are linked; or you can use regular shapes in Toonz Vector drawings (such as circles), to define the overlapping areas of the model limbs, and consequently place hooks exactly at their center to achieve a perfect match when hooks are linked.
ru: Это означает, что если разделы модели нарисованы в нужном месте, вы можете определить идеально перекрывающиеся крюки, чтобы конечности сохраняли свое положение, когда крюки связаны; или вы можете использовать обычные фигуры на векторных рисунках Toonz (например, круги), чтобы определить перекрывающиеся области конечностей модели, и, следовательно, поместить крюки точно в их центр, чтобы достичь идеального соответствия, когда крюки связаны.

source: The hook number is just a label to identify hooks, and it is not relevant when performing links.
ru: Номер крюка - просто метка для идентификации крюков, и она не имеет значения при выполнении ссылок.

source: Usually it's simpler to start working from the parent section, then link the other sections one by one, following one limb at the time.
ru: Обычно проще начать работу с родительского раздела, а затем связать другие разделы один за другим, следуя по одной конечности за раз.

source: When starting to build a skeleton with hooks, two different cases may take place: the model sections are not drawn in the right place, one in relation to another; or they are drawn in the right place one in relation to another.
ru: Когда начинается сборка скелета с крюками, могут иметь место два разных случая: разделы модели изображены не в нужном месте, один по отношению к другому; или они нарисованы в нужном месте один по отношению к другому.

source: In the first case the appropriate hook has first to be set as the pivot point for the model section, then the link can be created. Note that when setting a hook as the new pivot point, the hook, and consequently the section, *shifts* to the center of the work area; as soon as you link that section to the hook of another section, it goes to the right place, with the two hooks perfectly overlapping.
ru: В первом случае соответствующий крюк сначала должен быть установлен в качестве точки поворота для раздела модели, затем может быть создана ссылка. Обратите внимание, что при установке крюка в качестве новой точки поворота крюк и, следовательно, раздел *смещаются* к центру рабочей области; как только вы связываете этот раздел с крюком другого раздела, он попадает в нужное место, причем два крюка полностью перекрываются.

source: In the second case a hook of the selected section and a hook of another section are overlapping (e.g. the hook on the wrist of the hand section overlaps the hook on the wrist of the forearm section), and a special button displaying information about the overlapping hooks can be used to automatically link the two sections with a single click.
ru: Во втором случае крюк выбранной секции и крюк другой секции перекрываются (например, крючок на запястье секции руки перекрывает крючок на запястье секции предплечья) и специальная кнопка, отображающая информацию о перекрытии крючки могут быть использованы для автоматического связывания двух разделов одним щелчком мыши.

source: **To set a hook as the pivot point of the selected section:**
ru: **Чтобы установить крюк в качестве точки поворота выбранного раздела:**

source: Click the hook label displayed close to the hook.
ru: Нажмите на метку крюка, отображаемую рядом с крюком.

source: **To Link the selected section to a hook another section:**
ru: **Чтобы связать выбранный раздел с крюком другого раздела:**

source: *Click and drag* the square at the top of the handle up to the section you want to be its parent. All the *hooks* are displayed and the section you drag to is highlighted by displaying its bounding box.
ru: **Нажмите и перетащите** квадрат вверху маркера до раздела, родитель которого вы хотите. Отображаются все **крюки**, а участок, на который вы перетаскиваете, выделяется с помощью ограничивающего прямоугольника.

source: Drag towards the hook you want to link the section to: the hook label is displayed and another label displays information about the link you are going to create.
ru: Перетащите в сторону крючка, с которым вы хотите связать раздел: отображается метка крючка, а другой ярлык отображает информацию о ссылке, которую вы собираетесь создать.

source: **To Link two overlapping hooks:**
ru: **Чтобы связать два пересекающихся крюка:**

source: Click the label close to the overlapping hooks displaying information about the link you are going to create.
ru: Нажмите на ярлык рядом с перекрывающимися крюками, отображающими информацию о ссылке, которую вы собираетесь создать.

source: *Click and drag* the square at the middle of the graphical link between the linked sections away from the parent one.
ru: *Нажмите и перетащите* квадрат в середине графической ссылки между связанными разделами от родительского.

source: Animating Models
ru: Анимирование моделей

source: When the Skeleton tool (|skeleton|) mode is set to **Animate**, it is possible to set positions for the model sections at different frames, thus defining an animation.
ru: Когда режим инструмента Скелет (|skeleton|) установлен на **Анимировать**, можно задавать позиции для разделов модели в различных кадрах, тем самым определяя анимацию.

source: In the viewer it's possible to select a model section and perform the following tasks:
ru: В окне просмотра можно выбрать раздел модели и выполнить следующие задачи:

source: *Click anywhere* to rotate the current section.
ru: *Щелкните в любом месте*, чтобы повернуть текущий раздел.

source: *Click and drag the green square with the four arrows* to move the current section.
ru: *Нажмите и перетащите зеленый квадрат с четырьмя стрелками*, чтобы переместить текущий раздел.
