Repository: Savraska2/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/create_animations_using_plastic_tool.po
Languages: ru

source: Select the **ID number** matching the skeleton you need.
ru: Выберите **идентификационный номер**, соответствующий нужному скелету.

source: The selected skeleton is now visible in the main Viewer, and a keyframe is created at the chosen frame.
ru: Выбранный скелет теперь виден в главном окне просмотра, и ключевой кадр создается в выбранном кадре.

source: **To delete a skeleton from the Skeleton list**
ru: **Чтобы удалить скелет из списка скелетов**

source: In the Xsheet/Timeline select the Mesh level owning the skeleton that has to be deleted.
ru: В Xsheet/Timeline выберите уровень полисетки, которому принадлежит скелет, который необходимо удалить.

source: Select from the **Skeleton:** drop down the **ID** matching the skeleton to delete.
ru: Выберите из выпадающего списке **Скелет:** **идентификационный номер**, соответствующий скелету, который хотите удалить.

source: Press the **-** button.
ru: Нажмите кнопку **-**.

source: Modifying a Plastic skeleton
ru: Модификация скелета

source: While drawing the skeleton or after finishing its creation, some adjustments to the positions or the number of vertices may be required:
ru: При рисовании скелета или после завершения его создания могут потребоваться некоторые корректировки расположения или количества вершин:

source: **To Select a vertex:**
ru: **Чтобы выбрать вершину:**

source: While in **Build Skeleton** mode, move the mouse pointer on an already placed vertex.
ru: В режиме **Создать скелет** переместите указатель мыши на уже размещенную вершину.

source: Click, when the name of the vertex appears and a dashed square encloses the vertex position.
ru: Нажмите, когда появится имя вершины и пунктирный квадрат окружает положение вершины.

source: **To Delete a vertex:**
ru: **Чтобы удалить вершину:**

source: While in **Build Skeleton** mode, select the vertex that has to be deleted.
ru: В режиме **Создать скелет** выберите вершину, которую необходимо удалить.

source: Press the **Del** key.
ru: Нажмите кнопку **Del**.

source: **To Insert a vertex:**
ru: **Чтобы вставить вершину:**

source: While in **Build Skeleton** mode, move the mouse pointer over the line connecting the two vertices that need a vertex between them.
ru: Находясь в режиме **Создать скелет**, наведите указатель мыши на линию, соединяющую две вершины, которым необходима вершина между ними.

source: Click to set the new vertex in place, or click and drag to adjust the position of the new vertex.
ru: Нажмите, чтобы установить новую вершину на месте, или нажмите и перетащите, чтобы отрегулировать положение новой вершины.

source: **To Move a vertex:**
ru: **Чтобы переместить вершину:**

source: Click on the vertex to select it, and drag for adjusting its position.
ru: Нажмите на вершину, чтобы выбрать ее, и перетащите для настройки ее положения.

source: **To Prevent a vertex from Stretching the mesh:**
ru: **Чтобы не дать вершине растянуть полисетку:**

source: Select the vertex that you wish to modify.
ru: Выберите вершину, которую вы хотите изменить.

source: Uncheck the **Allow Stretching** option in the Tool Options bar.
ru: Снимите флажок **Разрешить растягивание** на панели параметров инструмента.

source: The square marking the vertex position becomes *yellow*, and from now on the vertex *will not stretch* the Mesh while you are moving it.
ru: Квадрат, обозначающий положение вершины, становится *желтым*, и с этого момента вершина *не будет растягивать* полисетку, пока вы ее перемещаете.

source: **To Snap a vertex to the mesh**
ru: **Чтобы привязать вершину к полисетке**

source: While in **Build Skeleton** mode, activate the **Snap To Mesh** option.
ru: В режиме **Создать скелет** активируйте параметр **Привязка к полисетке**.

source: Select the vertex you wish to snap.
ru: Выберите вершину, которую вы хотите привязать.

source: Drag it near the *mesh point* at which you want to snap it.
ru: Перетащите его рядом с *точкой сетки*, в которой вы хотите его привязать.

source: **To Branch the skeleton:**
ru: **Чтобы разветвить скелет:**

source: While in **Build Skeleton** mode, **select the vertex** from which the new branch will start.
ru: Находясь в режиме **Создать скелет**, **выберите вершину**, с которой начнется новая ветвь.

source: Move to the position where the first vertex of the new branch will be positioned.
ru: Переместите в расположение, где будет расположена первая вершина новой ветви.

source: Click to create it.
ru: Нажмите, чтобы создать ее.

source: **To Copy a skeleton:**
ru: **Чтобы скопировать скелет:**

source: While in **Build Skeleton** mode, **select the Root vertex** and click the right mouse button.
ru: Находясь в режиме **Создать скелет**, **выберите корневую вершину** и щелкните правой кнопкой мыши.

source: From the context menu that opens, select the **Copy Skeleton** option.
ru: В открывшемся контекстном меню выберите параметр **Копировать скелет**.

source: **To Paste a skeleton:**
ru: **Чтобы вставить скелет:**

source: Select a mesh column in the Xsheet/Timeline.
ru: Выберите столбец полисетки на Xsheet/Timeline.

source: If needed press the **+** button to create a new empty skeleton.
ru: При необходимости нажмите кнопку **+**, чтобы создать новый пустой скелет.

source: Click the right mouse button and select the **Paste Skeleton** option.
ru: Щелкните правой кнопкой мыши и выберите параметр **Вставить скелет**.

source: Pasting the skeleton on *an already existing one* will cause the deletion of the old structure and all its animation. This can be reverted to the previous state by using the **Undo** command.
ru: Вставка скелета в *уже существующий* приведет к удалению старой структуры и всей ее анимации. Это можно вернуть в предыдущее состояние с помощью команды **Отменить**.

source: Animating Plastic elements
ru: Анимирование Plastic элементов

source: Creating an animation in Plastic is quite an easy task: just select the vertices and move them to the desired positions at a specific frames and animation keyframes will be automatically created. Play back the sequence to check the results.
ru: Создание анимации в Plastic - довольно простая задача: просто выберите вершины и переместите их в нужные позиции в определенных кадрах, и ключевые кадры анимации будут созданы автоматически. Воспроизведите последовательность кадров, чтобы проверить результаты.

source: **To animate Plastic elements:**
ru: **Для анимации элементов:**

source: Select the mesh column/layer you like to animate.
ru: Выберите столбец/слой полисетки, который вы хотите анимировать.

source: Select **Plastic** tool and set **Mode:** to **Animate**. Now, in the Viewer, you can see the skeleton and the mesh of the selected column/layer.
ru: Выберите инструмент **Plastic** и установите **Режим:** на **Анимировать**. Теперь в окне просмотра вы можете увидеть скелет и сетку выбранного столбца/слоя.

source: Select the first frame of the animation in the Xsheet/Timeline.
ru: Выберите первый кадр анимации в Xsheet/Timeline.

source: Select the *vertices* of the skeleton and move them to the desired positions to set the relative keyframes, or write the desired values into the text fields of the Tool Options bar.
ru: Выберите *вершины* скелета и переместите их в желаемые позиции, чтобы установить соответствующие ключевые кадры, или запишите нужные значения в текстовые поля панели параметров инструмента.

source: Move to the next keyframe of the animation and modify the vertices positions to define a new pose.
ru: Перейдите к следующему ключевому кадру анимации и измените положения вершин, чтобы определить новую позу.

source: Repeat the step 5 until the end the animation is finished.
ru: Повторяйте шаг 5 до конца анимации.

source: **To Set a Rest Position key for one vertex:**
ru: **Чтобы установить ключ покоя для одной вершины:**

source: The first time you draw a skeleton you are also creating the *rest position* of this structure. This pose is automatically stored and you can recall it on any vertex.
ru: В первый раз, когда вы рисуете скелет, вы также создаете *положение покоя* этой структуры. Эта поза автоматически сохраняется, и вы можете вызвать ее в любой вершине.

source: Select a vertex and click the right mouse button.
ru: Выберите вершину и щелкните правой кнопкой мыши.

source: From the context menu that opens, select **Set Rest Key**.
ru: В открывшемся контекстном меню выберите **Установить ключ покоя**.

source: A new keyframe at the current frame is created for the vertex, using its *rest values*.
ru: Новый ключевой кадр в текущем кадре создается для вершины, используя его *значения покоя*.

source: **To Set a Global Rest Position key for the whole skeleton:**
ru: **Чтобы установить глобальную позицию покоя для всего скелета:**

source: The first time you draw a skeleton you are also creating the *rest position* of this structure. This pose is automatically stored and you can recall it on all the vertices.
ru: В первый раз, когда вы рисуете скелет, вы также создаете *положение покоя* этой структуры. Эта поза автоматически сохраняется, и вы можете вернуться к всем ее вершинам.

source: From the context menu that opens, select **Set Global Rest Key**.
ru: В открывшемся контекстном меню выберите **Установить глобальный ключ покоя**.

source: A new keyframe at the current frame is created for all the vertices, using their *rest values*.
ru: Новый ключевой кадр в текущем кадре создается для всех вершин, используя их *значения покоя*.

source: **To preserve the distance between vertices while animating:**
ru: **Чтобы сохранить расстояние между вершинами при анимации:**

source: If it's required that the distance between two joints stays constant during the animation, check the **Keep Distance** checkbox in the Tool Options bar.
ru: Если требуется, чтобы расстояние между двумя соединениями оставалось постоянным во время анимации, установите флажок **Держать расстояние** на панели параметров инструмента.

source: **To Set Keyframes on all vertices at the same time:**
ru: **Чтобы установить ключевые кадры на всех вершинах одновременно:**

source: By default when you move a vertex in **Animate** mode, you set a keyframe just for this selected vertex. For setting a keyframe simultaneously for all the vertices of the skeleton, when just moving one of them, check the **Global Key** checkbox.
ru: По умолчанию, когда вы перемещаете вершину в режиме **Анимировать**, вы устанавливаете ключевой кадр только для этой выбранной вершины. Чтобы установить ключевой кадр одновременно для всех вершин скелета, при перемещении одной из них установите флажок **Глобальный ключ**.

source: **To Set a Keyframe for a vertex which hasn’t changed position:**
ru: **Чтобы установить ключевой кадр для вершины, которая не изменила положение:**

source: Select the vertex for which you want to create a keyframe.
ru: Выберите вершину, для которой вы хотите создать ключевой кадр.

source: Click the right mouse button.
ru: Нажмите правую кнопку мыши.

source: Select the **Set Key** option from the context menu that opens.
ru: Выберите опцию **Установить ключ** в открывшемся контекстном меню.

source: **To Set a Keyframe for all the skeleton vertices which hasn’t changed position:**
ru: **Чтобы установить ключевой кадр для всех вершин скелета, которые не изменили положение:**

source: Select a skeleton vertex.
ru: Выберите вершину скелета.

source: Select the **Set Global Key** option from the context menu that opens.
ru: Выберите параметр **Установить глобальный ключ** в открывшемся контекстном меню.

source: **To animate the Stacking Order of a vertex:**
ru: **Для анимации порядка переркрытия вершин:**

source: Using Plastic you can simulate the effect of overlapping limbs defining a stacking order for the vertices involved in the animation.
ru: Используя Plastic, вы можете имитировать эффект перекрывающихся конечностей, определяя порядок наложения для вершин, участвующих в анимации.

source: Select the vertex you wish to animate.
ru: Выберите вершину, которую вы хотите анимировать.

source: Input the **Stacking Order** value you wish to assign to the vertex into the **SO** text field in the Tool Options bar.
ru: Введите значение **Порядок переркрытия**, которое вы хотите присвоить вершине, в текстовое поле **Порядок** на панели параметров инструмента.

source: Plastic stacking order is a *per vertex* characteristic, you have to define the value you wish for each vertex required. The default value is 0 for all vertices, and can be modified freely using positive or negative values as needed.
ru: Порядок переркрытия Plastic является характеристикой *для каждой вершины*, вы должны определить желаемое значение для каждой требуемой вершины. Значение по умолчанию 0 для всех вершин и может быть свободно изменено с использованием положительных или отрицательных значений по мере необходимости.

source: **To define an Angle Bounds for a vertex:**
ru: **Чтобы определить углы привязки для вершины:**

source: Select the desired vertex.
ru: Выберите нужную вершину.

source: Set the minimum and maximum **Angle Bounds** values for the vertex rotation.
ru: Установите минимальное и максимальное значения **Углы привязки** для вращения вершины.

source: Defining Rigidity for a Plastic mesh
ru: Определение жесткости для полисетки

source: In many occasions it may be required that certain portions of a Mesh that's being animated using the Plastic tool, preserve their shape even if following the overall transformations of the whole element, simulating a more *rigid structure* or a part of it. To achieve this kind of effect a **Rigidity** value can be painted directly on the Mesh.
ru: Во многих случаях может потребоваться, чтобы определенные части сетки, анимированные с помощью инструмента Plastic, сохраняли свою форму, даже если они следуют за общими преобразованиями всего элемента, имитируя более «жесткую структуру» или ее часть. Чтобы достичь такого эффекта, значение **Жесткость** может быть нарисовано непосредственно на полисетке.

source: When activating the **Paint Rigid** mode in the **Plastic** Tool Options bar, a specific drawing tool becomes available. In the Viewer a *red circle* is visible near the tip of the mouse pointer, the size of the circle is the size of the brush you are going to use for painting the rigidity on the mesh.
ru: При активации режима **Покрасить жесткость** на панели параметров инструмента **Plastic** становится доступным определенный инструмент рисования. В окне просмотра *красный круг* виден около кончика указателя мыши, размер круга - это размер кисти, которую вы будете использовать для рисования жесткости на полисетке.

source: **To paint Rigidity on a mesh:**
ru: **Чтобы нарисовать жесткость на полисетке:**

source: Select the mesh column/layer in the Xsheet/Timeline.
ru: Выберите столбец/слой полисетки в Xsheet/Timeline.

source: Set the **Mode:** to **Paint Rigid**.
ru: Установите для **Режима:** значение **Покрасить жесткость**.

source: Set the size of the brush moving the **Thickness** slider or entering a value into the text field.
ru: Установите размер кисти, перемещая ползунок **Толщина** или введя значение в текстовое поле.

source: Select **Rigid** from the option menu to the right of the Thickness slider (**Rigid** is the default value).
ru: Выберите **Жесткий** в меню параметров справа от ползунка Толщина (**Жесткий** - это значение по умолчанию).

source: Move the cursor on the Viewer and start painting on the selected Mesh. The colour of the mesh will change to *red* where painted. Now the *red* areas behave as *rigid* portions of the Mesh.
ru: Переместите курсор на окно просмотра и начните рисовать на выбранной полисетке. Цвет сетки изменится на *красный* там, где нарисован. Теперь *красные* области ведут себя как *жесткие* части полисетки.

source: **To modify, correct, erase Rigidity on a mesh:**
ru: **Чтобы изменить, подправить, стереть жесткость полисетки:**

source: Select **Flex** from the option menu to the right of the Thickness slider.
ru: Выберите **Гибкий** в меню параметров справа от ползунка Толщина.

source: Move the cursor on the Viewer and start painting on the selected Mesh. The colour of the mesh will change to *green* where painted. Now the *green* areas behave as *flexible* portions of the Mesh.
ru: Переместите курсор в окно просмотра и начните рисовать на выбранной полисетке. Цвет полисетки изменится на *зеленый* там, где нарисован. Теперь *зеленые* области ведут себя как *гибкие* части полисетки.

source: The default colour of a mesh is *green*; it means that the whole mesh is *flexible*. The *red* colour is used to point out the *rigid* areas of the mesh (if there are any defined). But if a mesh is all painted in red colour it behaves as a flexible one too.
ru: Цвет полисетки по умолчанию *зеленый*; это означает, что вся полисетка является *гибкой*. *Красный* цвет используется для указания *жестких* областей полисетки (если они есть). Но если вся полисетка окрашена в красный цвет, она тоже будет гибкой.

source: Displaying Plastic elements and properties
ru: Отображение элементов и свойств

source: While working with the Plastic tool there is an easy way for customizing which information have to be displayed in the Viewer. Clicking the right mouse button on the Viewer *while* the **Plastic** tool is active brings up a context menu. There are four checkboxes that set the display properties for the Mesh, the **Rigidity**, the **SO** (Stacking Order) and the **Skeleton Onion Skin**.
ru: При работе с инструментом Plastic можно легко настроить, какая информация должна отображаться в окне просмотра. Щелчок правой кнопкой мыши в окне просмотра *когда* инструмент **Plastic** активен, вызывает контекстное меню. Существует четыре флажка, которые устанавливают свойства отображения полисетки, это **Жесткость**, **Порядок** (порядок наложения) и **Калька скелета**.

source: If **Show Mesh** is enabled, the mesh will be visible as a triangulated wire frame shape.
ru: Если **Показать полисетку** включено, полисетка будет видна в виде треугольной проволочной формы.

source: If **Show Rigidity** is enabled, continuous *green* areas will show the flexibility, while *red* areas will show rigidity.
ru: Если **Показать жесткость** включен, непрерывные *зеленые* области будут показывать гибкость, в то время как *красные* области будут показывать жесткость.

source: If **Show SO** is enabled *a grey shading* shows the Stacking Order values of the vertices, where lighter areas will be on top, and darker ones behind.
ru: Если **Показать порядок** *включен*, то *серая заливка* показывает значения порядка наложения вершин, где более светлые области будут сверху, а более темные сзади.

source: If **Show Skeleton Onion Skin** is enabled, ghosts of the skeleton at the selected frames will be displayed with incremental levels of transparency.
ru: Если **Показать кальку скелета** включен, призраки скелета в выбранных кадрах будут отображаться с добавочными уровнями прозрачности.

source: All of this information can be displayed at once (by checking all the options), giving an overall description of the vertices state.
ru: Вся эта информация может отображаться сразу (путем включения всех параметров), давая общее описание состояния вершин.

source: Parenting Plastic levels using vertices and hooks
ru: Родительские Plastic уровни с применением вершин и крюков

source: For building interesting and complex animations it could be useful and time saving to create a hierarchical relationship between standard levels and Plastic modified levels, or between Plastic modified levels themselves, so that the children levels inherit the transformations of the parent automatically. It's always possible to link the levels using the column/layer center as target, but what if something more subtler is needed as using *Hooks*? We have already described similar techniques for OpenToonz standard elements (see :ref:`Linking Objects <linking_objects>` or :ref:`Using Hooks <using_hooks>` ), but Plastic modified levels works in a slightly different way because the Hook tool *is not* enabled on this kind of levels. Plastic modified levels use their skeleton vertices instead of the hook points.
ru: Для создания интересных и сложных анимаций может быть полезно и экономить время на создание иерархических отношений между стандартными уровнями и уровнями, измененными для Plastic, или между самими уровнями, измененными для Plastic, чтобы дочерние уровни автоматически наследовали преобразования родительского уровня. Всегда можно связать уровни, используя центр столбца/слоя в качестве цели, но что, если требуется что-то более тонкое, например *Крюки*? Мы уже описывали аналогичные методы для стандартных элементов OpenToonz (см. :ref:`Связывание объектов <linking_objects>` или :ref:`Использование крюков <using_hooks>`), но модифицированные уровни Plastic работают немного иначе, потому что инструмент Крюк *не* включен на уровнях такого типа. Измененные Plastic уровни используют свои вершины скелета вместо точек крюка.

source: **To link a standard level to a Plastic modified level**
ru: **Чтобы связать стандартный уровень с Plastic измененным уровнем**

source: Select in the Xsheet/Timeline the level that has to be linked.
ru: Выберите в Xsheet/Timeline уровень, который должен быть связан.

source: Use the **Hook** tool in the Viewer to create a hook on the spot that will be used as pivot for the level.
ru: Используйте инструмент **Крюк** в окне просмотра, чтобы создать точку на месте, которая будет использоваться в качестве разворота для уровня.

source: Go to the Stage Schematic and select the node of the column/layer that has to be linked. Click on the small square on its left side, and drag to one of the small squares on the right side of the Plastic modified node target of the link. Now the two levels are linked but the reference points for the link are probably wrong (by default the column/layer centers are used).
ru: Перейдите к Stage Schematic и выберите узел столбца/слоя, который должен быть связан. Нажмите на маленький квадрат с левой стороны и перетащите его на один из маленьких квадратов с правой стороны целевого элемента, модифицированного Plastic, ссылки. Теперь эти два уровня связаны, но контрольные точки для ссылки, вероятно, неверны (по умолчанию используются центры столбцов/слоев).

source: Hover on the small square on the left side of the node of the standard level until two small arrows (pointing up and down) appear.
ru: Наведите указатель мыши на маленький квадрат слева от узла стандартного уровня, пока не появятся две маленькие стрелки (вверх и вниз).

source: Click on the arrows and drag to change the value in the small square. Stop when **the number of the hook point** that has to be used as pivot point is reached. In the Viewer the level moves using the chosen point as new center.
ru: Нажмите на стрелки и перетащите, чтобы изменить значение в маленьком квадрате. Остановитесь, когда **номер крючка**, который должен использоваться в качестве точки разворота, достигнут. В окне просмотра уровень перемещается с использованием выбранной точки в качестве нового центра.
