Repository: Savraska2/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/creating_cutout_animation.po
Languages: ru

source: As you roll over the handle, the cursor changes shape to indicate to you the operations you may perform.
ru: При наведении курсора указатель курсор меняет форму, указывая на те операции, которые вы можете выполнить.

source: Every time a position for a section is set, a keyframe is automatically generated for the Xsheet column (or Timeline layer) where that section is exposed, at the current frame. Keys are created only for the transformation you modify: rotation, displacement, or both.
ru: Каждый раз, когда устанавливается позиция для раздела, ключевой кадр автоматически создается для столбца Xsheet (или слоя Timeline), где этот раздел отображается, в текущем кадре. Ключи создаются только для преобразования, которое вы изменяете: вращение, смещение или оба.

source: It is also possible to activate the **Global Key** option in order to set a keyframe for all the section transformations, including scaling and shearing, as soon as a keyframe for one transformation is set. This may result useful if you want to animate the model first, and then refine the animation by adding stretching and squashing transformations.
ru: Также возможно активировать опцию **Глобальный ключ**, чтобы установить ключевой кадр для всех преобразований раздела, включая масштабирование и сдвиг, как только будет установлен ключевой кадр для одного преобразования. Это может оказаться полезным, если вы хотите сначала анимировать модель, а затем уточнить анимацию, добавив преобразования растяжения и сжатия.

source: If you want to create a keyframe without operating the handle, in order to leave the section position and rotation as they are, you can use the **Set Key** button (|key|) available in the bottom bar of the Viewer. In this case keys are created for all the object transformations (see :ref:`Animating Objects <animating_objects>` ). It is also possible to manage keys for several model sections at once by inserting or deleting keys affecting the Xsheet/Timeline as a whole, or a selection of Xsheet columns (or Timeline layers) (see :ref:`Working with Multiple Column Keys <working_with_multiple_column_keys>` ).
ru: Если вы хотите создать ключевой кадр без работы с указателями, чтобы оставить положение раздела и вращение такими, какие они есть, вы можете использовать кнопку **Установить ключ** (|key|), доступную в нижней панели окна просмотра. В этом случае ключи создаются для всех преобразований объектов (см. :ref:`Анимирование объектов <animating_objects>`). Также можно управлять ключами для нескольких разделов модели одновременно, вставляя или удаляя ключи, влияющие на Xsheet/Timeline в целом, или на выбор столбцов Xsheet (или слоев Timeline) (см. :ref:`Работа с несколькими ключами столбцов <working_with_multiple_column_keys>`).

source: Keys and interpolations you define in this way are displayed in Xsheet columns (or Timeline layers), where they can be directly managed (see :ref:`Using Column Keys <using_column_keys>` ).
ru: Ключи и интерполяции, которые вы определяете таким образом, отображаются в столбцах Xsheet (или слоях Timeline), где ими можно напрямую управлять (см. :ref:`Использование ключей столбцов <using_column_keys>`).

source: As keyframes can be defined at specific frames for specific sections only, you may calibrate the animation and the movement speed of your model the way you prefer.
ru: Поскольку ключевые кадры могут быть определены в определенных кадрах только для определенных определенных разделов, вы можете откалибровать анимацию и скорость движения вашей модели так, как вы предпочитаете.

source: Columns/layers can also be animated by working in the Function Editor (see :ref:`Editing Using Spreadsheet and Curves <editing_curves_and_numerical_columns>` )
ru: Столбцы/слои также можно анимировать, работая в редакторе функций (см. :ref:`Редактирование с использованием электронных таблиц и кривых <editing_curves_and_numeric_columns>`)

source: In case a model section is an animation level consisting of several drawings instead of a single one (for example, if the character’s hand is an animation level consisting of drawings of the hand in different positions), the **Skeleton** tool (|skeleton|) lets you also flip through the drawings to choose the one you need.
ru: Если раздел модели представляет собой уровень анимации, состоящий из нескольких рисунков, а не одного (например, если рука персонажа является уровнем анимации, состоящим из рисунков руки в разных положениях), инструмент **Скелет** (|skeleton|) позволяет также пролистывать рисунки, чтобы выбрать тот, который вам нужен.

source: **To Select a model section:**
ru: **Чтобы выбрать раздел модели:**

source: Choose the **Skeleton** tool (|skeleton|), set the mode to **Animate**, and click the section in the Viewer.
ru: Выберите инструмент **Скелет** (|skeleton|), установите режим на **Анимировать** и щелкните раздел в окне просмотра.

source: **To Rotate the selected section:**
ru: **Поворот выбранного раздела:**

source: Click and drag *anywhere* in the Viewer.
ru: Нажмите и перетащите *куда-либо* в окне просмотра.

source: **To Move the selected section:**
ru: **Чтобы переместить выбранный раздел:**

source: Click and drag *the green square with the four arrows* available on the right of the current section pivot point.
ru: Нажмите и перетащите *зеленый квадрат с четырьмя стрелками*, доступными справа от текущей точки поворота сечения.

source: **To visualize only the pivot points of the current section up to the parent section:**
ru: **Для визуализации только точек разворота текущего раздела до родительского раздела:**

source: Activate the **Show Only Active Skeleton** option in the Skeleton tool options bar.
ru: Активируйте параметр **Показать только активный скелет** на панели параметров инструмента «Скелет».

source: **To flip through the drawings belonging to the animation level:**
ru: **Чтобы просмотреть рисунки, относящиеся к уровню анимации:**

source: Click *the label with the level name* on the right of the current section pivot point and flip through following and previous frames by doing one of the following:
ru: Нажмите *метку с именем уровня* справа от точки поворота текущего раздела и пролистайте следующие и предыдущие кадры, выполнив одно из следующих действий:

source: Drag up or down.
ru: Перетащите вверх или вниз.

source: Click the up or down arrowheads.
ru: Нажмите стрелки вверх или вниз.

source: Using Inverse Kinematics
ru: Использование обратной кинематики

source: When the **Skeleton** tool (|skeleton|) mode is set to **Inverse Kinematics**, it's possible to move the model considering the articulation of all the sections its skeleton is made of. This means that if you want to move the end of a model limb to a particular position, all the rest of the sections belonging to that limb will move consequently, with no need to move each section separately.
ru: Когда режим инструмента **Скелет** (|skeleton|) установлен на **Обратная кинематика**, можно перемещать модель, учитывая артикуляцию всех секций, из которых сделан ее скелет. Это означает, что если вы хотите переместить конец конечности модели в определенную позицию, все остальные секции, принадлежащие этой конечности, будут перемещаться, следовательно, без необходимости перемещать каждую секцию отдельно.

source: For example, if you want the hand of a character to reach a particular point, you don’t need to animate the arm and the forearm separately, but instead you can move the hand to the final position, automatically adjusting the arm and forearm sections.
ru: Например, если вы хотите, чтобы рука персонажа достигла определенной точки, вам не нужно отдельно анимировать руку и предплечье, но вместо этого вы можете переместить руку в конечное положение, автоматически настраивая участки руки и предплечья.

source: When the **Inverse Kinematics** mode is activated, the full skeleton with pivot points and links is displayed.
ru: Когда активирован режим **Обратная кинематика**, отображается полный скелет с точками поворота и ссылками.

source: When moving the model, a rotation keyframe is automatically defined for all the sections involved in the movement, unless the **Global Key** option is activated thus generating a keyframe for all the section transformations.
ru: При перемещении модели ключевой кадр поворота автоматически определяется для всех секций, участвующих в движении, если только не активирована опция **Глобальный ключ**, в результате чего создается ключевой кадр для всех преобразований раздела.

source: When using inverse kinematics the movements of the parent section of the skeleton are automatically computed to allow the right configuration of the skeleton; this means that they *cannot* be edited anymore by using standard movement editing tools like the **Animate** tool or the **Function Editor**. To return to the standard movement editing mode, you have to reset the pinned centers information.
ru: При использовании обратной кинематики движения родительского участка скелета автоматически рассчитываются, чтобы обеспечить правильную конфигурацию скелета; это означает, что их *нельзя* редактировать больше с помощью стандартных инструментов редактирования движения, таких как инструмент **Анимирования** или **Редактора функций**. Чтобы вернуться в стандартный режим редактирования движения, необходимо сбросить информацию о закрепленных центрах.

source: Pinned Center
ru: Закрепленный центр

source: One single center (by default located on the section that is the parent of the skeleton), is displayed as a **blue square**: indicating that it's **pinned** and its position won't change throughout the animation when the character sections are animated.
ru: Один единственный центр (по умолчанию расположенный в разделе, которая является родителем скелета), отображается в виде **синего квадрата**: это означает, что он **закреплен**, и его положение не изменится на протяжении всей анимации, когда разделы персонажа анимированы.

source: The **pinned center** can be moved from a joint to another along the animation in order to have a center pinned only for a specific frame range. When the pinned center is changed at a specific frame, all the previous frames will retain the **previously pinned center**; all the following frames will have the **new pinned center** up to the frame where another pinned center position, if any, is defined in advance.
ru: **Закрепленный центр** можно перемещать от соединения к другому вдоль анимации, чтобы центр был закреплен только для определенного диапазона кадров. Когда закрепленный центр изменяется в конкретном кадре, все предыдущие кадры сохранят **ранее закрепленный центр**; все последующие кадры будут иметь **новый закрепленный центр** до кадра, где заранее определено другое закрепленное центральное положение, если оно есть.

source: Changing the pinned center allows for a more complex animation where fixed points have to change while the model is moving, for example a walk where one ankle is pinned while the character is doing the first step, and the other ankle is pinned during the second step.
ru: Изменение закрепленного центра позволяет создать более сложную анимацию, в которой фиксированные точки должны меняться во время движения модели, например, движение, когда одна лодыжка закреплена, пока персонаж делает первый шаг, а другая лодыжка закреплена во время второго шага.

source: Once the *pinned center* is defined, it will remain active when animating skeleton sections both with the **Skeleton** tool (|skeleton|), and with the **Animate** tool (|animate|). To freely animate any skeleton section again, reset the pinned center information (see below).
ru: После определения *закрепленного центра* он останется активным при анимации участков скелета как с помощью инструмента **Скелет** (|skeleton|), так и с помощью инструмента **Анимирования** (|animate| ). Чтобы снова свободно анимировать любую часть скелета, сбросьте информацию о закрепленном центре (см. ниже).

source: Temporarily Pinned Centers
ru: Временно закрепленные центры

source: Multiple additional centers can be *temporarily pinned* at any frame in order to constrain additional joints to a specific position. Unlike the pinned center, **temporarily pinned centers** are *not* preserved when the current frame changes, as they are used only to define the position of the sections at a certain frame.
ru: Несколько дополнительных центров могут быть *временно закреплены* в любом кадре, чтобы ограничить дополнительные соединения определенным положением. В отличие от закрепленного центра **временно закрепленные центры** *не* сохраняются при изменении текущего кадра, так как они используются только для определения положения секций в определенном кадре.

source: Using **temporarily pinned centers** allows for the definition of specific poses at specific frames, for example the rising of an arm by pinning the shoulder joint.
ru: Использование **временно закрепленных центров** позволяет определять конкретные позы в определенных кадрах, например, подъем руки путем закрепления плечевого сустава.

source: According to the *pinned center*, and the *temporarily pinned centers*, it's possible to click any point of any section and drag to move the model: all the parent sections up to the *first pinned center* along the skeleton will move consequently, while all the linked sections *down to the free end of the limb* will move rigidly with the picked section. The sections affected by the movement are highlighted by displaying the link wires in *red*.
ru: В соответствии с *закрепленным центром* и *временно закрепленными центрами* можно щелкнуть любую точку любого раздела и перетащить ее, чтобы переместить модель: все родительские секции вплоть до *первого закрепленного центра* вдоль скелета будут двигаться в то время как все связанные секции *до свободного конца конечности* будут жестко двигаться с выбранной секцией. Участки, затронутые движением, выделяются, отображая линии связи *красным*.

source: The pinned centers information and coordinates are saved along with the scene; in case you want to delete it or start the animation by using the inverse kinematics from scratch, this information can be reset to the default, where only the center of the parent section of the skeleton is pinned.
ru: Информация и координаты закрепленных центров сохраняются вместе со сценой; в случае, если вы хотите удалить его или запустить анимацию, используя обратную кинематику с нуля, эта информация может быть сброшена до значения по умолчанию, где закреплен только центр родительской части скелета.

source: **To animate the model with Inverse Kinematics:**
ru: **Для анимации модели с помощью обратной кинематики:**

source: Choose the **Skeleton** tool (|skeleton|) and set the mode to **Inverse Kinematics**.
ru: Выберите инструмент **Скелет** (|skeleton|) и установите режим **Обратная кинематика**.

source: Click any point of any model section and drag it to the desired position.
ru: Щелкните любую точку любой секции модели и перетащите ее в нужное место.

source: **To set the skeleton Pinned Center:**
ru: **Чтобы установить закрепленный скелет в центре:**

source: **Click the center**: it turns from an *orange circle* to a *blue square* to indicate it is **pinned**.
ru: **Щелкните по центру**: он превращается из *оранжевого круга* в *синий квадрат*, чтобы указать, что он **закреплен**.

source: **To change the skeleton Pinned Center:**
ru: **Чтобы изменить закрепленный центр скелета в центре:**

source: Select the frame where you want the new center to be set.
ru: Выберите кадр, в котором вы хотите установить новый центр.

source: **Click the center**: all the previous frames will retain the *previously pinned center*; all the following frames will have the *new pinned center* up to a frame where another pinned position might have been defined in advance.
ru: **Щелкните по центру**: все предыдущие кадры сохранят *ранее закрепленный центр*; все последующие кадры будут иметь *новый закрепленный центр* вплоть до кадра, где другое заранее закрепленное положение могло быть определено заранее.

source: **To set a Temporarily Pinned Center:**
ru: **Чтобы установить временно закрепленный центр:**

source: **Shift-click the center**: it turns from an *orange circle* to a *light blue square* to indicate it is **temporarily pinned**.
ru: **Удерживая нажатой клавишу Shift, щелкните центр**: он превращается из *оранжевого круга* в *голубой квадрат*, чтобы указать, что он **временно закреплен**.

source: **To unset a Temporarily Pinned Center:**
ru: **Чтобы удалить временно закрепленный центр:**

source: **Shift-click the temporarily pinned center**: it turns from a *light blue square* to an *orange circle* to indicate it's no longer temporarily pinned.
ru: **Удерживая нажатой клавишу Shift, щелкните временно закрепленный центр**: он превращается из *светло-синего квадрата* в *оранжевый круг*, чтобы указать, что он больше не закреплен временно.

source: **To Reset the Pinned Centers information:**
ru: **Для сброса информации о закрепленных центрах:**

source: Choose the **Skeleton** tool (|skeleton|).
ru: Выберите инструмент **Скелет** (|skeleton|).

source: Right-click in the viewer and choose **Reset Pinned Center** from the menu that opens.
ru: Щелкните правой кнопкой мыши в средстве просмотра и выберите **Сбросить закрепленнн центр** в открывшемся меню.
