Repository: Savraska2/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/creating_movements.po
Languages: ru

source: Creating a Movement along a Motion Path
ru: Создание движения по траектории

source: Objects can be moved along a motion path according to two different type of movements: one without changing the object orientation, and the other with an automatic orientation, set according to the direction of the motion path.
ru: Объекты могут перемещаться по траектории движения в соответствии с двумя различными типами движений: один без изменения ориентации объекта, а другой с автоматической ориентацией, установленной в соответствии с направлением траектории движения.

source: A motion path can be assigned to an object node in the Stage Schematic, and it can be defined with drawing tools and edited in the viewer as if it was a vector drawing. Once defined, it's displayed as a dashed red line, with small numbers indicating the control points defining the vector stroke.
ru: Путь движения может быть назначен узлу объекта в Stage Schematic, и его можно определить с помощью инструментов рисования и отредактировать в окне просмотра, как если бы это был векторный рисунок. После определения он отображается в виде пунктирной красной линии с небольшими цифрами, обозначающими контрольные точки, определяющие вектор обводки.

source: A motion path assigned to pegbar 2.
ru: Траектория движения, назначенная pegbar 2.

source: As soon as a path is assigned to an object's node, the object will be automatically placed at the beginning of the path according to its center, and it will only be able to move along it (and not in the standard E/W and N/S directions anymore).
ru: Как только путь назначается узлу объекта, объект будет автоматически помещен в начало пути в соответствии с его центром, и он сможет двигаться только по нему (а не в стандартных E/W и N/S направлениях).

source: The keyframes of the object on the motion path can be defined by dragging the object along it, and they are *expressed as a percentage* where 0% is the starting point and 100% is the ending point of the path.
ru: Ключевые кадры объекта на пути движения могут быть определены путем перетаскивания объекта вдоль него, и они *выражены в процентах*, где 0% является начальной точкой, а 100% - конечной точкой пути.

source: It's also possible to link the keyframes of the objects to the positions of the control points defining the motion path, so that they remain consistent when the motion path is edited. To help you better understand where the control points are, the object snaps to them when it is dragged along the motion path.
ru: Также возможно связать ключевые кадры объектов с позициями контрольных точек, определяющих траекторию движения, чтобы они оставались согласованными при редактировании траектории движения. Чтобы помочь вам лучше понять, где находятся контрольные точки, объект привязывается к ним, когда он перетаскивается по траектории движения.

source: If you want to change the center of the object, you can move it using the **Animate** tool (|animate|), and then use the **Reset Center** command in the Stage Schematic.
ru: Если вы хотите изменить центр объекта, вы можете переместить его с помощью инструмента **Анимирования** (|animate|), а затем использовать команду **Сброс центра** в Stage Schematic.

source: A motion path can also be created by copying and pasting a drawing vector stroke, and conversely a drawing vector stroke can be created by copying and pasting a motion path.
ru: Траектория также может быть создана путем копирования и вставки обводки вектора рисунка, и наоборот, обводка вектора рисунка может быть создана путем копирования и вставки траектории.

source: **To create a motion path:**
ru: **Чтобы создать траекторию движения:**

source: Select the object for which you want to define a motion path.
ru: Выберите объект, для которого вы хотите определить траекторию движения.

source: Click the **New Motion Path** button (|new_motion_path|) in the bottom bar of the stage window.
ru: Нажмите кнопку **Новая траектория движения** (|new_motion_path|) в нижней панели окна сцены.

source: Right-click in the stage and choose **New Motion Path** from the menu that opens.
ru: Щелкните правой кнопкой мыши по сцене и выберите **Новая траектория движения** в открывшемся меню.

source: **To define and edit a motion path:**
ru: **Для определения и редактирования траектории движения:**

source: Select the motion path node in the stage and do any of the following:
ru: Выберите узел траектории движения на сцене и выполните любое из следующих действий:

source: Use the drawing tools to define it in the viewer.
ru: Используйте инструменты рисования, чтобы определить его в окне просмотра.

source: Use the modifier tools to edit it.
ru: Используйте инструменты-модификаторы для редактирования.

source: Draw a new line, and confirm in the dialog that opens, to replace a previously created motion path with the new one.
ru: Нарисуйте новую линию и подтвердите в открывшемся диалоговом окне, чтобы заменить ранее созданную траекторию движения новой.

source: **To assign a motion path to an object:**
ru: **Чтобы назначить траекторию движения объекту:**

source: Click and drag the motion path top port to the object node bottom port.
ru: Нажмите и перетащите верхний порт траектории движения к нижнему порту узла объекта.

source: **To remove a motion path from an object:**
ru: **Чтобы удалить траекторию движения от объекта:**

source: Select the link between the object and the motion path.
ru: Выберите связь между объектом и траекторией движения.

source: **To set the type of movement along a motion path:**
ru: **Чтобы установить тип движения по траектории движения:**

source: Click the button at *the far left* of the object bottom port to switch between two options: the **Square** button (|square|) will preserve the object's original orientation, and the **Rotated Square** button (|rhomb|) will automatically rotate the object according to the motion path's direction.
ru: Нажмите кнопку в *крайнем левом* нижнем порту объекта, чтобы переключиться между двумя вариантами: кнопка **Квадрат** (|square|) сохранит исходную ориентацию объекта и кнопку **Ромб** (|rhomb|) автоматически повернет объект в соответствии с направлением движения.

source: **To link the object keyframes to the control points defining the motion path:**
ru: **Чтобы связать ключевые кадры объекта с контрольными точками, определяющими траекторию движения:**

source: Click the button *next to* the object bottom port to activate or deactivate the **Link to Control Points** option (|link_to_control_points|).
ru: Нажмите кнопку *рядом* с нижним портом объекта, чтобы активировать или деактивировать параметр **Link to Control Points** (|link_to_control_points|).

source: **To change the center of the object:**
ru: **Чтобы изменить центр объекта:**

source: Move the center of the object to the new position.
ru: Переместите центр объекта на новую позицию.

source: Right-click the object node in the Stage Schematic and select **Reset Center** from the menu that opens.
ru: Щелкните правой кнопкой мыши узел объекта в Stage Schematic и выберите **Сбросить центр** в открывшемся меню.

source: **To save a motion path:**
ru: **Чтобы сохранить траекторию движения:**

source: Right-click it and select **Save Motion Path** from the menu that opens.
ru: Щелкните правой кнопкой мыши и выберите **Сохранить траекторию движения** в открывшемся меню.

source: In the browser choose a location and a name and click the **Save** button. The file will be saved with the MPATH extension.
ru: В браузере выберите местоположение и имя и нажмите кнопку **Сохранить**. Файл будет сохранен с расширением MPATH.

source: **To load a motion path:**
ru: **Чтобы загрузить траекторию движения:**

source: Right-click the motion path and select **Load Motion Path** from the menu that opens.
ru: Щелкните правой кнопкой мыши траекторию движения и выберите **Загрузить траекторию движения** в открывшемся меню.

source: In the browser retrieve the MPATH file you want to load and click the Load button.
ru: В браузере найдите файл MPATH, который вы хотите загрузить, и нажмите кнопку Загрузить.

source: **To use a drawing vector stroke as a motion path:**
ru: **Чтобы использовать векторную черту рисования в качестве траектории движения:**

source: Select the vector stroke you want to use as a motion path with the **Selection** tool (|selection|).
ru: Выберите векторную строку, который вы хотите использовать в качестве траектории движения, с помощью инструмента **Выделения** (|selection|).

source: Copy/cut it.
ru: Скопируйте/вырежьте его.

source: Select the motion path you want to paste to, in the Stage Schematic.
ru: Выберите траекторию движения, в которую вы хотите вставить, в Stage Schematic.

source: Click in the viewer and paste the copied/cut vector that will automatically become the motion path.
ru: Щелкните в окне просмотра и вставьте скопированный/вырезанный вектор, который автоматически станет траекторией движения.

source: **To use a motion path as a vector stroke in a drawing:**
ru: **Чтобы использовать траекторию движения в качестве векторной линии на рисунке:**

source: Select the motion path in the Stage Schematic.
ru: Выберите траекторию движения в Stage Schematic.

source: Select the motion path with the **Selection** tool (|selection|) in the viewer.
ru: Выберите траекторию движения с помощью инструмента **Выделения** (|selection|) в окне просмотра.

source: Select the drawing where you want to paste the new stroke.
ru: Выберите рисунок, куда вы хотите вставить новую линию.

source: Paste the copied/cut motion path that will automatically become a stroke.
ru: Вставьте скопированную/вырезанную траекторию движения, которая автоматически станет линией.

source: **To remove a motion path from the Stage Schematic:**
ru: **Чтобы удалить траекторию движения из Stage Schematic:**

source: Select the motion path node and choose Edit → **Delete**.
ru: Выберите узел траектории движения и выберите пункт меню Правка → **Удалить**.

source: Right-click the motion path node and choose **Delete** from the menu that opens.
ru: Щелкните правой кнопкой мыши узел траектории движения и выберите **Удалить** в открывшемся меню.

source: Using Keys in Columns/Layers
ru: Использование ключей в столбцах/слоях

source: When columns/layers are animated, their animation can be controlled in a quick way by managing keyframes and interpolations directly in the Xsheet or Timeline, with no need to use the Function Editor.
ru: Когда столбцы/слои анимированы, их анимацией можно быстро управлять, управляя ключевыми кадрами и интерполяциями непосредственно в Xsheet или на Timeline, без необходимости использования Редактора функций.

source: As soon as a keyframe is defined for a column/layer, a **Key icon** is displayed on the right of the column/layer cell to which it refers; the key is displayed regardless of how many parameters are animated. Keys can be moved within the column/layer they refer to, and selected in order to be cut/copied and pasted from one cell to another.
ru: Как только ключевой кадр определен для столбца/слоя, справа от ячейки столбца/слоя отображается **символ ключа**; ключ отображается независимо от того, сколько параметров анимировано. Ключи можно перемещать в столбце/слое, к которому они относятся, и выбирать их для вырезания/копирования и вставки из одной ячейки в другую.

source: When the **Global Key** option is activated for the **Animate** tool, and the default interpolation is not set to **Linear**, as soon as at least two keyframes are created for a column, **a line connecting them with two arrowheads** is displayed (see :ref:`Animating Objects <animating_objects>` and :ref:`Setting Segment Interpolations <setting_segment_interpolations>` ). The two arrowheads divide the line into three sections indicating the speed in, the constant speed, and speed out phases *of all the transformations defined*. This allows you to control the speed of the movement between the two keys as you wish, including a constant speed movement.
ru: Когда опция **Глобальный ключ** активирована для инструмента **Анимирования**, и интерполяция по умолчанию не установлена ​​на **Линейный**, как только для столбца будут созданы как минимум два ключевых кадра, **a отображается строка, соединяющая их двумя стрелками** (см. :ref:`Анимирование объектов <animating_objects>` и :ref:`Настройка интерполяции сегментов <setting_segment_interpolations>`). Две стрелки делят линию на три секции, указывающие фазы скорости, постоянной скорости и скорости *всех преобразований, определенных*. Это позволяет вам контролировать скорость перемещения между двумя клавишами по своему желанию, включая постоянную скорость движения.

source: You can also cycle previously created keys, in order to repeat automatically all the previously defined keys for the whole length of the scene, with no need to copy and paste keys from cells to cells.
ru: Вы также можете циклически создавать ранее созданные ключи, чтобы автоматически повторять все ранее определенные ключи для всей длины сцены без необходимости копировать и вставлять ключи из ячеек в ячейки.

source: All animations and interpolations set for the column/layer can be visible and edited with the Function Editor. When you edit any column/layer transformation in the Function Editor, the arrowheads will not be displayed anymore between keys, to stress the fact that a specific interpolation has been modified with the Function Editor. If needed, you can **Reset** the whole column/layer transformation to the default interpolation values, and make the arrowheads available again (see :ref:`Editing Curves and Numerical Columns <editing_curves_and_numerical_columns>` ).
ru: Все анимации и интерполяции, установленные для столбца/слоя, можно увидеть и отредактировать с помощью редактора функций. Когда вы редактируете любое преобразование столбца/слоя в редакторе функций, стрелки больше не будут отображаться между клавишами, чтобы подчеркнуть тот факт, что определенная интерполяция была изменена с помощью редактора функций. При необходимости вы можете выполнить **Сброс** всех преобразований столбца/слоя до значений интерполяции по умолчанию и снова сделать стрелки доступными (см. :ref:`Редактирование кривых и числовых столбцов <editing_curves_and_numeric_columns>`).

source: **To modify a key:**
ru: **Чтобы изменить ключ:**

source: Select the cell the key refers to.
ru: Выберите ячейку, к которой относится ключ.

source: Use the **Animate** tool (|animate|) to modify position and size.
ru: Используйте инструмент **Анимирования** (|animate|) для изменения положения и размера.

source: Enter values you want to modify in the Animate tool (|animate|) options bar.
ru: Введите значения, которые вы хотите изменить, на панели параметров инструмента Анимирования (|animate|).

source: **To select keys:**
ru: **Чтобы выбрать ключи:**

source: **Click a key icon** to select it.
ru: **Нажмите значок ключа**, чтобы выделить его.

source: **Click a key icon and drag** to select a range of keys on different columns and at different frames.
ru: **Нажмите значок ключа и перетащите**, чтобы выбрать диапазон ключей в разных столбцах и в разных кадрах.

source: **Shift-click** to extend the selection to a specific key.
ru: **Кликните с зажатой клавишей Shift**, чтобы расширить выбор до определенной клавиши.

source: **Ctrl-click** (PC) or **Cmd-click** (Mac) to add to, or remove a key to the selection.
ru: **Щелкните с зажатой клавишей Ctrl (PC) или Cmd (Mac)**, чтобы добавить или удалить ключ к выделению.

source: **Right-click** a key icon and choose the related command from the menu that opens to perform specific selections, such as all keys in the row, all previous ones, all following ones, etc.
ru: **Щелкните правой кнопкой мыши** по значку ключаи выберите соответствующую команду в открывшемся меню для выполнения определенного выделения, такого как все ключи в ряду, все предыдущие, все последующие и т.п.

source: **To move a key selection:**
ru: **Чтобы переместить выделение ключей:**

source: Click any of the selected keys and drag the selection to the new position. Dragging is allowed only inside its own column/layer.
ru: Нажмите на любой из выделенных ключей и перетащите выделенную область на новую позицию. Перетаскивание разрешено только внутри собственного столбца/слоя.

source: **To edit a key selection:**
ru: **Чтобы изменить выделенный ключ:**

source: Use the **Cut** command to eliminate the selection from the scene and keep it in memory for further operations.
ru: Используйте команду **Вырезать**, чтобы исключить выделение из сцены и сохранить его в памяти для дальнейших операций.

source: Use the **Paste** command to paste the selection kept in memory starting from the selected cell.
ru: Используйте команду **Вставить**, чтобы вставить выделенную область памяти, начиная с выбранной ячейки.

source: All these commands are also available in the menu that opens when right-clicking the key icon.
ru: Все эти команды также доступны в меню, которое открывается при щелчке правой кнопкой мыши по значку ключа.

source: **To set the speed of the movement or transformation:**
ru: **Чтобы установить скорость движения или трансформации:**

source: **Click the arrowheads** available on the line connecting two subsequent keys, **and drag them up or down** to the new position. In particular:
ru: **Нажмите на стрелки**, доступные на линии, соединяющей два последующих ключа, **и перетащите их вверх или вниз** на новую позицию. В частности:

source: To set a **constant speed**, drag the top arrowhead close to the first key icon to eliminate the ease in section, and the bottom arrowhead close to the second key icon to eliminate the ease out section.
ru: Чтобы установить **постоянную скорость**, перетащите верхнюю стрелку рядом со значком первой клавиши, чтобы исключить элемент облегчения ввода, и нижнюю стрелку рядом со значком второй клавиши, чтобы исключить участок ослабления.

source: To set a **continuous acceleration**, drag both arrowheads close to the second key icon in order to increase the speed in section.
ru: Чтобы установить **непрерывное ускорение**, перетащите обе стрелки рядом со значком второго ключа, чтобы увеличить скорость в сечении.

source: To set a **continuous deceleration**, drag both arrowheads close to the first key icon in order to increase the speed out section.
ru: Чтобы установить **непрерывное замедление**, перетащите обе стрелки рядом с первым значком ключа, чтобы увеличить участок ускорения.

source: **To make the arrowheads available when they are not:**
ru: **Чтобы сделать стрелки доступными, когда их нет:**

source: Right-click the line connecting two subsequent keys and choose **Reset Interpolation** from the menu that opens.
ru: Щелкните правой кнопкой мыши линию, соединяющую два последующих ключа, и выберите **Сбросить интерполяцию** в открывшемся меню.

source: **To activate/deactivate the cycling of previously created keys:**
ru: **Чтобы активировать/деактивировать повторное использование ранее созданных ключей:**

source: Click the **Circular arrow** icon (|circular_arrow|) visible after the last key of a series.The cells affected by the cycled movement are marked on the right by *a zigzagged line*.
ru: Щелкните значок **Круговая стрелка** (|circular_arrow|), видимый после последнего ключа серии. Ячейки, затронутые циклическим движением, отмечены справа *зигзагообразной линией*.

source: **To open the Function Editor:**
ru: **Чтобы открыть редактор функций:**

source: Double-click a key.
ru: Дважды щелкните ключ.

source: Right-click a key and choose **Function Editor** from the menu that opens.
ru: Кликните правой кнопкой мыши и выберите **Редактор функций** в открывшемся меню.

source: Working with Multiple Column/Layer Keys
ru: Работа с несколькими ключами столбца/слоя

source: It is possible to insert or delete keys affecting the Xsheet/Timeline as a whole, or a selection of Xsheet columns (or Timeline layers).
ru: Можно вставлять или удалять ключи, влияющие на Xsheet/Timeline в целом, или выделение столбцов Xsheet (или слоев Timeline).

source: Inserting or deleting multiple keys allows you to manage keys for several columns/layers at the same time, for instance when you are working on a cutout animation where keys may be required for all the columns/layers where model sections are exposed (see :ref:`Creating Cutout Animation <creating_cutout_animation>` ).
ru: Вставка или удаление нескольких ключей позволяет вам управлять ключами для нескольких столбцов/слоев одновременно, например, когда вы работаете с перекладной анимацией, где ключи могут потребоваться для всех столбцов/слоев, где отображаются разделы модели (см. :ref:`Создание перекладной анимации <creating_cutout_animation>`).

source: Inserted keys are created for all the column transformations.
ru: Вставленные ключи создаются для всех преобразований столбцов.

source: When a multiple key is inserted at the current frame, a key is created for each Xsheet column (or Timeline layer) where an animation level is exposed; if a column/layer selection is defined, keys are created in selected columns/layers only (see :ref:`Working with Xsheet Columns <working_with_xsheet_columns>` ).
ru: Когда множественный ключ вставляется в текущий кадр, ключ создается для каждого столбца Xsheet (или слоя Timeline), где отображается уровень анимации; если выбор столбца/слоя определен, ключи создаются только в выделенных столбцах/слоях (см. :ref:`Работа с столбцами Xsheet <working_with_xsheet_columns>`).

source: When a multiple key is deleted at the current frame, any key available in any Xsheet column (or Timeline layer) at the current frame is deleted; if a column/layer selection is defined, keys are deleted in selected columns/layers only.
ru: При удалении множественных ключей в текущем кадре любой ключ, доступный в любом столбце Xsheet (или слое Timeline) в текущем кадре, удаляется; если выбран столбец/слой, ключи удаляются только в выбранных столбцах/слоях.

source: **To create several keys at once:**
ru: **Чтобы создать несколько ключей одновременно:**

source: Select the columns/layers for which you want to create keys.
ru: Выберите столбцы/слои, для которых вы хотите создать ключи.

source: Select no column by clicking anywhere in the Xsheet/Timeline, to create keys for all the columns/layers.
ru: Выберите столбец кликом в любом месте на Xsheet/Timeline, чтобы создать ключи для всех столбцов/слоев.

source: Select the frame where you want to insert keys.
ru: Выберите кадр, в который вы хотите вставить ключи.

source: Choose Xsheet → **Insert Multiple Keys**.
ru: Выберите Xsheet → **Вставить несколько ключей**.

source: **To remove several keys at once:**
ru: **Чтобы удалить несколько ключей одновременно:**

source: Select the columns/layers from which you want to delete keys.
ru: Выберите столбцы/слои, из которых вы хотите удалить ключи.

source: Select no column by clicking anywhere in the Xsheet/Timeline, to delete keys from all the columns/layers.
ru: Выберите столбец кликом в любом месте на Xsheet/Timeline, чтобы удалить ключи из всех столбцов/слоев.

source: Select the frame where you want to delete keys.
ru: Выберите кадр, в котором вы хотите удалить ключи.

source: Choose Xsheet → **Remove Multiple Keys**.
ru: Выберите Xsheet → **Удаление нескольких ключей**.

source: Working in a 3D Environment
ru: Работа в трехмерной среде

source: You can place and move cameras, the table, pegbars and columns/layers in a 3D environment, as if they were elements on a real 3D stage.
ru: Вы можете размещать и перемещать камеры, стол, штифты и столбцы/слои в трехмерной среде, как если бы они были элементами на реальной трехмерной сцене.
