Repository: Savraska2/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/creating_movements.po
Languages: ru

source: Creating Movements
ru: Создание движений

source: Each scene has a series of *objects* that can be transformed; they can be Xsheet columns (or Timeline layers), pegbars, cameras, or the table.
ru: Каждая сцена имеет набор *объектов*, которые могут быть преобразованы; это могут быть столбцы Xsheet (или слои Timeline), штифты, камеры или стол.

source: Every transformation you set for an object at a specific frame automatically defines a keyframe. When keyframes are defined at several frames, in-between positions are automatically interpolated.
ru: Каждое преобразование, которое вы устанавливаете для объекта в определенном кадре, автоматически определяет ключевой кадр. Когда ключевые кадры определены в нескольких кадрах, промежуточные позиции автоматически интерполируются.

source: To create more complex animations, you can also work in a 3D environment, where cameras and scene elements can be placed like on a stage at different distances one from another.
ru: Чтобы создавать более сложные анимации, вы также можете работать в трехмерной среде, где камеры и элементы сцены можно размещать как на сцене на разных расстояниях друг от друга.

source: Using the Stage Schematic
ru: Использование Схемы сцены

source: The Stage Schematic contains *nodes* for all of the objects used in a scene, making it possible to manage the way they are linked to each other. It's organized in a hierarchy starting from the animation table, where all the columns/layers and pegbars are placed. A camera is available as well, and additional cameras can be defined.
ru: Схема сцены содержит *ноды* всех объектов, используемых в сцене, что позволяет управлять их связями друг с другом. Она организована в иерархию, начиная с анимационного стола, где размещены все столбцы/слои и штифты. Камера также доступна, и дополнительные камеры могут быть определены.

source: By default the Stage Schematic contains the table node and one camera node.
ru: По умолчанию Схема сцены содержит узел таблицы и один узел камеры.

source: Column/layer nodes are added as soon as you load or create some content; pegbars and cameras can be added at any time (pegbars will be automatically linked to the table).
ru: Узлы столбца/слоя добавляются, как только вы загружаете или создаете некоторый контент; штифты и камеры могут быть добавлены в любое время (штифты будут автоматически связаны со столом).

source: When more than one camera is created, you can set which is the active one, used in the Viewer; the active camera node is displayed in blue while the others are left idle in grey. Each camera can have a different size and resolution, and each of them can be animated independently (see :ref:`Defining Camera Settings <defining_camera_settings>` ).
ru: Когда создано более одной камеры, вы можете установить, какая из них будет активной в Окне просмотра; активный узел камеры отображается синим цветом, а остальные неактивны серым. Каждая камера может иметь различный размер и разрешение, и каждая из них может быть анимирована независимо (см. :ref:`Определение настроек камеры <defining_camera_settings>`).

source: Objects nodes can be easily added and arranged and they can be selected in order to be cut, copied, pasted or deleted. When selected, nodes' edges are highlighted in white; the current node has its label displayed in yellow; when at least one node is selected, its related links are displayed in cyan.
ru: Узлы объектов могут быть легко добавлены и упорядочены, и их можно выбрать для вырезания, копирования, вставки или удаления. Когда выбрано, ребра узлов выделены белым; текущая метка узла отображается желтым цветом; если выбран хотя бы один узел, связанные ссылки отображаются синим цветом.

source: It's also possible to *group* several nodes into one single node, in order to better manage a complex Stage Schematic. Groups can be opened to be examined, and its components can be selected for further operations, like creating animations or new groups.
ru: Также возможно *сгруппировать* несколько узлов в один узел, чтобы лучше управлять сложной схемой этапов. Группы могут быть открыты для изучения, и их компоненты могут быть выбраны для дальнейших операций, таких как создание анимации или новых групп.

source: Column/layer nodes have buttons defining their visibility in Camera stand (|camera_stand|) and Render (|preview|) views, these buttons are located at the top right of the nodes: the toggles are linked to the ones available in the Xsheet columns (Timeline layers) headers (see :ref:`Working with Xsheet Columns <working_with_xsheet_columns>` ).
ru: Узлы столбцов/слоев имеют кнопки, определяющие их видимость в представлениях Стандартный вид с камеры (|camera_stand|) и Рендер (|preview|), эти кнопки расположены в верхнем правом углу узлов: переключатели связаны с доступны в заголовках столбцов Xsheet (слои Timeline) (см. :ref:`Работа со столбцами Xsheet <working_with_xsheet_columns>`).

source: **To access the stage schematic:**
ru: **Для доступа к Cхеме сцены:**

source: Go to the Window menu, and choose the Schematic option.
ru: Перейдите в меню Окна и выберите Схема.

source: If necessary, click the FX/Stage toggle button (|schematic|) in the bottom bar of the Schematic pane until the title bar displays Stage Schematic.
ru: При необходимости нажимайте кнопку Переключение схемы FX (|schematic|) в нижней панели Схема сцены, пока в строке заголовка не отобразится Stage Schematic.

source: **To navigate the stage schematic:**
ru: **Для навигации по схеме сцены:**

source: Do one of the following:
ru: Выполните одно из следующих действий:

source: Use the mouse wheel, or the zoom shortcut keys (by default + and - keys) to zoom in and zoom out.
ru: Используйте колесико мыши или сочетания клавиш увеличения (по умолчанию клавиши + и -) для увеличения или уменьшения масштаба.

source: Middle-click and drag to scroll in any direction.
ru: Нажмите среднюю кнопку мыши и перетащите, чтобы прокрутить в любом направлении.

source: Use the **Fit to Window** button (|fit_to_window|) in the bottom bar of the stage window to display all the objects in the current window.
ru: Используйте кнопку **По размеру окна** (|fit_to_window|) в нижней панели окна сцены, чтобы отобразить все объекты в текущем окне.

source: Use the **Focus on Current** button (|focus_on_current|) in the bottom bar of the stage window to center the stage on the current object.
ru: Используйте кнопку **Фокус на текущем** (|focus_on_current|) в нижней панели окна сцены, чтобы центрировать сцену на текущем объекте.

source: Use the **Reorder Nodes** button (|reorder_nodes|) in the bottom bar of the stage window to change the position of the nodes in the schematic to a default arrangement.
ru: Используйте кнопку **Изменение порядка узлов** (|reorder_nodes|) в нижней панели окна рабочей области, чтобы изменить положение узлов в схеме на расположение по умолчанию.

source: Use the **Reset Size** button (|reset|) in the bottom bar of the stage window, or use the reset view shortcut (by default the 0 key) to display all the objects at the default size.
ru: Используйте кнопку **Сбросить размер** (|reset|) в нижней панели окна сцены или используйте горячую клавишуа (по умолчанию клавиша 0), чтобы отобразить все объекты с размером по умолчанию.

source: **To add a column/layer:**
ru: **Чтобы добавить столбец/слой:**

source: Load or create some content for the Xsheet column (Timeline layer): it will be automatically displayed in the Stage Schematic.
ru: Загрузите или создайте некоторый контент для столбца Xsheet (слоя Timeline): он будет автоматически отображаться в схеме сцены.

source: **To add a pegbar:**
ru: **Чтобы добавить штифты:**

source: Click the **New Pegbar** button (|pegbar|) in the bottom bar of the Stage Schematic window.
ru: Нажмите кнопку **Новый Pegbar** (|pegbar|) в нижней панели окна Схемы сцены.

source: Right-click in the Stage Schematic and choose **New Pegbar** from the menu that opens.
ru: Щелкните правой кнопкой мыши в Stage Schematic и выберите **Новый Pegbar** в открывшемся меню.

source: **To add a camera:**
ru: **Чтобы добавить камеру:**

source: Click the **New Camera** button (|camera|) in the bottom bar of the Stage Schematic window.
ru: Нажмите кнопку **Новая камера** (|camera|) в нижней панели окна Схема сцены.

source: Right-click in the Stage Schematic and choose **New Camera** from the menu that opens.
ru: Щелкните правой кнопкой мыши на схеме сцены и выберите **Новая камера** в открывшемся меню.

source: **To set the active camera:**
ru: **Чтобы установить активную камеру:**

source: In the Stage Schematic right-click the camera node you want to set as active and choose **Activate** from the menu that opens.
ru: В Cхеме сцены щелкните правой кнопкой мыши узел камеры, который вы хотите установить в качестве активного, и выберите **Активировать** в открывшемся меню.

source: **To rename an object:**
ru: **Чтобы переименовать объект:**

source: Ctrl + double-click the node name and type a new one.
ru: Щелкните два раза по имени узла зажав клавишу Ctrl и введите новое имя.

source: **To minimize or maximize column/layer nodes:**
ru: **Чтобы свернуть или развернуть узлы столбцов/слоев:**

source: Click the arrowhead button to the left of the node name to minimize/maximize it selectively.
ru: Нажмите кнопку со стрелкой слева от имени узла, чтобы выборочно свернуть/развернуть его.

source: Click the **Maximize Nodes** (|maximize|) button in the bottom bar of the Stage Schematic pane to minimize/maximize all of the nodes.
ru: Нажмите кнопку **Максимизировать узлы** (|maximize|) в нижней панели Stage Schematic , чтобы свернуть/развернуть все узлы.

source: **To select objects and links:**
ru: **Для выбора объектов и ссылок:**

source: Click to select an object.
ru: Нажмите, чтобы выбрать объект.

source: Click and drag to select a group of objects.
ru: Нажмите и перетащите, чтобы выбрать группу объектов.

source: Ctrl-click (PC) or Cmd-click (Mac) to add an object to, or remove it from the selection.
ru: Кликните, зажав клавишу Ctrl (PC) или Cmd (Mac), чтобы добавить объект или удалить его из выделения.

source: Links can be selected together with objects (see :ref:`Linking Objects <linking_objects>` ).
ru: Ссылки можно выбирать вместе с объектами (см. :ref:`Связывание объектов <linking_objects>`).

source: **To move the selection:**
ru: **Чтобы переместить выделение:**

source: Click and drag any object of the selection.
ru: Нажмите и перетащите любой объект выделения.

source: **To edit an objects selection:**
ru: **Чтобы изменить выделение объектов:**

source: Use the **Copy** command to keep the selection in memory for further operations.
ru: Используйте команду **Копировать**, чтобы сохранить выбор в памяти для дальнейших операций.

source: Use the **Cut** command to eliminate the nodes selection from the Stage Schematic and keep them in memory for further operations.
ru: Используйте команду **Вырезать**, чтобы исключить выбор узлов из Stage Schematic и сохранить их в памяти для дальнейших операций.

source: Use the **Paste** command to paste the selection kept in memory in the Stage Schematic: the pasted selection will be linked to the same object to which the copied or cut objects were linked.
ru: Используйте команду **Вставить**, чтобы вставить выделенную область, сохраненную в памяти в Cхеме сцены: вставленная выделенная область будет связана с тем же объектом, с которым были связаны скопированные или вырезанные объекты.

source: Use the **Delete** command to delete the selection.
ru: Используйте команду **Удалить**, чтобы удалить выбор.

source: All of these commands are available in the menu that opens when right-clicking nodes and links.
ru: Все эти команды доступны в меню, которое открывается при щелчке правой кнопкой мыши узлов и ссылок.

source: The table and the default camera cannot be removed from the Stage Schematic.
ru: Стол и камера по умолчанию не могут быть удалены из Stage Schematic.

source: **To Group selected objects:**
ru: **Сгруппировать выбранные объекты:**

source: Right-click any selected nodes and choose **Group** from the menu that opens.
ru: Щелкните правой кнопкой мыши любые выбранные узлы и выберите **Сгруппировать** в открывшемся меню.

source: Nodes can only be grouped if they share the parent node, and the parent node is included in the selection.
ru: Узлы могут быть сгруппированы, только если они совместно используют родительский узел, а родительский узел включен в выделение.

source: **To open a Group:**
ru: **Чтобы открыть группу:**

source: Right-click the group and choose **Open Group** from the menu that opens: the group objects are displayed in a box, showing links between group nodes, and links with nodes outside of the group.
ru: Щелкните правой кнопкой мыши группу и выберите **Открыть группу** в открывшемся меню: объекты группы отображаются в окне, показывая ссылки между узлами группы и ссылки с узлами вне группы.

source: In the Stage Schematic, when the content of a group is displayed it's not possible to edit the links between group nodes, and links with nodes outside of the group.
ru: В Stage Schematic, когда отображается содержимое группы, невозможно редактировать ссылки между узлами группы и ссылки с узлами вне группы.

source: **To close a Group:**
ru: **Чтобы закрыть группу:**

source: Click the **Close button** on the right of the group box bar.
ru: Нажмите кнопку **Закрыть** справа на панели группового блока.

source: **To release a Group:**
ru: **Чтобы разгруппировать группу:**

source: Right-click the group and choose **Ungroup** from the menu that opens.
ru: Щелкните правой кнопкой мыши группу и выберите **Разгруппировать** в открывшемся меню.

source: **To reorder nodes in the Stage Schematic:**
ru: **Чтобы изменить порядок узлов в Stage Schematic:**

source: Click the **Reorder Nodes** button (|reorder_nodes|) in the bottom bar of the stage window.
ru: Нажмите кнопку **Изменение порядка узлов** (|reorder_nodes|) в нижней панели окна сцены.

source: Linking Objects
ru: Связывание объектов

source: Objects can be linked in order to create shared movements (movements that all the linked objects share with the parent object) and relative movements (movements that are the sum of the object's own movement and the movement of its parent object).
ru: Объекты могут быть связаны, чтобы создавать общие движения (движения, которые все связанные объекты делят с родительским объектом) и относительные движения (движения, которые являются суммой собственного движения объекта и движения его родительского объекта).

source: As parent objects can be linked, in their turn, to other moving objects, it is possible to define a complex hierarchy of transformations.
ru: Поскольку родительские объекты, в свою очередь, могут быть связаны с другими движущимися объектами, можно определить сложную иерархию преобразований.

source: The hierarchy between objects can be edited by setting links that allow you to set parent and linked objects: columns/layers can be linked to other columns/layers, pegbars, the table or cameras; pegbars can be linked to other pegbars, the table or cameras; cameras can be linked to any object in order to create complex shots, for example with a camera following the movement of a character in the scene.
ru: Иерархия между объектами может быть отредактирована путем установки ссылок, которые позволяют вам устанавливать родительские и связанные объекты: столбцы/слои могут быть связаны с другими столбцами/слоями, штифтами, таблицей или камерами; штифты могут быть связаны с другими штифтами, таблицей или камерами; камеры могут быть связаны с любым объектом для создания сложных снимков, например, с помощью камеры, следящей за движением персонажа в сцене.

source: Links can be set by using the ports located at each side of the object node:
ru: Ссылки могут быть установлены с помощью портов, расположенных на каждой стороне узла объекта:

source: The **port on the left** is for linking the object to a **parent** object.
ru: **порт слева** предназначен для связывания объекта с **родительским** объектом.

source: The **port on the right** is for linking the object to a **child** object.
ru: **порт справа** предназначен для связывания объекта с **дочерним** объектом.

source: The **port at the bottom** is for assigning the object a **motion path** to follow (see for :ref:`Creating a Movement along a Motion Path <creating_a_movement_along_a_motion_path>` ).
ru: **порт в нижней части** предназначен для назначения объекту **траектории движения**, по которой следует следовать (см. :ref:`Создание движения по траектории движения <creating_a_movement_along_a_motion_path>`).

source: Links can also be selected in order to be deleted: when selected, links are highlighted; when at least one object is selected, the related links are displayed in blue.
ru: Ссылки также могут быть выбраны для удаления: при выборе ссылки подсвечиваются; когда выбран хотя бы один объект, связанные ссылки отображаются синим цветом.

source: Columns/layers and pegbars are always linked, at least to the table: this means that their links cannot be deleted, but only replaced with different ones or restored to their default: the table.
ru: Столбцы/слои и штифты всегда связаны, по крайней мере, с таблицей: это означает, что их ссылки не могут быть удалены, но могут быть заменены только другими или восстановлены по умолчанию: таблица.

source: **To link a node to another:**
ru: **Чтобы связать узел с другим:**

source: In the Stage Schematic, click and drag from a node's left port to the parent node's right port, or viceversa.
ru: В Stage Schematic щелкните и перетащите с левого порта узла на правый порт родительского узла или наоборот.

source: **To link a column/layer to another object:**
ru: **Чтобы связать столбец/слой с другим объектом:**

source: Do any of the following:
ru: Выполните любое из следующих действий:

source: Define the link in the Stage Schematic.
ru: Определите ссылку в схеме сцены.

source: Select the **Animate** tool (|animate|) with the **Pick:** option set to **Column**, and in the viewer **Shift-click** the column contents to which you want to link the current column.
ru: Выберите Инструмент **Анимирования** (|animate|) с параметром **Выбрать:**, установленным на **Столбец**, и в окне просмотра **кликните, удерживая нажатой клавишу Shift** содержимое столбца, к которому нужно связать текущий столбец.

source: **To select the linked object to edit in the hierarchy:**
ru: **Чтобы выбрать связанный объект для редактирования в иерархии:**

source: Select it in the Stage Schematic.
ru: Выберите его в схеме сцены.

source: Use the **Animate** tool (|animate|) with the **Pick:** option set to **Pegbar** to click a drawing in the viewer and select the first pegbar in the hierarchy the column containing the drawing is linked to.
ru: Используйте Инструмент **Анимирования** (|animate|) с параметром **Выбрать:**, установленным на **Pegbar**, чтобы щелкнуть рисунок в окне просмотра и выбрать первый pegbar в иерархии в столбце, содержащем связанный рисунок.

source: Right-click a drawing in the viewer to choose from the menu that opens the **Select** command related to the object that you want to edit.
ru: Щелкните правой кнопкой мыши рисунок в окне просмотра, чтобы выбрать из меню, которое открывает команду **Выбрать**, связанную с объектом, который вы хотите редактировать.

source: **To select links:**
ru: **Для выбора ссылок:**

source: Click to select a link.
ru: Нажмите, чтобы выбрать ссылку.

source: Click and drag to select several links.
ru: Нажмите и перетащите, чтобы выбрать несколько ссылок.

source: Ctrl-click (PC) or Cmd-click (Mac) to add a link to, or remove it from the selection.
ru: Кликните, зажав клавишу Ctrl (PC) или Cmd (Mac), чтобы добавить ссылку или удалить ее из выделения.

source: Objects can be selected together with links (see :ref:`Using the Stage Schematic <using_the_stage_schematic>` ).
ru: Объекты могут быть выбраны вместе со ссылками (см. :ref:`Использование схемы сцены <using_the_stage_schematic>`).

source: **To remove selected links:**
ru: **Чтобы удалить выбранные ссылки:**

source: Choose Edit → **Delete**, links will be replaced by default ones (i.e to the table).
ru: Выберите пункт меню Правка → **Удалить**, ссылки будут заменены ссылками по умолчанию (т.е. на стол).

source: Advanced Linking
ru: Расширенные ссылки

source: Optionally, the connector ports can be displayed as letters (instead of the default circles), to be able to control, in more advanced ways, the position of the centers to be used when linking the nodes:
ru: Опционально, порты соединителей могут отображаться в виде букв (вместо кружков по умолчанию), чтобы иметь возможность более сложным образом контролировать положение центров, которые будут использоваться при связывании узлов:

source: Center **B** is the geometrical center of each object (and the default connection option).
ru: Центр **B** - это геометрический центр каждого объекта (и вариант подключения по умолчанию).

source: Center **A** is placed 8 inches to the left.
ru: Центр **A** расположен на 8 дюймов влево.

source: Center **C** is placed 8 inches to the right.
ru: Центр **C** расположен на 8 дюймов вправо.

source: etc.
ru: и так далее.

source: When a link is created, the letters at its ends set the way the linked object overlaps with the parent object. If at both ends of the link you set the same letter, the two objects will overlap with no offset respect to their default centers; while if for example, a column centered on B is linked to a pegbar centered on A, it will have an offset of 8 inches to the left.
ru: Когда ссылка создается, буквы на ее концах определяют способ, которым связанный объект перекрывается с родительским объектом. Если на обоих концах ссылки вы установите одну и ту же букву, два объекта будут перекрываться без смещения относительно их центров по умолчанию; в то время как, например, если столбец с центром в B связан с pegbar с центром в A, он будет иметь смещение в 8 дюймов влево.

source: Apart from letters, columns have also numbered centers as well; these serve for setting links relative to the position of Hooks assigned to these columns (see :ref:`Using Hooks <using_hooks>` ).
ru: Помимо букв, столбцы также имеют пронумерованные центры; они служат для установки ссылок относительно положения Крюков, назначенных этим столбцам (см. :ref:`Использование крюков <using_hooks>`).

source: Center **1** is the center defined by hook number 1.
ru: Центр **1** - это центр, определяемый крючком №1.

source: Center **2** is the center defined by hook number 2.
ru: Центр **2** является центром, определяемым крюком №2.

source: While in this mode, each node will have always a free connector port available in order to accept a link to a different center. In this way if you want to link another object to the same parent object, you can choose whether to use the same center or a different one.
ru: В этом режиме для каждого узла всегда будет доступен свободный соединительный порт, чтобы принимать ссылку на другой центр. Таким образом, если вы хотите связать другой объект с тем же родительским объектом, вы можете выбрать, использовать ли тот же центр или другой.

source: By defining parent and child objects you can also create cutout animation (see :ref:`Creating Cutout Animation <creating_cutout_animation>` ).
ru: Определяя родительские и дочерние объекты, вы также можете создавать перекладную анимацию (см. :ref:`Создание перекладной анимации <creating_cutout_animation>`).

source: **To switch the connector ports display mode:**
ru: **Для переключения режима отображения портов разъема:**
