Repository: Savraska2/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/creating_movements.po
Languages: ru

source: This means that it's possible to move the camera automatically generating a multiplane effect, or truck it through characters and elements simulating a perspective effect, or create complex 3D motion paths for any element by combining a depth movement with movements in the E/W and N/S directions.
ru: Это означает, что можно автоматически перемещать камеру, генерируя многоплановый эффект, или перемещать ее по персонажам и элементам, имитирующим эффект перспективы, или создавать сложные трехмерные траектории движения для любого элемента, комбинируя движение глубины с движениями в E/W и N/S направления.

source: The 3D environment can be activated, or deactivated, with the **3D View** button (|3d|) available in the Viewer title bar. When activated, the viewer displays the cone of the camera and all of the scene contents along the Z axis, which is the direction from the camera to the table. The area displayed can be moved and rotated to set the best viewing angle, and a side or top viewpoint can be set.
ru: 3D-среду можно активировать или деактивировать с помощью кнопки **3D-просмотр** (|3d|) в строке заголовка окна просмотра. При активации окно просмотра отображает конус камеры и все содержимое сцены вдоль оси Z, которая является направлением от камеры к столу. Отображаемую область можно перемещать и поворачивать для установки наилучшего угла обзора, а также можно установить боковую или верхнюю точку обзора.

source: By default all the pegbars and columns are on the table: their Z position is equal to the number of horizontal fields defined for the default camera (as the value represents the size of the area that is shot by the camera) (see :ref:`Defining Camera Settings <defining_camera_settings>` ). By increasing the field value, objects are placed farther from the camera; by decreasing it, objects are placed closer to the camera; at zero they are at the same Z position as the camera, and for negative values they are behind the camera.
ru: По умолчанию все штифты и столбцы находятся на столе: их позиция Z равна количеству горизонтальных полей, определенных для камеры по умолчанию (так как значение представляет размер области, снимаемой камерой) (см. :ref:`Определение настроек камеры <defining_camera_settings>`). При увеличении значения поля объекты размещаются дальше от камеры; уменьшая его, объекты размещаются ближе к камере; в нуле они находятся в той же позиции Z, что и камера, а для отрицательных значений они находятся за камерой.

source: As concerning the camera, by default its Z position is equal to the number of horizontal fields defined for the default camera. By increasing the field value, the camera moves farther from the table; by decreasing it, it moves closer; at zero it is at the same Z position of the table and for negative values it is behind the table.
ru: Что касается камеры, то по умолчанию ее позиция Z равна количеству горизонтальных полей, определенных для камеры по умолчанию. Увеличивая значение поля, камера перемещается дальше от стола; уменьшая его, он приближается; в нуле он находится в той же позиции Z стола, а для отрицательных значений - за столом.

source: As soon as objects are moved, *projections on an imaginary floor and side wall* let you understand the position of the drawings in relation to each other and to the camera. If the current object is a column/layer, a dotted bounding box displays the area of it currently being shot by the camera.
ru: Как только объекты перемещаются, *проекции на воображаемый пол и боковую стену* позволяют понять положение рисунков по отношению друг к другу и к камере. Если текущим объектом является столбец/слой, пунктирная ограничительная рамка отображает область его съемки в данный момент камерой.

source: The size of the objects changes according to its Z position, like in a real 3D environment, decreasing when an object is farther from the camera and increasing when closer. To keep control of this behaviour it's possible to define an additional Z position value in the tool options bar, that sets the position at which the object has to keep its original size.
ru: Размер объектов изменяется в соответствии с его положением Z, как в реальной трехмерной среде, уменьшается, когда объект находится дальше от камеры, и увеличивается, когда он ближе. Чтобы сохранить контроль над этим поведением, можно определить дополнительное значение позиции Z на панели параметров инструмента, которое устанавливает позицию, в которой объект должен сохранять свой первоначальный размер.

source: Columns closer to the camera are displayed on top of others, ignoring the Xsheet/Timeline order and the **SO** value. In case two or several columns have exactly the same distance, the **SO** value prevails; if two or several columns have exactly the same distance and SO value, the Xsheet column (or Timeline layer) order prevails (see :ref:`Changing Columns Stacking Order <changing_columns_stacking_order>` ).
ru: Столбцы ближе к камере отображаются поверх других, игнорируя порядок Xsheet/Timeline и значение **Порядка**. Если два или несколько столбцов имеют одинаковое расстояние, значение **Порядка** имеет преимущественную силу; если два или несколько столбцов имеют одинаковое расстояние и значение Порядка, преобладает порядок столбцов Xsheet (или слоя Timeline) (см. :ref:`Изменение порядка размещения столбцов <changing_columns_stacking_order>`).

source: **To enter the 3D environment:**
ru: **Чтобы войти в 3D-среду:**

source: Click the **3D View** button (|3d|) available on the right of the viewer title bar.
ru: Нажмите кнопку **3D-просмотр** (|3d|), расположенную справа от строки заголовка окна просмотра.

source: **To set an object position in the 3D environment:**
ru: **Чтобы установить положение объекта в трехмерной среде:**

source: Activate the **3D View**.
ru: Активируйте **3D-просмотр**.

source: Select the object you want to move.
ru: Выберите объект, который вы хотите переместить.

source: Select the **Animate** tool (|animate|).
ru: Выберите инструмент **Анимирования** (|animate|).

source: Enter a value for the **Z** position in the tool options bar.
ru: Введите значение для позиции **Z** на панели параметров инструмента.

source: Use the **double-arrow handle** parallel to the floor of the 3D environment, to move the selected object and set its Z position.
ru: Используйте указатель **с двойной стрелкой**, параллельную полу 3D-среды, чтобы переместить выбранный объект и установить его положение Z.

source: **To set at which position the object has to keep its original size:**
ru: **Чтобы установить, в каком положении объект должен сохранять свой первоначальный размер:**

source: Enter a value for the **additional Z position** field *displayed in brackets* in the tool options bar. For example if you want a column content to keep its original size when placed at the Z position 8, also enter 8 as the value in brackets.
ru: Введите значение для **дополнительного поля Z позиции**, *отображаемого в скобках* на панели параметров инструмента. Например, если вы хотите, чтобы содержимое столбца сохраняло свой первоначальный размер при размещении в позиции Z 8, также введите 8 в качестве значения в скобках.

source: **To move the work area displayed in 3D:**
ru: **Чтобы переместить рабочую область, отображаемую в 3D:**

source: Select the **Hand** tool (|hand|) and drag in the viewer.
ru: Выберите инструмент **Рука** (|hand|) и перетащите его в окно просмотра.

source: **To rotate the work area displayed in 3D:**
ru: **Чтобы повернуть рабочую область, отображаемую в 3D:**

source: Select the **Rotate** tool (|rotate|) and drag in the viewer.
ru: Выберите инструмент **Поворот** (|rotate|) и перетащите его в окно просмотра.

source: **To set a side or a top view:**
ru: **Чтобы установить вид сбоку или вид сверху:**

source: To set a **Side view** use the button (|side_view|) available on the side wall of the 3D environment.
ru: Чтобы установить **Вид сбоку**, используйте кнопку (|side_view|), доступную на боковой стене 3D-среды.

source: To set a **Top view** use the button (|top_view|) available on the floor of the 3D environment.
ru: Чтобы установить **Вид сверху**, используйте кнопку (|top_view|), доступную на полу 3D-среды.

source: **To exit the 3D environment:**
ru: **Чтобы выйти из 3D-среды:**

source: Click the **Camera Stand** (|camera_stand|) or **Camera View** (|camera_view|) buttons available on the right of the viewer title bar.
ru: Нажмите кнопки **Стандартный вид с камеры** (|camera_stand|) или **Вид с камеры** (|camera_view|), доступные в правой части строки заголовка окна просмотра.
