Repository: Savraska2/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/create_animations_using_plastic_tool.po
Languages: ru

source: Create animations using Plastic tool
ru: Создание анимации с помощью Plastic Tool

source: Plastic is a powerful tool (|plastic|) that can be used as complement in a cutout animation context, as well as a stand-alone animation tool capable of bringing to life a character starting from a single drawing. Using a reference skeleton and a deformable mesh, Plastic allows to curving and deforming each element it's applied to, creating smooth animations.
ru: Plastic tool - это мощный инструмент (|plastic|), который можно использовать в качестве дополнения в контексте перекладной анимации, а также самостоятельный инструмент анимации, способный оживить персонажа, начиная с одного рисунка. Используя референсный скелет и деформируемую сетку, Plastic tool позволяет изгибать и деформировать каждый элемент, к которому он применяется, создавая плавные анимации.

source: Using Plastic tool
ru: Применение Plastic Tool

source: The **Plastic** tool needs as starting input at least one column of the Xsheet (or layer of the Timeline) where one or more drawings are exposed; from now on this will be referred to as the *texture-column* (or **TC**). Using the outlines of the exposed drawing/s as references, the Plastic tool generates a triangular mesh contained in a new kind of column/layer: the *Mesh* column/layer. Each newly created Mesh column/layer is automatically connected to the proper TC. This link is a core point in the way Plastic works: every column/layer linked to a mesh will be deformed by it, and displayed within the mesh boundaries while rendering.
ru: Инструмент **Plastic** Tool требует в качестве начального ввода по крайней мере один столбец Xsheet (или слой Timeline), где отображается один или несколько рисунков; с этого момента это будет называться *texture-column* (или **TC**). Используя контуры экспонированных рисунков в качестве референсов, Plastic tool создает сетку из треугольников, содержащуюся в новом типе столбца/слоя: столбец/слой *Полисетка*. Каждый вновь созданный столбец/слой полисетки автоматически подключается к соответствующему TC. Эта ссылка является основной точкой в ​​работе Plastic: каждый столбец/слой, связанный с сеткой, будет деформироваться им и отображаться в пределах границ сетки при рендеринге.

source: For animating/deforming a Mesh level, Plastic allows the building of a specific skeleton structure active on the mesh. The skeleton is a set of connected vertices, and, for each vertex, different parameters can be specified as: **Position**, **Angle Bounds**, **Rigidity** and **Staking Order**. Thus a great range of animations and effects can easily be created.
ru: Для анимации/деформации уровня сетки, Plastic позволяет создать определенную структуру скелета, активную на сетке. Каркас представляет собой набор связанных вершин, и для каждой вершины можно указать различные параметры: **Положение**, **Угол привязки**, **Жесткость** и **Порядок переркрытия линий**. Таким образом, можно легко создать большой спектр анимаций и эффектов.

source: The Plastic tool is applied to a column of the Xsheet (or layer of the Timeline), and the content of it can be an animated level.
ru: Инструмент Plastic tooll применяется к столбцу Xsheet (или слою Timeline), и его содержимое может быть анимированным уровнем.

source: Building a Plastic mesh
ru: Построение полисетки используя Plastic Tool

source: The first step for using Plastic is creating a mesh for the Xsheet column (or Timeline layer) that we are going to animate using the **Plastic** tool. The Mesh is a special kind of level, and can be saved as any other kind of levels.
ru: Первым шагом для использования Plastic tool является создание сетки для столбца Xsheet (или слоя Timeline), которую мы собираемся анимировать с помощью инструмента **Plastic**. Сетка - это особый уровень, который можно сохранить как любой другой уровень.

source: The Mesh level can be seen as *purple* column/layer created when the button **Create Mesh** of the **Plastic** tool is pressed.
ru: Уровень сетки можно увидеть как *фиолетовый* столбец/слой, созданный при нажатии кнопки **Создать полисетку** инструмента **Plastic**.

source: The mesh is the real object that the Plastic tool modifies when a plastic skeleton is animated. For this reason all the elements, that are going to be animated by the Plastic tool, need a mesh.
ru: Полисетка - это реальный объект, который инструмент Plastic изменяет, когда анимируется пластиковый скелет. По этой причине все элементы, которые будут анимированы инструментом Plastic, нуждаются в сетке.

source: **To create a Plastic mesh:**
ru: **Чтобы создать полисетку:**

source: Select the column/layer that is going to be animated using the Plastic tool. This will be the *texture-column* (TC) of the mesh that is going to be created.
ru: Выберите столбец/слой, который будет анимирован, используя инструмент Plastic. Это будет *текстура-столбец* (TC) полисетки, который будет создан.

source: Choose the **Plastic** tool (|plastic|)
ru: Выберите инструмент **Plastic** (|plastic|)

source: Press the **Create Mesh** button in the tool options bar.
ru: Нажмите кнопку **Создать полисетку** на панели параметров инструмента.

source: Check, in the dialog that opens, the Mesh density in the preview area. Adjust as needed the density using the **Mesh Edges Length** slider.
ru: Проверьте, в открывшемся диалоговом окне, плотность сетки в области предварительного просмотра. При необходимости отрегулируйте плотность с помощью ползунка **Длина кромки полисетки**.

source: The density of the mesh is crucial for having smooth curves when rotating the skeleton vertex. Lower the **Mesh Edges Length** value and higher the density of the mesh will be, thus a better quality of the animation will be assured, but more computing resources will be required.
ru: Плотность полисетки имеет решающее значение для получения гладких кривых при вращении вершины скелета. Чем ниже значение **Длина кромки полисетки**, тем выше будет плотность сетки, поэтому будет обеспечено лучшее качество анимации, но потребуется больше вычислительных ресурсов.

source: The preview will show you just one level at time, even if you have selected multiple columns/layers, to check the preview of each column/layer you have to select them one by one *while* the **Plastic** tool is active. Each time you change the column/layer selection the preview will update for the new content.
ru: Предварительный просмотр покажет вам только один уровень за раз, даже если вы выбрали несколько столбцов/слоев, чтобы проверить предварительный просмотр каждого столбца/слоя, вы должны выбрать их один за другим, *в то время как* **Plastic tool** активен. Каждый раз, когда вы меняете выбор столбца/слоя, предварительный просмотр будет обновляться для нового содержимого.

source: If needed, change the value of the **Rasterization DPI** parameter. This value represents the DPI used when the TC is rendered as a texture for the mesh. It's recommend using a value consistent with the Camera resolution. A DPI too high compared to the Camera resolution might cause the contours of the TC not to be very soft.
ru: При необходимости измените значение параметра **Растеризация DPI**. Это значение представляет DPI, используемый, когда TC отображается как текстура для полисетки. Рекомендуется использовать значение, соответствующее разрешению камеры. Слишком высокое значение DPI по сравнению с разрешением камеры может привести к тому, что контуры TC будут не очень мягкими.

source: The **Rasterization DPI** parameter is available only when you are creating the mesh from Toonz Vector levels.
ru: Параметр **Растеризация DPI** доступен только при создании сетки из уровней Toonz Vector.

source: Adjust the **Mesh Margin** value. This parameter is expressed in *pixels* because it's used when the texture is projected on the mesh, an appropriate amount of margin will be needed to preserve the aliasing of the picture.
ru: Настройте значение **Край полисетки**. Этот параметр выражается в *пикселах*, поскольку он используется, когда текстура проецируется на полисетку, для сохранения псевдонимов изображения потребуется соответствующее количество полей.

source: If you are creating a mesh from a **Sub-Xsheet**, you can choose which elements of the Sub-Xsheet will be used by the Plastic tool for computing the mesh: simply turn off visibility for the elements that will not contribute to the mesh outline.
ru: Если вы создаете сетку из **Sub-Xsheet**, вы можете выбрать, какие элементы Sub-Xsheet будут использоваться инструментом Plastic для вычисления сетки: просто отключите видимость для элементов, которые не будут внести свой вклад в контур полисетки.

source: Click the **Apply** button to create the mesh. Now you can see the mesh drawn in *green* colour in the Viewer, and a new *purple* column in the Xsheet (or layer in the Timeline) next to the TC.
ru: Нажмите кнопку **Применить**, чтобы создать сетку. Теперь вы можете видеть сетку, нарисованную *зеленым* цветом в окне просмотра, и новый *фиолетовый* столбец в Xsheet (или слое на Timeline) рядом с TC.

source: In the **Stage Schematic** you can see that the *TC* node is now connected to the *Mesh* node just created, its node has a *purple* header for easing recognition.
ru: В **Stage Schematic** вы можете видеть, что узел *TC* теперь подключен к только что созданному узлу *Полисетка*, его узел имеет *фиолетовый* заголовок для облегчения распознавания.

source: If the **Create Mesh** is applied to a column/layer that is already modified by the Plastic tool (then already linked to a Mesh level) a dialog will prompt asking how to manage the new and the old Mesh files, and the user can choose from one of three options:
ru: Если действие **Создать сетку** применяется к столбцу/слою, который уже изменен инструментом Plastic (затем уже связан с уровнем сетки), диалоговое окно предложит запросить, как управлять новыми и старыми файлами сетки, и пользователь может выбрать один из трех вариантов:

source: **Delete the old level entirely** : the original mesh file is replaced by a new one with the data of the last mesh generated; a new column for the new mesh is created as the old column retains the old structure but exposes only the new created mesh.
ru: **Полностью удалить старый уровень**: исходный файл сетки заменяется новым с данными последней сгенерированной полисетки; новый столбец для новой полисетки создается, так как старый столбец сохраняет старую структуру, но предоставляет доступ только к новой созданной полисетке.

source: **Keep the old level and overwrite processed frames** : the original mesh file is updated and the old mesh column exposes the new content for the selected frames, a new column is created exposing just the contents of the selected frames.
ru: **Сохранить старый уровень и перезаписать обработанные кадры**: исходный файл полисетки заменяется новым с данными последней сгенерированной полисетки; новый столбец для новой полисетки создается, так как старый столбец сохраняет старую структуру, но предоставляет доступ только к новой созданной полисетки.

source: **Choose a different path** (same name as the original level plus _X where X is the ordinal number of the copy): an entirely new mesh file is generated and a new column exposes the new contents while the old column exposes the old ones.
ru: **Выберите другой путь** (то же имя, что и у исходного уровня плюс _X, где X - порядковый номер копии): создается совершенно новый файл полисетки, и новый столбец представляет новое содержимое, а старый столбец - старые.

source: All the above options cause the creation of a new Mesh column and the building of a chain, linking the *texture-column* and the *meshes columns* in the Stage Schematic. In this chain, the older mesh is linked to the younger and the youngest mesh is linked to the *texture-column*. Rearranging the links in the Stage Schematic can be needed for avoiding undesired results while animating.
ru: Все вышеперечисленные параметры вызывают создание нового столбца политки и построение цепочки, связывая столбцы *texture-column* и *полисеткок* в Stage Schematic. В этой цепочке старая сетка связана с младшей, а самая младшая - с текстурным столбцом. Переупорядочение связей в схеме сцены может быть необходимо для избежания нежелательных результатов при анимации.

source: Modifying a Plastic mesh
ru: Модификация Plastic полисетки

source: It's not always easy to estimate the right density for a mesh. Sometimes a higher density could be needed to avoid *straight lines* on bending elements, or a lower density could be used for saving computing resources in a complex scene, or, simply, the drawings of an element are changed. In all this occurrences, modifying the mesh can solve the problem.
ru: Не всегда легко оценить правильную плотность для полисетки. Иногда может потребоваться более высокая плотность, чтобы избежать «прямых линий» на изгибающихся элементах, или более низкая плотность может использоваться для экономии вычислительных ресурсов в сложной сцене, или, просто, рисунки элемента изменяются. Во всех этих случаях изменение полисетки может решить проблему.

source: **To update a Plastic mesh to reflect changes in the Level Strip:**
ru: **Чтобы обновить Plastic полисетку для отражения изменений в Level Strip:**

source: Select the Mesh column/layer that needs to be modified.
ru: Выберите столбец/слой полисетки, который необходимо изменить.

source: Press the **Create Mesh** button.
ru: Нажмите кнопку **Создать полисетку**.

source: In the dialog that opens change the **Mesh Edges Length** slider value as needed, checking the result in the preview area.
ru: В открывшемся диалоговом окне при необходимости измените значение ползунка **Длина кромки полисетки**, проверив результат в области предварительного просмотра.

source: Click the **Apply** button to create the mesh. The new mesh replaces the old one, and now is visible drawn in *green* colour in the main viewer.
ru: Нажмите кнопку **Применить**, чтобы создать полисетку. Новая полисетка заменяет старую, и теперь она видна нарисованной *зеленым* цветом в главном окне просмотра.

source: **To add new mesh frames to an existing mesh level:**
ru: **Чтобы добавить новые кадры полисетки к существующему уровню полисетки:**

source: Create the new frames (inserting or appending them) as it's usually done for any standard Toonz level, corresponding to the new frames created for the *Texture Column*.
ru: Создайте новые кадры (вставьте или добавьте их), как это обычно делается для любого стандартного уровня Toonz, соответствующего новым кадрам, созданным для *Texture Column*.

source: Activate the **Plastic** tool.
ru: Активируйте инструмент **Plastic**.

source: Press the **Create Mesh** button and adjust the **Mesh Edges Length** slider.
ru: Нажмите кнопку **Создать полисетку** и отрегулируйте ползунок **Длина кромки полисетки**.

source: Press the **Apply** button.
ru: Нажмите кнопку **Применить**.

source: Edit a Plastic mesh
ru: Изменение полисетки

source: The mesh created using the **Create Mesh** button can be edited in several ways. It's possible to: Move a mesh point, Swap, Collapse, Split and Cut the mesh by its edges.
ru: Полисетка, созданная с помощью кнопки **Создать полисетку**, может быть отредактирована несколькими способами. Можно переместить точку полисетки, поменять местами, свернуть, разделить и обрезать полисетку по ее краям.

source: **Swap** an edge if you want to change the shape of a mesh triangle; **Collapse** an edge if you want to join the ends of the edge; **Split** an edge if you want to increase the density of the mesh at any given point; **Cut** the mesh if you want to duplicate an edge to have the possibility, for example, to create a hole in the mesh and be able to animate it.
ru: **Переставить** ребро, если вы хотите изменить форму треугольника сетки; **Убрать** ребро, если вы хотите соединить концы ребра; **Разделить** ребро, если вы хотите увеличить плотность полисетки в любой заданной точке; **Резать** полисетку, если вы хотите дублировать ребро, чтобы иметь возможность, например, создать отверстие в полисетке и иметь возможность его анимировать.

source: The **Cut Mesh** command is visible only if the selected edges can be cut.
ru: Команда **Резать полисетку** видна, только если выбранные ребра могут быть обрезаны.

source: **To enter Plastic mesh editing mode:**
ru: **Чтобы войти в режим редактирования Plastic полисетки:**

source: Select the mesh column/layer you want to modify.
ru: Выберите столбец/слой полисетки, который вы хотите изменить.

source: If not already active, choose the **Plastic** tool (|plastic|)
ru: Если инструмент еще не активен, выберите инструмент **Plastic tool** (|plastic|)

source: In the Tool Options bar set the **Mode:** to **Edit Mesh**.
ru: На панели параметров инструмента установите для **Режима:** значение **Редактировать полисетку**.

source: **To move selected mesh points:**
ru: **Чтобы переместить выбранные точки полисетки:**

source: Select the mesh points you want to modify. Use the **Ctrl** key to select multiple points. Selected mesh points become *red*.
ru: Выберите точки полисетки, которые вы хотите изменить. Используйте клавишу **Ctrl**, чтобы выбрать несколько точек. Выбранные точки сетки становятся *красными*.

source: Drag to move the point to its new position.
ru: Перетащите, чтобы переместить точку в новое положение.

source: **To swap an edge of the mesh:**
ru: **Чтобы поменять ребро полисетки:**

source: Select a mesh edge.
ru: Выберите ребро полисетки.

source: Click the right mouse button to open the context menu.
ru: Щелкните правой кнопкой мыши, чтобы открыть контекстное меню.

source: Choose the **Swap Edge** command.
ru: Выберите команду **Переставить ребро**.

source: **To collapse an edge of the mesh:**
ru: **Чтобы убрать ребро полисетки:**

source: Choose the **Collapse Edge** command.
ru: Выберите команду **Убрать ребро**.

source: **To split an edge of the mesh:**
ru: **Чтобы разделить ребро полисетки:**

source: Choose the **Split Edge** command.
ru: Выберите команду **Разделить ребро**.

source: **To cut edges of the mesh:**
ru: **Чтобы разрезать ребро полисетки:**

source: Select several mesh edges.
ru: Выберите несколько ребер полисетки.

source: Choose the **Cut Mesh** command.
ru: Выберите команду **Резать полисетку**.

source: Building a Plastic skeleton
ru: Построение скелета

source: The Plastic skeleton is a control structure linked to a mesh level that provides handles for deforming/animating the chosen elements of the Xsheet/Timeline.
ru: Скелет Plastic - это управляющая структура, связанная с уровнем полисетки, которая обеспечивает указатели для деформации/анимации выбранных элементов Xsheet/Timeline.

source: **To create a Plastic skeleton:**
ru: **Чтобы создать Plastic скелет:**

source: Select in the mesh column/layer for which you want to build the skeleton.
ru: Выберите в столбце полисетки слой, для которого вы хотите построить скелет.

source: In the Tool Options bar set the **Mode:** to **Build Skeleton**.
ru: На панели параметров инструмента установите для **Режима:** значение **Создать скелет**.

source: Move the mouse pointer on the Viewer. A small red square is now visible near the tip of the cursor.
ru: Переместите курсор мыши на окно просмотра. Маленький красный квадрат теперь виден около кончика курсора.

source: In the Viewer click (to set in place) or click and drag (to adjust its positioning) to place the first vertex. A *purple* square is now visible in the Viewer.
ru: В окне просмотра щелкните (чтобы установить на место) или щелкните и перетащите (чтобы настроить его положение), чтобы разместить первую вершину. *Фиолетовый* квадрат теперь виден в окне просмотра.

source: The first time you release the mouse button, you are setting the position of the parent of all the hierarchy, *the Root vertex*. This vertex differs visually from the others vertices: its square is solid while the others are hollow in the middle, giving a visual hint for determining the right hierarchical order in the skeleton chains. The **Root vertex** will be *static* in **Animate** mode, but it can still be moved while in **Build Skeleton** mode by selecting it and dragging.
ru: При первом отпускании кнопки мыши вы устанавливаете положение родителя всей иерархии, *корневой вершины*. Эта вершина визуально отличается от других вершин: ее квадрат сплошной, а остальные полые посередине, что дает визуальный намек для определения правильного иерархического порядка в цепях скелета. **Корневая вершина** будет *статической* в режиме **Анимировать**, но ее все равно можно будет перемещать в режиме **Создать скелет**, выбрав ее и перетащив.

source: Move to the position where you want to add the second vertex and click or click and drag to place it. An *orange* line with a black border will connect the two vertices.
ru: Переместите в положение, в которое вы хотите добавить вторую вершину, и щелкните или щелкните и перетащите, чтобы разместить ее. *Оранжевая* линия с черной рамкой соединит две вершины.

source: Continue clicking or clicking and dragging until all the vertices are in the right places and the skeleton is completed.
ru: Продолжайте нажимать или перетаскивать, пока все вершины не окажутся в нужных местах и ​​скелет не будет завершен.

source: Using multiple skeletons on a mesh level
ru: Использование нескольких скелетов на уровне полисетки

source: Every mesh level uses at least one skeleton for animating, but this is just the easier configuration for working: a mesh level can have multiple skeletons active at different frames for building more complex animations: like a character turn-around, or for animating a level with multiple drawings of different shapes. Every time the drawings change in shape, a new *ad-hoc* skeleton structure can be built with the number of vertices needed and placed in the right positions.
ru: Каждый уровень полисетки использует по крайней мере один скелет для анимации, но это просто более простая конфигурация для работы: уровень сетки может иметь несколько активных скелетов в разных кадрах для создания более сложной анимации: например, разворот персонажа или для анимации уровня с несколькими рисунками разных форм. Каждый раз, когда рисунки меняют форму, можно создать новую *специальную для этого случая* структуру скелета с количеством необходимых вершин и расположить их в правильных положениях.

source: **To add a new skeleton on a mesh level**
ru: **Чтобы добавить новый скелет на уровень полисетки**

source: In the Xsheet/Timeline select the Mesh level and the frame where the new skeleton is needed.
ru: В Xsheet/Timeline выберите уровень полисетки и кадр, где нужен новый скелет.

source: In the Tool Options bar press the **+** button to the right of the options menu labeled **Skeleton:**. A new numeric entry is added to the list and a keyframe is created at the selected frame.
ru: На панели параметров инструмента нажмите кнопку **+** справа от меню параметров, помеченного **Скелет:**. Новая числовая запись добавляется в список, и ключевой кадр создается в выбранном кадре.

source: Start building the new skeleton as usual.
ru: Начните строить новый скелет как обычно.

source: **To link an available skeleton to a chosen frame of a mesh level**
ru: **Чтобы связать доступный скелет с выбранным кадром уровня полисетки**

source: In the Xsheet/Timeline select the frame of the Mesh level where the skeleton has to change.
ru: В Xsheet/Timeline выберите кадр уровня полисетки, где скелет должен измениться.

source: In the Tool Options bar open the option menu labeled **Skeleton:**, a list of the ID numbers of the already built skeletons opens.
ru: На панели параметров инструмента откройте меню параметров с надписью **Скелет:**, откроется список идентификационных номеров уже созданных скелетов.
