Repository: Savraska2/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/create_animations_using_plastic_tool.po
Languages: ru

source: Do the same procedure of point 5 on the small square on the right of the Plastic modified node that was used as target for the link. Select **the number of the skeleton vertex** that has to be used as target reference point for the link. Into the Viewer the standard level moves to overlap the position of the hook point selected as reference to the position of the skeleton vertex selected on the Plastic modified level.
ru: Проделайте ту же процедуру, что и в пункте 5, на небольшом квадрате справа от модифицированного Plastic узла, который использовался в качестве цели для ссылки. Выберите **номер вершины скелета**, который должен использоваться в качестве целевой контрольной точки для ссылки. В окне просмотра стандартный уровень перемещается так, чтобы перекрывать положение точки крючка, выбранной в качестве ссылки на положение вершины скелета, выбранного на уровне, измененном Plastic tool.

source: A mirror procedure can be used for linking a Plastic modified level to a standard level.
ru: Зеркальная процедура может использоваться для привязки уровня, модифицированного Plastic, к стандартному уровню.

source: **To link Plastic modified levels**
ru: **Чтобы связать модифицированные Plastic уровни**

source: The procedure requires that all the levels involved and that need to be linked using determined positions, have at least one skeleton built and one of its vertices has to be positioned at the desired spot for the linking. As said, the Hook tool doesn’t work on the Plastic modified levels so, for exact positioning, skeleton vertices are needed as reference points both on the source and on the target of the link.
ru: Процедура требует, чтобы все задействованные уровни и которые должны были быть связаны с использованием определенных позиций, имели по крайней мере один скелет и одну из его вершин нужно расположить в желаемом месте для связи. Как уже говорилось, инструмент Крюк не работает на уровнях, измененных в Plastic, поэтому для точного позиционирования вершины скелета необходимы в качестве опорных точек как на источнике, так и на цели ссылки.

source: Go to the Stage Schematic and select the node of the column/layer that has to be linked. Click on the small square on its left side, and drag to one of the small squares on the right side of the target of the link. Now the two levels are linked but the reference points for the link are probably wrong (by default the column/layer centers are used).
ru: Перейдите к Stage Schematic и выберите узел столбца/слоя, который должен быть связан. Нажмите на маленький квадрат с левой стороны и перетащите на один из маленьких квадратов с правой стороны от цели ссылки. Теперь эти два уровня связаны, но контрольные точки для ссылки, вероятно, неверны (по умолчанию используются центры столбцов/слоев).

source: Hover on the small square on the left of the node of the first node until two small arrows appear.
ru: Наведите указатель мыши на маленький квадрат слева от узла первого узла, пока не появятся две маленькие стрелки.

source: Click on the arrows and drag to change the value in the small square. Stop when **the number of the skeleton vertex** point that has to be used as pivot point is reached. In the Viewer the level adjusts its position in respect of the new selected center.
ru: Нажмите на стрелки и перетащите, чтобы изменить значение в маленьком квадрате. Остановитесь, когда **номер точки вершины скелета**, которая должна использоваться в качестве точки разворота, достигнута. В окне просмотра уровень регулирует свою позицию относительно нового выбранного центра.

source: Do the same procedure of point 3 on the small square on the right of the Plastic modified node that was used as target for the link. Select **the number of the skeleton vertex** that has to be used as target reference point for the link. Into the Viewer the first level moves to overlap the position of its selected skeleton vertex to that of the target skeleton vertex just selected.
ru: Выполните ту же процедуру, что и в пункте 3, на небольшом квадрате справа от модифицированного Plastic узла, который использовался в качестве цели для ссылки. Выберите **номер вершины скелета**, который должен использоваться в качестве целевой контрольной точки для ссылки. В окне просмотра перемещается первый уровень, чтобы перекрыть положение выбранной вершины скелета с позицией выбранной вершины скелета цели.

source: Function Editor representation of Plastic data
ru: Представление данных Plastic в редакторе функций

source: While animating Plastic elements, keyframes are created for the vertices of the skeleton. You can see them as standard keyframes in the Xsheet/Timeline, or you can operate on the values of each vertex into the Function Editor.
ru: При анимации элементов Plastic ключевые кадры создаются для вершин скелета. Вы можете видеть их как стандартные ключевые кадры в Xsheet/Timeline или работать со значениями каждой вершины в Редакторе функций.

source: The keyframess of the Xsheet/Timeline mark a keyframe for the Plastic skeleton at the specified frame, but don’t give any information about the number of vertices involved or their actual keyframed properties; they can be indifferently, one, some or all. Moving these keyframes you can easily change the timing of the whole animation.
ru: Ключевые кадры Xsheet/Timeline помечают ключевые кадры для скелета Plastic в указанном кадре, но не дают никакой информации о количестве задействованных вершин или их фактических свойствах ключевых кадров; они могут быть непосредственны, один, несколько или все. Перемещая эти ключевые кадры, вы можете легко изменить время анимации.

source: The keyframes into the Function Editor are more detailed, giving you the chance for fine-tuning and modify each vertex parameter animation.
ru: Ключевые кадры в редакторе функций более подробны, что дает вам возможность для тонкой настройки и изменения анимации каждого параметра вершины.

source: When in the Function Editor Tree, you open the folder of a column/layer that has the Plastic tool applied, you can see a **Plastic Skeleton** folder. This folder contains the **Skeleton Id** channel, the **Root** subfolder, and one subfolder *for each vertex* of the Plastic skeleton, labeled with the name of the related vertex.
ru: Когда в дереве редактора функций вы открываете папку столбца/слоя, к которой применен инструмент Plastic, вы видите папку **Plastic Skeleton**. Эта папка содержит канал **Skeleton Id**, подпапку **Root** и одну подпапку *для каждой вершины* Plastic скелета, помеченную названием соответствующей вершины.

source: The **Skeleton Id** channel contains the data related to which skeleton is active at a certain frame. If the level is using multiple skeletons here you can see the switches from one skeleton to the other, both as numeric values and in a graphical format.
ru: Канал **Skeleton Id** содержит данные, связанные с тем, какой скелет активен в определенном кадре. Если уровень использует несколько скелетов, вы можете увидеть переключение с одного скелета на другой, как в виде числовых значений, так и в графическом формате.

source: The **Root** subfolder shows all the parameter channels, but only the **SO** (Staking Order) parameter can be animated when this vertex is actually used as root of the skeleton
ru: В подпапке **Root** отображаются все каналы параметров, но только параметр **Порядок** (порядок размещения) можно анимировать, когда эта вершина фактически используется в качестве корня скелета

source: The **Vertex** subfolders (one for each vertex of the skeletons), contain three parameters: **Angle**, **Distance** and **SO**, that are used to determine the position of the vertex at every frame during the animation.
ru: Подпапки **Vertex** (по одной на каждую вершину каркаса) содержат три параметра: **Angle**, **Distance** и **SO**, которые используются для определения положения вершины в каждый кадр во время анимации.

source: The values of these parameters can be visualized in the Function Editor as a spreadsheet or as curves, and modified as required.
ru: Значения этих параметров можно визуализировать в редакторе функций в виде электронной таблицы или в виде кривых и при необходимости изменять.

source: The vertices of multiple skeletons are shown as a single list, and *not grouped* for each skeleton. In this way the animation curve of *Vertex_1* is built using the animation values of the vertices named *Vertex_1* of all the skeletons of the mesh, so just one curve can be modified to adjust the animation of related vertices on different skeletons.
ru: Вершины нескольких скелетов отображаются в виде единого списка и *не группируются* для каждого скелета. Таким образом, кривая анимации *Vertex_1* строится с использованием значений анимации вершин с именем *Vertex_1* всех скелетов полисетки, поэтому можно изменить только одну кривую, чтобы настроить анимацию связанных вершин на разных скелетах.

source: Use Mathematical Expressions in Plastic Animation
ru: Используйте математические выражения в анимации Plastic

source: To use OpenToonz mathematical expressions in the Plastic Animation, you can link the vertices of the skeleton to each other or to a column/layer, pegbar or camera.
ru: Чтобы использовать математические выражения OpenToonz в Plastic анимации, вы можете связать вершины скелета друг с другом или со столбцом/слоем, штифтами или камерой.

source: This allows to set some automatic actions of the skeleton, for example you can link the main vertices of the shoulders, so that moving just one shoulder automatically moves the other.
ru: Это позволяет настроить некоторые автоматические действия скелета, например, вы можете связать основные вершины плеч, так что перемещение только одного плеча автоматически перемещает другое.

source: Suppose that the main vertices of the shoulders are named *Shoulder_left* and *Shoulder_right*, and the Mesh is in column 2 of the Xsheet (or layer 2 of the Timeline). You can set the rotation of *Shoulder_left* vertex to be the same amount of that of *Shoulder_right*, by setting in the Function Editor the following expression in the **Angle** parameter of *Shoulder_left*:
ru: Предположим, что главные вершины плеч названы *Левое_плечо* и *Правое_плечо*, а полисетка находится в столбце 2 Xsheet (или в слое 2 Timeline). Вы можете установить вращение вершины *Левое_плечо* равным вращению вершины *Правое_плечо*, установив в редакторе функций следующее выражение в параметре **Angle** *Левое_плечо*:

source: ``vertex(2, "Shoulder_right").angle``
ru: ``vertex(2, "Правое_плечо").angle``

source: If you prefer the rotation of the left shoulder to react opposite to the one of the right shoulder, you could add a multiplication as following:
ru: Если вы предпочитаете, чтобы вращение левого плеча реагировало против вращения правого плеча, вы можете добавить умножение следующим образом:

source: ``vertex(2, "Shoulder_right").angle*-1``
ru: ``vertex(2, "Правое_плечо").angle*-1``

source: The general syntax is:
ru: Общий синтаксис таков:

source: For more information about the *mathematical expressions* usage refer to (See :ref:`Using Interpolations Based on Expressions <using_interpolations_based_on_expressions>` ).
ru: Для получения дополнительной информации об использовании *математических выражений* см. :ref:`Использование интерполяций на основе выражений <using_interpolations_based_on_expressions>`).

source: Plastic and Sub-Xsheets
ru: Plastic и Sub-Xsheets

source: A Sub-Xsheet is a valid object for the Plastic tool, and all or some of its columns can have a mesh for animating. When a Sub-Xsheet is selected as a starting element, all of the columns in the Sub-Xsheet visible when the **Create Mesh** button is pressed, are taken into count for the creation of the Mesh. These levels will be visible in render and will be deformed by Mesh transformations. If, after creating the Mesh, hidden levels are set to visible, they will behave in a slightly different way: they will be deformed by Mesh transformations, but they will be shown in render *only inside the mesh boundaries* (i.e. the Mesh acts as a *mask* that determines what is visible in the rendered image, even if the newly-shown levels are placed into a nested Sub-Xsheet with its own mesh and skeleton).
ru: Sub-Xsheet является допустимым объектом для инструмента Plastic, и все или некоторые из его столбцов могут иметь сетку для анимации. Если в качестве начального элемента выбран Sub-Xsheet, все столбцы вспомогательного листа, видимые при нажатии кнопки **Создать полисетку**, учитываются при создании полисетки. Эти уровни будут видны при рендере и будут деформированы преобразованиями полисетки. Если после создания полисетки скрытые уровни становятся видимыми, они будут вести себя немного по-другому: они будут деформированы преобразованиями полисетки, но они будут отображаться при рендере *только внутри границ полисетки* (то есть действия сетки) как *маска*, которая определяет то, что видно на визуализированном изображении, даже если вновь показанные уровни помещаются во вложенный Sub-Xsheet с собственной полисеткой и скелетом).
