Repository: Savraska2/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/creating_movements.po
Languages: ru

source: **Position**, **N/S:** and **E/W:** set the vertical and horizontal positions of the selected object, position **Z:** sets its position along the Z axis (see :ref:`Working in a 3D Environment <working_in_a_3d_environment>` ), and **SO:** sets the column/layer stacking order, that can be different from the one defined in the Xsheet/Timeline (see :ref:`Changing Columns Stacking Order <changing_columns_stacking_order>` ).
ru: **Положение**, **N/S:** и **E/W:** устанавливает вертикальное и горизонтальное положения выбранного объекта, положение **Z:** устанавливает его положение вдоль оси Z ( см. :ref:`Работа в 3D-среде <working_in_a_3d_environment>`), а **Порядок:** устанавливает порядок расположения столбцов/слоев, который может отличаться от того, который определен в Xsheet/Timeline (см. :ref:`Изменение порядка расположения столбцов <changing_columns_stacking_order>`).

source: **Rotation:**, sets the rotation of the selected object.
ru: **Вращение:**, устанавливает поворот выбранного объекта.

source: **Scale**, **Global:**, **H:** and **V:** set the global, horizontal and vertical scaling of the selected object. **Maintain:** sets a constraint for scaling operations performed by using the Animate tool handle: if it is set to **A/R** the object will maintain its proportions, if it is set to **Mass** the object will maintain its overall volume.
ru: **Масштаб**, **Глобальный:**, **H:** и **V:** устанавливают глобальное, горизонтальное и вертикальное масштабирование выбранного объекта. **Поддерживать:** устанавливает ограничение для операций масштабирования, выполняемых с помощью ручки инструмента Анимирования: если он установлен на **A/R**, объект будет сохранять свои пропорции, если он установлен на **Масса** объект будет поддерживать свой общий объем.

source: **Shear**, **H:** and **V:** set the horizontal and vertical shearing of the selected object.
ru: **Скос**, **H:** и **V:** устанавливают горизонтальный и вертикальный сдвиг выбранного объекта.

source: **Center**, **N/S:** and **E/W:** set the vertical and horizontal position of the center of the selected object. The Center of an object cannot be animated.
ru: **Центр**, **N/S:** и **E/W:** устанавливают вертикальное и горизонтальное положение центра выбранного объекта. Центр объекта не может быть анимирован.

source: **All** displays all transformation types at the same time. In the viewer a handle will also be available that let users visually change any of the transformation types: Position, Rotation, Scale, Shear and Center.
ru: **Все** отображает все типы преобразования одновременно. В окне просмотра также будет доступен дескриптор, который позволяет пользователям визуально изменять любой из типов преобразования: Положение, Вращение, Масштаб, Скос и Центр.

source: **Pick:** (only available in All mode) lets the user choose to automatically select columns/layers or pegbars to be animated when the selection is done by clicking in the Viewer: when set to **Column**, clicking a drawing automatically selects the related column/layer; when set to **Pegbar**, clicking a drawing automatically selects the pegbar to which the column/layer containing the drawing is linked (if there is one); when set to **None** the selection of drawings in the Viewer is disabled.
ru: **Выбрать:** (доступно только в режиме Все) позволяет пользователю выбрать автоматический выбор столбцов/слоев или штифтов для анимации, когда выбор сделан, щелкнув в окне просмотра: при установке на **Столбец**, нажав рисунок автоматически выбирает связанный столбец/слой; если установлено значение **Pegbar**, щелчок по рисунку автоматически выбирает pegbar, с которым связан столбец/слой, содержащий рисунок (если он есть); при значении **Нет** выбор рисунков в окне просмотра отключен.

source: **Lock buttons** (|lock|) define which values remain locked while transforming the object.
ru: **Кнопки блокировки** (|lock|) определяют, какие значения остаются заблокированными при трансформации объекта.

source: **Global Key** when activated, sets a key for all of the object transformations as soon as a key is set for any of its transformations interactively in the viewer. For example if you change the position of an object, thus defining a keyframe for it, keys will also be automatically defined for the rotation, scaling and shearing transformations as well. This option will not take any effect if the values for the property are input directly in the toolbar, and not interactively.
ru: **Глобальный ключ**, когда активирован, устанавливает ключ для всех преобразований объекта, как только ключ устанавливается для любого из его преобразований в интерактивном режиме в окне просмотра. Например, если вы измените положение объекта, определив для него ключевой кадр, ключи также будут автоматически определены для преобразований вращения, масштабирования и сдвига. Эта опция не будет иметь никакого эффекта, если значения для свойства вводятся непосредственно на панели инструментов, а не в интерактивном режиме.

source: If the tool options bar is too short to display all the tool options, it can be scrolled by using arrow buttons available at its ends.
ru: Если панель параметров инструмента слишком короткая для отображения всех параметров инструмента, ее можно прокручивать с помощью кнопок со стрелками, имеющихся на ее концах.

source: Position values are expressed in the default unit of measure set in the Preferences → Interface dialog (see :ref:`Choosing the Working Unit <choosing_the_working_unit>` ).
ru: Значения позиций выражаются в единице измерения по умолчанию, установленной в диалоговом окне Настройки программы → Интерфейс (см. :ref:`Выбор рабочего блока <choosing_the_working_unit>`).

source: Animate Tool Handle
ru: Указатель инструмента анимирования

source: When the Animation tool is in **All** mode, you can also interactively control transformation values by using the handle available in the viewer. The handle is made of an inner double circle with three arms that allow you to change any of the following transformations:
ru: Когда инструмент Анимирование находится в режиме **Все**, вы также можете интерактивно управлять значениями преобразования, используя указатель, доступный в окне просмотра. Указатель выполнен из двойного круга с тремя ручками, которые позволяют изменить любое из следующих преобразований:

source: As you roll over the handles, the cursor changes shape to indicate to you the operations you may perform.
ru: При наведении курсора на указатель курсор меняет форму, указывая на те операции, которые вы можете выполнить.

source: For greater precision it is possible to keep the **Alt** key depressed before starting to perform any transformation.
ru: Для большей точности можно удерживать нажатой клавишу **Alt** перед началом любого преобразования.

source: **Position:** Click and drag anywhere to move the object; if the **Shift** key is pressed while dragging, the movement will be constrained in the horizontal or vertical direction.
ru: **Положение:** Нажмите и перетащите в любое место, чтобы переместить объект; если во время перетаскивания нажать клавишу **Shift**, движение будет ограничено в горизонтальном или вертикальном направлении.

source: **Rotate:** Click and drag the circle end to rotate the object;
ru: **Поворот:** Нажмите и перетащите конец круга, чтобы повернуть объект;

source: **Scale:** Click and drag the outer square of the double-square end to scale the object uniformly on the vertical and horizontal; click and drag the inner square of the double-square end to scale the object according to the constraint set in the options bar; if no constraint is set and the **Shift** key is pressed while dragging, the scaling will be uniform.
ru: **Масштаб:** Нажмите и перетащите внешний квадрат конца двойного квадрата, чтобы равномерно масштабировать объект по вертикали и горизонтали; щелкните и перетащите внутренний квадрат конца двойного квадрата, чтобы масштабировать объект в соответствии с ограничением, установленным на панели параметров; если ограничение не установлено и при перетаскивании нажата клавиша **Shift**, масштабирование будет равномерным.

source: **Shear:** Click and drag the parallelogram end to shear the object; if the **Shift** key is pressed while dragging, the shearing will be constrained in the horizontal or vertical direction.
ru: **Скос:** Нажмите и перетащите конец параллелограмма, чтобы наклонить объект; если во время перетаскивания нажать клавишу **Shift**, сдвиг будет ограничен в горизонтальном или вертикальном направлении.

source: **Center:** Click and drag the double circle at the center to change the center of the object.
ru: **Центр:** Нажмите и перетащите двойной круг в центре, чтобы изменить центр объекта.

source: The object center can be moved, but cannot be animated. Once it is set, or modified, it is retained in that position during all of the animation. If the Center is changed many times, and you want to set it back to its original position, right-click the object in the Stage Schematic and choose **Reset Center** from the menu that opens.
ru: Центр объекта может быть перемещен, но не может быть анимирован. Как только он установлен или изменен, он сохраняется в этой позиции в течение всей анимации. Если центр много раз менялся, и вы хотите вернуть его в исходное положение, щелкните правой кнопкой мыши объект в схеме сцены и выберите **Сброс центра** в открывшемся меню.

source: When entering a value or operating the handle, a keyframe will be automatically generated at the current frame only for the set transformation; if the **Global Key** option is activated, keys will be generated for all of the transformations.
ru: При вводе значения или работе с указателем ключевой кадр будет автоматически генерироваться в текущем кадре только для заданного преобразования; если опция **Глобальный ключ** активирована, ключи будут сгенерированы для всех преобразований.

source: If you want to set a key for an object transformation, maintaining its value as it is at the current frame, you can just press **Enter** on the displayed value. If you want to set keys for all of the object transformations maintaining their values as they are at the current frame, you can use the **Set Key** button (|key|) available in the bottom bar of the viewer; in this case keys are created for all of the object transformations, regardless of the **Global Key** option.
ru: Если вы хотите установить ключ для преобразования объекта, сохраняя его значение таким, как оно есть в текущем кадре, вы можете просто нажать **Enter** на отображаемом значении. Если вы хотите установить ключи для всех преобразований объектов, сохраняя их значения такими, как они есть в текущем кадре, вы можете использовать кнопку **Установить ключ** (|key|), доступную в нижней панели средства просмотра; в этом случае ключи создаются для всех преобразований объекта, независимо от параметра **Глобальный ключ**.

source: Objects can also be animated by working in the Function Editor (see :ref:`Editing Curves and Numerical Columns <editing_curves_and_numerical_columns>` ).
ru: Объекты также можно анимировать, работая в Редакторе функций (см. :ref:`Редактирование кривых и числовых столбцов <editing_curves_and_numeric_columns>`).

source: The movement of the column contents can be checked by activating the Onion Skin mode, as it will display the position of drawings contained in the current column at different frames (see :ref:`Using Onion Skin <using_onion_skin>` ).
ru: Движение содержимого столбца можно проверить, активировав режим Кальки, поскольку он будет отображать положение рисунков, содержащихся в текущем столбце, в разных кадрах (см. :ref:`Использование кальки <using_onion_skin>` ).

source: **To select the object to edit:**
ru: **Чтобы выбрать объект для редактирования:**

source: Select it in the stage schematic.
ru: Выберите его в Stage Schematic.

source: If the object is a column/layer, select it in the Xsheet/Timeline.
ru: Если объект является столбцом/слоем, выберите его на Xsheet/Timeline.

source: Use the **Animate** tool (|animate|) with the **Pick:** option set to **Column** to click a drawing in the viewer to select the related column.
ru: Используйте инструмент **Анимирования** (|animate|) с параметром **Выбрать:**, установленным на **Столбец**, чтобы щелкнуть рисунок в окне просмотра, чтобы выбрать связанный столбец.

source: Use the **Animate** tool (|animate|) with the **Pick:** option set to **Pegbar** to click a drawing in the viewer to select the pegbar that the column containing the drawing is linked to.
ru: Используйте инструмент **Анимирования** (|animate|) с параметром **Выбрать:**, установленным на **Pegbar**, чтобы щелкнуть рисунок в окне просмотра, чтобы выбрать Pegbar, с которым связан столбец, содержащий рисунок.

source: Right-click in the Viewer a drawing to select an object from the list of scene objects.
ru: Щелкните правой кнопкой мыши в окне просмотра рисунок, чтобы выбрать объект из списка объектов сцены.

source: **To animate an object with the Animate tool:**
ru: **Для анимации объекта с помощью инструмента Анимирования:**

source: Select the object you want to animate.
ru: Выберите объект, который вы хотите анимировать.

source: Choose the **Animate** tool (|animate|).
ru: Выберите инструмент **Анимирования** (|animate|).

source: Set the frame where you want to define the key by doing one of the following:
ru: Установите кадр, в котором вы хотите определить ключ, выполнив одно из следующих действий:

source: Move the current frame cursor in the Xsheet/Timeline or in the Function Editor.
ru: Переместите курсор текущего кадра в Xsheet/Timeline или в Редакторе функций.

source: Use the Frame bar or the Playback buttons in the bottom bar of the viewer.
ru: Используйте панель кадров или кнопки воспроизведения в нижней панели окна просмотра.

source: When animating columns only, select the related cell in the column/layer.
ru: При анимации только столбцов выберите соответствующую ячейку в столбце/слое.

source: Define a keyframe.
ru: Определите ключевой кадр.

source: Select a different frame, and go on defining keyframes.
ru: Выберите другой кадр и продолжайте определять ключевые кадры.

source: **To define a keyframe only for some object transformations:**
ru: **Чтобы определить ключевой кадр только для некоторых преобразований объекта:**

source: Deactivate the **Global Key** option in the tool options bar.
ru: Отключите параметр **Глобальный ключ** на панели параметров инструмента.

source: Enter values in the **Animate** tool options bar for the object transformations you want to set a key for.
ru: Введите значения на панели параметров инструмента **Анимирования** для преобразований объектов, для которых вы хотите задать ключ.

source: If in **All** mode, operate the handle to move, scale, rotate or shear the object, automatically generating a key only for the modified transformation.
ru: Если в режиме **Все**, используйте указатель для перемещения, масштабирования, вращения или сдвига объекта, автоматически генерируя ключ только для измененного преобразования.

source: As this keyframe is partial and refers only to some transformations, the **Set Key** button turns striped-blue.
ru: Поскольку этот ключевой кадр является частичным и относится только к некоторым преобразованиям, кнопка **Установить ключ** становится полосатой синей.

source: **To define a keyframe for all the object transformations:**
ru: **Чтобы определить ключевой кадр для всех преобразований объекта:**

source: Activate the **Global Key** option in the tool options bar.
ru: Активируйте параметр **Глобальный ключ** на панели параметров инструмента.

source: Interactively move, rotate, scale or shear the object in the viewer.
ru: Интерактивно перемещайте, вращайте, масштабируйте или сдвигайте объект в окне просмотра.

source: As this keyframe is global and refers to all the transformations, the **Set Key** button turns blue.
ru: Поскольку этот ключевой кадр является глобальным и относится ко всем преобразованиям, кнопка **Установить ключ** становится синей.

source: **To define a key for an object transformation leaving its value as it is at the current frame:**
ru: **Чтобы определить ключ для преобразования объекта, оставив его значение в текущем кадре:**

source: In the **Animate** tool options bar click in the field of the object transformations you want to set a key for, and press the **Enter** key.
ru: На панели параметров инструмента **Анимирования** щелкните поле преобразования объекта, для которого вы хотите установить ключ, и нажмите кнопку **Enter**.

source: **To define keys for all of the object transformations leaving their values as they are at the current frame:**
ru: **Чтобы определить ключи для всех преобразований объекта, оставив их значения такими, какие они есть в текущем кадре:**

source: Click the **Set Key** button (|key|).
ru: Нажмите кнопку **Установить ключ** (|key|).

source: When animating columns/layers only, right-click in the column/layer cell and choose **Set Key** from the menu that opens.
ru: При анимации только столбцов/слоев щелкните правой кнопкой мыши ячейку столбца/слоя и выберите **Установить ключ** в открывшемся меню.

source: **To turn a partial keyframe to a global key:**
ru: **Чтобы превратить частичный ключевой кадр в глобальный ключ:**

source: Click the **Set Key** button (|key|): it turns from blue-striped to blue.
ru: Нажмите кнопку **Установить ключ** (|key|): она превращается из синей в полоску в синюю.

source: **To remove a set keyframe from the viewer bottom bar:**
ru: **Чтобы удалить установленный ключевой кадр из нижней панели окна просмотра:**

source: If the keyframe is global, click the **Set Key** button (|key|): it turns from blue to grey.
ru: Если ключевой кадр является глобальным, нажмите кнопку **Установить ключ** (|key|): он станет из синего серым.

source: If the keyframe is partial, click twice the **Set Key** button (|key|): with the first click it turns from striped-blue to blue, with the second from blue to grey.
ru: Если ключевой кадр является частичным, дважды нажмите кнопку **Установить ключ** (|key|): при первом щелчке он превращается из полосатого синего в синий, а во втором из синего в серый.

source: **To navigate frames where keyframes are defined in the viewer bottom bar:**
ru: **Для навигации по кадрам, в которых ключевые кадры определены в нижней панели окна просмотра:**

source: Use the **Previous Key** (|prevkey|) and **Next Key** (|next_key|) buttons available at the side of the Set Key button.
ru: Используйте кнопки **Предыдущий ключ** (|prevkey|) и **Следующий ключ** (|next_key|), доступные сбоку от кнопки Установить ключ.

source: Keys can also be removed or navigated by working in the Function Editor (see :ref:`Editing Curves and Numerical Columns <editing_curves_and_numerical_columns>` ).
ru: Ключи также можно удалять или перемещать, работая в Редакторе функций (см. :ref:`Редактирование кривых и числовых столбцов <editing_curves_and_numerical_columns>`).

source: **To customize the Animate tool options bar:**
ru: **Чтобы настроить панель параметров инструмента Анимирования:**

source: Use the **Tool Mode:** dropdown menu to choose from one of its modes: Position, Rotate, Scale, Shear, Center or All: only the options for the selected transformation category will be displayed.
ru: Используйте раскрывающееся меню **Режим инструмента:**, чтобы выбрать один из его режимов: Положение, Вращение, Масштаб, Скос, Центр или Все: будут отображаться только параметры для выбранной категории преобразования.

source: Use the **Lock** button (|lock|) to choose which transformations have to be locked while transforming the object: only selected items will be locked.
ru: Используйте **кнопку блокировки** (|lock|), чтобы выбрать, какие преобразования должны быть заблокированы при преобразовании объекта: блокируются только выбранные элементы.

source: Changing Stacking Order of Columns/Layers
ru: Изменение порядка расположения столбцов/слоев

source: The column/layer stacking order, which sets which drawings and images are placed on top or behind, other images, by default depends on how columns/layers are placed in the Xsheet/Timeline: Xsheet direction is from left to right, while Timeline direction is from bottom to top, making what's on the left/bottom to be behind of what's on the right/top.
ru: Порядок расположения столбцов/слоев, который определяет, какие рисунки и изображения размещаются сверху или сзади, другие изображения, по умолчанию зависит от того, как столбцы/слои размещены на Xsheet/Timeline: направление Xsheet слева направо, а направление Timeline находится снизу вверх, делая то, что слева/снизу, позади того, что справа/сверху.

source: This would mean that if an animation element has to move behind another animation element and then in front of it, it'd have to be exposed in two different columns, one before and one after the column containing the second animation element.
ru: Это будет означать, что если элемент анимации должен перемещаться за другим элементом анимации, а затем перед ним, он должен быть представлен в двух разных столбцах, один до и один после столбца, содержащего второй элемент анимации.

source: By editing the **SO** (i.e. stacking order) value it's possible to change and animate the element compositing order without editing the columns/layers position in the Xsheet/Timeline.
ru: Путем редактирования значения **Порядка** (то есть порядка наложения) можно изменить и анимировать порядок наложения элементов без изменения положения столбцов/слоев на Xsheet/Timeline.

source: The **SO** default value for all the columns is 0, meaning that the Xsheet column (or Timeline layer) order is what's taken into account when there are no modifications to the SO position. As soon as a column/layer has a higher SO value, it will be placed on top, regardless of the position of the column/layer in the Xsheet/Timeline; conversely if the SO value is lower it will be placed behind.
ru: Значение по умолчанию **Порядка** для всех столбцов равно 0, что означает, что порядок столбцов Xsheet (или слоя Timeline) учитывается при отсутствии изменений в позиции Порядка. Как только столбец/слой получит более высокое значение Порядка, он будет размещен сверху, независимо от положения столбца/слоя на Xsheet/Timeline; и наоборот, если значение Порядка ниже, оно будет размещено сзади.

source: In case a column/layer's Z position is edited, columns/layers closer to the camera will be composited on top of others, ignoring both its Xsheet/Timeline order and its SO value (see :ref:`Working in a 3D Environment <working_in_a_3d_environment>` ).
ru: В случае редактирования позиции Z столбца/слоя столбцы/слои, расположенные ближе к камере, будут скомпонованы поверх других, игнорируя как порядок Xsheet/Timeline, так и значение Порядка (см. :ref:`Работа в 3D-среде <working_in_a_3d_environment>`).

source: **To edit and animate a column/layer SO value:**
ru: **Чтобы редактировать и анимировать значение порядка столбца/слоя:**

source: Select the column/layer to which you want to edit the SO value.
ru: Выберите столбец/слой, для которого вы хотите изменить значение порядка.

source: Set the frame where you want to define the key.
ru: Установите кадр, в котором вы хотите определить ключ.

source: In the tool options bar enter the value in the **SO** field.
ru: На панели параметров инструмента введите значение в поле **Порядок**.

source: Columns/layers **SO** values can also be edited and animated by working in the Function Editor (see :ref:`Editing Curves and Numerical Columns <editing_curves_and_numerical_columns>` ).
ru: Значения **Порядка** также можно редактировать и анимировать, работая в Редакторе функций (см. :ref:`Редактирование кривых и числовых столбцов <editing_curves_and_numerical_columns>`).
