Repository: Savraska2/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/editing_curves_and_numerical_columns.po
Languages: ru

source: **Ctrl-click** (PC) or **Cmd-click** (Mac) the curve where you want to add the keyframe point to it.
ru: Кликните с зажатой кнопкой **Ctrl** (PC) или **Cmd** (Mac) по кривой, где вы хотите добавить точку ключевого кадра к нему.

source: **To remove a keyframe:**
ru: **Чтобы удалить ключевой кадр:**

source: Select the keyframe to remove and choose Edit → **Delete**.
ru: Выберите ключевой кадр для удаления и выберите пункт меню Правка → **Удалить**.

source: Set the current frame where a keyframe is and click the **Set Key** button (|key|).
ru: Установите текущий кадр, в котором находится ключевой кадр, и нажмите кнопку **Установить ключ** (|key|).

source: **To select keyframes:**
ru: **Чтобы выбрать ключевые кадры:**

source: Click to select a keyframe.
ru: Нажмите, чтобы выбрать ключевой кадр.

source: Shift-click to add a keyframe to or remove it from the selection.
ru: Удерживая клавишу Shift, добавьте ключевой кадр или удалите его из выделенного фрагмента.

source: Click and drag to select all of the keyframes that are in the area you define.
ru: Нажмите и перетащите, чтобы выбрать все ключевые кадры, которые находятся в области, которую вы определяете.

source: **To select curve segments:**
ru: **Чтобы выбрать сегменты кривой:**

source: Select the segment or the control points at the ends of the segment.
ru: Выберите сегмент или контрольные точки на концах сегмента.

source: **To move the selection:**
ru: **Чтобы переместить выделение:**

source: Click and drag any of the selected control points.
ru: Нажмите и перетащите любую из выбранных контрольных точек.

source: **To edit curves:**
ru: **Для редактирования кривых:**

source: Use the **Copy** command: the selected segments will be kept in memory for further operations.
ru: Используйте команду **Копировать**: выбранные сегменты будут сохранены в памяти для дальнейших операций.

source: Use the **Cut** command: the selected segments will be removed from the curve and will be kept in memory for further operations.
ru: Используйте команду **Вырезать**: выбранные сегменты будут удалены из кривой и будут сохранены в памяти для дальнейших операций.

source: Use the **Paste** command: the segments kept in memory will be pasted starting from the selected keyframe, preserving any other previously defined keyframes not replaced by the new ones.
ru: Используйте команду **Вставить**: сегменты, хранящиеся в памяти, будут вставлены, начиная с выбранного ключевого кадра, с сохранением любых других ранее определенных ключевых кадров, не замененных новыми.

source: Use the **Delete** command: the selection will be deleted.
ru: Используйте команду **Удалить**: выбор будет удален.

source: **To navigate keyframes for the current curve:**
ru: **Для навигации по ключевым кадрам текущей кривой:**

source: Use the **Next Key** (|next_key|) and **Previous Key** buttons (|prevkey|) available at the sides of the **Set Key** button.
ru: Используйте кнопки **Следующий ключ** (|next_key|) и **Предыдущий ключ** (|prevkey|), расположенные по бокам от кнопки **Установить ключ**.

source: **To cycle previously created keyframes:**
ru: **Для циклического воспроизведения ранее созданных ключевых кадров:**

source: Right-click the dashed line after the end of the curve and choose **Activate Cycle** from the menu that opens.
ru: Щелкните правой кнопкой мыши пунктирную линию после конца кривой и выберите **Включить цикл** в открывшемся меню.

source: **To disable the cycle:**
ru: **Чтобы отключить цикл:**

source: Right-click the curve and choose **Deactivate Cycle** from the menu that opens.
ru: Щелкните правой кнопкой мыши по кривой и выберите **Деактивировать цикл** в открывшемся меню.

source: Only keyframes included in the selection are considered when performing copy, cut and paste operations.
ru: При выполнении операций копирования, вырезания и вставки учитываются только ключевые кадры, включенные в выделение.

source: All the **Edit** menu commands are also available in the menu that opens when right-clicking in the Xsheet/Timeline cells.
ru: Все команды меню **Правка** также доступны в меню, которое открывается при щелчке правой кнопкой мыши в ячейках Xsheet/Timeline.

source: Setting Segment Interpolations
ru: Настройка сегментных интерполяций

source: A transformation segment, that is to say the section between two keyframes, can have different interpolations affecting the way the value changes from one key to another. The set interpolation will be displayed graphically in the Graph Editor, and as a series of values, one for each frame, in the Spreadsheet.
ru: Сегмент преобразования, то есть раздел между двумя ключевыми кадрами, может иметь различные интерполяции, влияющие на то, как значение изменяется от одного ключа к другому. Заданная интерполяция будет отображаться графически в редакторе графиков и в виде последовательности значений, по одному для каждого кадра, в электронной таблице.

source: Available interpolations are the following: **Linear**, **Speed In / Speed Out**, **Ease In / Ease Out**, **Ease In / Ease Out %**, **Exponential**, **Expression**, **File**, **Constant** and **Similar Shape**. The *default interpolation* can be set in the Preferences → Animation window, but the interpolation can be changed at any time in the interpolation area of the Function Editor, on the top right of the window.
ru: Доступны следующие интерполяции: **Линейная**, **Замедл. в начале/в конце**, **Ease In / Ease Out**, **Ease In / Ease Out (%)**, **Экспоненциальная**, **Выражений**, **Интерполяция из файла**, **Равномерная** и **Интерполяция аналогичной формы**. *Интерполяция по умолчанию* может быть настроена ​​в окне Настройки программы → Анимация, но ее можно изменить в любой момент в области интерполяции редактора функций в правом верхнем углу окна.

source: In the same area it is also possible to define an interpolation **Step**, that is to say the number of frames for which the interpolation values have to be repeated, for instance to match a movement with an animation level exposed at a specific step. The default animation step can be set in the Preferences → Animation window.
ru: В той же области также возможно определить интерполяцию **Шаг**, то есть количество кадров, для которых должны повторяться значения интерполяции, например, чтобы соответствовать движению с уровнем анимации, выставленным на определенной шаг. Шаг анимации по умолчанию можно установить в окне Настройки программы → Анимация.

source: **To set the type of interpolation for a segment in the Spreadsheet:**
ru: **Чтобы установить тип интерполяции для сегмента в электронной таблице:**

source: Move the current frame cursor to a frame belonging to a segment.
ru: Переместите курсор текущего кадра в кадр, принадлежащий сегменту.

source: Choose the interpolation from the option menu available in the **Interpolation:** area of the Function Editor.
ru: Выберите интерполяцию в меню параметров, доступном в области **Интерполяция:** Редактора функций.

source: Click the **Apply** button to apply the desired change.
ru: Нажмите кнопку **Применить**, чтобы применить желаемое изменение.

source: **To set the type of interpolation for multiple segments in the Spreadsheet:**
ru: **Чтобы установить тип интерполяции для нескольких сегментов в электронной таблице:**

source: Make a cell selection that encompases multiple keyframe segments.
ru: Выберите ячейку, охватывающую несколько сегментов ключевых кадров.

source: Right click on one of the selected cells and choose the desired interpolation type in the menu that opens.
ru: Щелкните правой кнопкой мыши одну из выбранных ячеек и выберите нужный тип интерполяции в открывшемся меню.

source: **To set the type of interpolation for a segment in the Graph Editor:**
ru: **Чтобы установить тип интерполяции для сегмента в редакторе графиков:**

source: Set the segment by doing one of the following:
ru: Задайте сегмент, выполнив одно из следующих действий:

source: Click a segment to select it.
ru: Нажмите сегмент, чтобы выделить его.

source: Move the **Current Frame Marker** to a frame belonging to a segment.
ru: Переместите **Маркер текущего кадра** в кадр, принадлежащий сегменту.

source: Choose the interpolation from the dropdown menu available in the **Interpolation:** area of the Function Editor.
ru: Выберите интерполяцию в раскрывающемся меню, доступном в области **Интерполяция:** Редактора функций.

source: The interpolation options are also available when right-clicking a segment.
ru: Опции интерполяции также доступны при щелчке правой кнопкой мыши по сегменту.

source: **To set the Step of the interpolation:**
ru: **Чтобы установить шаг интерполяции:**

source: Specify the **Step** value in the interpolation area of the Function Editor.
ru: Укажите значение **Шага** в области интерполяции редактора функций.

source: Using Linear Interpolations
ru: Использование линейных интерполяций

source: When the interpolation is *Linear* the curve segment turns to a straight line and the speed of the transformation is constant.
ru: Когда интерполяция *Линейная*, сегмент кривой превращается в прямую линию, и скорость преобразования постоянна.

source: **To set a Linear interpolation:**
ru: **Чтобы установить линейную интерполяцию:**

source: Choose **Linear** from the option menu available in the Interpolation area of the Function Editor and click the **Apply** button.
ru: Выберите **Линейная** в меню параметров, доступных в области интерполяции редактора функций, и нажмите кнопку **Применить**.

source: Right-click the curve segment you want to set the interpolation for, and choose **Linear Interpolation** from the menu that opens.
ru: Щелкните правой кнопкой мыши сегмент кривой, для которого вы хотите установить интерполяцию, и выберите **Линейная интерполяция** в открывшемся меню.

source: Using Speed In / Speed Out Interpolations
ru: Использование интерполяции ускорения в начале/в конце

source: When the interpolation is Speed In / Speed Out, both control points at the ends of the segment have handles whose direction and length define the slope of the curve, therefore the speed of the transformation. The handles direction and length can be set by entering values in the Interpolation area of the Function Editor, or by dragging the handles themselves.
ru: Когда интерполяцией выбрана в начале/конце, обе контрольные точки на концах сегмента имеют указатели, направление и длина которых определяют наклон кривой, следовательно, скорость преобразования. Направление и длину маркеров можно задать, введя значения в области интерполяции редактора функций или перетащив сами маркеры.

source: By default the handles are linked, making their degree of movement dependent on adjacent segments in order to define a smooth curve, but the link can be broken in order to move the handle freely. For example if subsequent segments have the Speed In / Speed Out interpolation, the handles of the shared points share the same direction, but breaking the link each handle can have a different direction.
ru: По умолчанию указатели связаны, что делает их степень перемещения зависимой от соседних сегментов, чтобы определить плавную кривую, но связь может быть разорвана, чтобы перемещать указатель свободно. Например, если последующие сегменты имеют интерполяцию в начале/конце, маркеры общих точек имеют одинаковое направление, но при разрыве связи каждый указатель может иметь различное направление.

source: Handles can also be collapsed in control points in order to turn them into corner points; in this case to retrieve the handles it is possible to reset their length and direction.
ru: Указатели также можно свернуть в контрольных точках, чтобы превратить их в угловые точки; в этом случае для извлечения указателей можно сбросить их длину и направление.

source: **To set a Speed In / Speed Out interpolation:**
ru: **Чтобы установить интерполяцию в начале/конце:**

source: Choose **Speed In / Speed Out** from the dropdown menu available in the Interpolation area of the Function Editor and click the **Apply** button.
ru: Выберите **Ускорение в начале/конце** из выпадающего меню, доступного в области интерполяции редактора функций, и нажмите кнопку **Применить**.

source: Right-click the curve segment you want to set the interpolation for, and choose **Speed In / Speed Out Interpolation** from the menu that opens.
ru: Нажмите правой кнопкой мыши на сегмент кривой, для которого вы хотите установить интерполяцию, и выберите **Speed ​​In / Speed ​​Out Interpolation** в открывшемся меню.

source: **To set the speed of the interpolation:**
ru: **Чтобы установить скорость интерполяции:**

source: Select the keyframe at the beginning or at the end of the curve segment you want to edit, or the curve segment itself.
ru: Выберите ключевой кадр в начале или в конце сегмента кривой, который вы хотите редактировать, или сам сегмент кривой.

source: Set the slope of the curve after or before the keyframe by doing one of the following:
ru: Установите наклон кривой после или перед ключевым кадром, выполнив одно из следующих действий:

source: Enter the **Speed In** and **Speed Out** direction and length values in the Interpolation area of the Function Editor and click the **Apply** button.
ru: Введите значения направления и длины **Замедл. в начале** и **Замедл. в конце** в области интерполяции редактора функций и нажмите кнопку **Применить**.

source: Click and drag the end of the handles to move them freely.
ru: Нажмите и перетащите концы указателей чтобы свободно перемещать их.

source: **Shift-click** and drag the end of the handles to move them with a constraint in the horizontal or vertical direction.
ru: **Удерживая нажатой клавишу Shift**, перетащите конец маркеров, чтобы переместить их с ограничением в горизонтальном или вертикальном направлении.

source: **To move a control point handle free from the adjacent segments:**
ru: **Чтобы переместить указатель контрольной точки от соседних сегментов:**

source: Right-click the control point and choose **Unlink Handles** from the menu that opens.
ru: Щелкните правой кнопкой мыши контрольную точку и выберите **Разъединить Handles** в открывшемся меню.

source: **To link back handles to adjacent segments:**
ru: **Чтобы связать обратные указатели с соседними сегментами:**

source: Right-click the control point and choose **Link Handles** from the menu that opens.
ru: Щелкните правой кнопкой мыши контрольную точку и выберите **Связать Handles** в открывшемся меню.

source: **To turn a control point into a corner point:**
ru: **Чтобы превратить контрольную точку в угловую точку:**

source: Select the control point.
ru: Выберите контрольную точку.

source: Move the handle ends to the control point, in order to collapse them.
ru: Переместите концы указателя к контрольной точке, чтобы сложить их.

source: **To retrieve handles from a corner point:**
ru: **Чтобы восстановить указатели из угловой точки:**

source: Right-click the control point and choose **Reset Handles** from the menu that opens.
ru: Щелкните правой кнопкой мыши контрольную точку и выберите **Сбросить Handles** в открывшемся меню.

source: Using Ease In / Ease Out Interpolations
ru: Применение Ease In / Ease Out интерполяции

source: When the interpolation is Ease In / Ease Out, the segment is divided into three sections by two vertical lines: the first section is an acceleration, the second is at constant speed, the third is a deceleration. The duration in frames of each section can be set by entering values in the Interpolation area of the Function Editor, or by dragging the vertical lines available on the segment.
ru: Когда интерполяцией является Ease In / Ease Out, сегмент делится на три секции двумя вертикальными линиями: первая секция - ускорение, вторая - с постоянной скоростью, третья - замедление. Длительность в кадрах каждого раздела можно установить, введя значения в области интерполяции редактора функций или перетащив вертикальные линии, доступные на сегменте.

source: **To set an Ease In / Ease Out interpolation:**
ru: **Чтобы установить интерполяцию Ease In / Ease Out:**

source: Choose **Ease In / Ease Out** from the dropdown menu available in the Interpolation area of the Function Editor and click the **Apply** button.
ru: Выберите **Замедл. в начале/в конце** из выпадающего меню, доступного в области интерполяции редактора функций, и нажмите кнопку **Применить**.

source: Right-click the curve segment you want to set the transformation for, and choose **Ease In / Ease Out Interpolation** from the menu that opens.
ru: Щелкните правой кнопкой мыши сегмент кривой, для которого вы хотите установить преобразование, и выберите **Ease In / Ease Out Интерполяция** в открывшемся меню.

source: **To set the Ease In / Ease Out of the interpolation:**
ru: **Чтобы установить Ease In / Ease Out из интерполяции:**

source: Select the keyframe before or after the Ease In / Ease Out curve segment you want to edit, or the curve segment itself.
ru: Выберите ключевой кадр до или после сегмента кривой Ease In / Ease Out, который вы хотите редактировать, или самого сегмента кривой.

source: Enter the **Ease In** and **Ease Out** values in the Interpolation area of the Function Editor and click the **Apply** button.
ru: Введите значения **Замедл. в нач** и **Замедл. в конце** в области интерполяции редактора функций и нажмите кнопку **Применить**.

source: Move the vertical line setting the Ease In or Ease Out section of the segment, to change the curve after or before the keyframe.
ru: Переместите вертикальную линию, устанавливая секцию Ease In или Ease Out сегмента, чтобы изменить кривую после или перед ключевым кадром.

source: Using Ease In / Ease Out % Interpolations
ru: Использование Замедление в начале/в конце % интерполяции

source: The Ease In / Ease Out % interpolation is similar to the Ease In / Ease Out one, but the Ease In and Ease Out sections of the segments are expressed as a percentage of the segment frame duration.
ru: Интерполяция Ease In / Ease Out % аналогична интерполяции Ease In / Ease Out, но секции Ease In и Ease Out сегментов выражаются в процентах от длительности кадра сегмента.

source: **To set an Ease In / Ease Out % interpolation:**
ru: **Чтобы установить Ease In / Ease Out %:**

source: Choose **Ease In / Ease Out %** from the dropdown menu available in the Interpolation area of the Function Editor and click the **Apply** button.
ru: Выберите **Ease In / Ease Out%** в раскрывающемся меню, доступном в области интерполяции редактора функций, и нажмите кнопку **Применить**.

source: Right-click the curve segment you want to set the transformation for, and choose **Ease In / Ease Out % Interpolation** from the menu that opens.
ru: Щелкните правой кнопкой мыши сегмент кривой, для которого вы хотите установить преобразование, и выберите **Ease In / Ease Out % интерполяция** в открывшемся меню.

source: **To set the Ease In / Ease Out % of the interpolation:**
ru: **Чтобы установить Ease In / Ease Out % от интерполяции:**

source: Move the vertical line setting the Ease In or Ease Out section of the curve segment, to change the curve after or before the keyframe.
ru: Переместите вертикальную линию, устанавливая секцию Ease In или Ease Out сегмента кривой, чтобы изменить кривую после или перед ключевым кадром.

source: Using Exponential Interpolations
ru: Применение экспоненциальной интерполяции

source: When the interpolation is **Exponential** the curve segment turns to a curve that continually becomes steeper, because of that, the higher the frame, the faster the related value grows. Only positive values are significant for this interpolation.
ru: Когда интерполяция **Экспоненциальная**, сегмент кривой превращается в кривую, которая постоянно становится круче, из-за чего, чем выше кадр, тем быстрее растет соответствующее значение. Для этой интерполяции важны только положительные значения.

source: **To set an Exponential interpolation:**
ru: **Чтобы установить экспоненциальную интерполяцию:**

source: Choose **Exponential** from the dropdown menu available in the Interpolation area of the Function Editor and click the **Apply** button.
ru: Выберите **Экспоненциальная** в раскрывающемся меню, доступном в области интерполяции редактора функций, и нажмите кнопку **Применить**.

source: Right-click the curve segment you want to set the transformation for, and choose **Exponential Interpolation** from the menu that opens.
ru: Щелкните правой кнопкой мыши сегмент кривой, для которого вы хотите установить преобразование, и выберите **Экспоненциальная интерполяция** в открывшемся меню.

source: Using Interpolations Based on Expressions
ru: Использование интерполяции на основе выражений

source: When the interpolation is defined by an Expression, the segment values come from a *mathematical formula* that can be typed by using algebra notations. In this case the keyframes at both ends of the segment may change as well, according to the typed expression.
ru: Когда интерполяция определяется выражением, значения сегмента поступают из *математической формулы*, которая может быть набрана с помощью обозначений алгебры. В этом случае ключевые кадры на обоих концах сегмента также могут изменяться в соответствии с набранным выражением.

source: While typing the expression, if the syntax is recognized, a menu automatically opens suggesting you the possible terms: from the menu you can select the term both to display in a tooltip box its correct syntax, and to insert it in the expression.
ru: При вводе выражения, если синтаксис распознан, автоматически открывается меню, предлагающее вам возможные термины: из меню вы можете выбрать термин, чтобы отобразить в окне подсказки его правильный синтаксис и вставить его в выражение.

source: As soon as terms are recognized, different colors are used to highlight them: **operators and functions** are displayed in *dark blue*, **variables** in *light blue*, **constants** in *green*. When the expression is entered, any **syntax error** will be displayed in *red*.
ru: Как только термины распознаются, для их выделения используются разные цвета: **операторы и функции** отображаются *темно-синим*, **переменные** - *голубым*, **константы** - *зеленым*. Когда выражение введено, любая **синтаксическая ошибка** будет отображаться *красным*.

source: The **Unit** used for the function is displayed in a box next to the expression; in case the unit refers to a movement, the default unit can be changed, and the values will be automatically converted to the default one.
ru: **Ед. изм** используемая для функции, отображается в поле рядом с выражением; если единица относится к движению, единицу по умолчанию можно изменить, и значения будут автоматически преобразованы в единицу по умолчанию.

source: Apart from the standard operators and functions, some variables and predefined functions can also be used in expressions.
ru: Помимо стандартных операторов и функций, некоторые переменные и предопределенные функции также могут использоваться в выражениях.

source: Supported terms are the following:
ru: Поддерживаются следующие термины:

source: **Operators**
ru: **Операторы**

source: Addition, Subtraction, Multiplication, Division
ru: Сложение, вычитание, умножение, деление

source: Modulus: ``10%6=4`` .
ru: Модуль: ``10%6=4`` .

source: Exponentiation: ``a^2`` means ``a*a`` ; ``a^0.5`` is square root of ``a`` .
ru: Возведение в степень: ``a^2`` означает ``a*a`` ; ``a^0.5`` - квадратный корень из ``a`` .

source: **Math Functions**
ru: **Математические функции**

source: Angles are expressed in degrees.
ru: Углы, выраженные в градусах.

source: Hyperbolic functions.
ru: Гиперболические функции.

source: The greatest whole number less or equal than ``value`` .
ru: Наибольшее целое число, меньшее или равное ``value``.
