Repository: Savraska2/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/editing_curves_and_numerical_columns.po
Languages: ru

source: The smallest whole number less or equal than ``value`` .
ru: Наименьшее целое число меньшее или равное ``value``.

source: The integer closest to ``value`` .
ru: Целое число, ближайшее к ``value``.

source: Absolute value: ``abs(a)`` is ``a`` without the sign.
ru: Абсолютное значение: ``abs (a)`` это ``a`` без знака.

source: Returns 0 if ``value`` is 0; -1 if negative; 1 if positive.
ru: Возвращает 0, если ``value`` равно 0; -1 если отрицательное; 1, если положительное.

source: Returns square root of ``value`` .
ru: Возвращает квадратный корень из ``value``.

source: Returns argument with minimum value.
ru: Возвращает аргумент с минимальным значением.

source: Returns argument with maximum value.
ru: Возвращает аргумент с максимальным значением.

source: Returns ``min`` if ``value`` is less than ``min`` ; ``max`` if ``value`` is greater than ``max`` ; otherwise it returns ``value`` .
ru: Возвращает ``min``, если значение меньше ``min``; ``max``, если значение больше ``max``; в противном случае оно возвращает ``value``.

source: Returns 0 if ``value`` is less than ``min`` , otherwise it returns 1.
ru: Возвращает 0, если ``value`` меньше, чем ``min``, в противном случае возвращает 1.

source: Returns 0 if ``value`` is less than ``min`` , 1 if ``value`` is greater than or equal to ``max`` , and perform a smooth interpolation between 0 and 1 in interval ``min`` to ``max`` .
ru: Возвращает 0, если ``value`` меньше, чем ``min``, 1, если ``value`` больше или равно ``max``, и выполняет плавную интерполяцию между 0 и 1 в интервале от ``min`` до ``max``.

source: **Logical Operators**
ru: **Логические операторы**

source: Less
ru: Меньше

source: Less or equal.
ru: Меньше или равно.

source: More
ru: Больше

source: More or equal.
ru: Больше или равно.

source: Equal.
ru: Равно.

source: Not equal.
ru: Не равно.

source: **Boolean Operators**
ru: **Булевы операторы**

source: And.
ru: И.

source: Or.
ru: Или.

source: Not.
ru: Не.

source: **Conditional Expression**
ru: **Условное выражение**

source: If ``logical_expression`` is true, it returns ``value1`` , otherwise it returns ``value2`` .
ru: Если ``logical_expression`` истинно, то возвращается ``value1``, иначе возвращается ``value2``.

source: **Variables**
ru: **Переменные**

source: Ranges from 0.0 to 1.0 along the transition allowing position/lenght-independent transitions.
ru: Изменяется от 0,0 до 1,0 вдоль перехода, позволяя переходы независимо от положения/длины.

source: The current frame number.
ru: Текущий номер кадра.

source: It is relative to the transition.
ru: Относительно перехода.

source: **Constants**
ru: **Постоянные**

source: numeric constant
ru: числовая константа

source: E.g. 1, 2, 4.3.
ru: Например, 1, 2, 4,3 .

source: **Predefined Functions**
ru: **Предопределенные функции**

source: Cycles the transition of the ``period`` previous frames.
ru: Циклический переход ``периода`` к предыдущим кадрам.

source: Generates a pulse ranging from 0.0 to 1.0 set at position ``pos`` , with a different breadth depending on the ``length`` of the pulse itself.
ru: Генерирует импульс в диапазоне от 0,0 до 1,0, установленный в позиции ``pos``, с различной шириной в зависимости от ``длины`` самого импульса.

source: Generates a bump ranging from 0.0 to 1.0 set at position ``pos`` , with a different breadth depending on the ``length`` of the bump itself.
ru: Создает удар в диапазоне от 0,0 до 1,0, установленный в позиции ``pos``, с различной шириной в зависимости от ``длины`` поднять себя.

source: Generates random sequences between 0.0 and 1.0.
ru: Генерирует случайные последовательности от 0,0 до 1,0.

source: Generates a random number between 0.0 and ``max`` .
ru: Генерирует случайное число между 0,0 до ``max``.

source: Generates a random number between ``min`` and ``max`` .
ru: Генерирует случайное число между `` min`` и `` max``.

source: Works like random, but allows the user to specify the ``seed`` to modify the value of the ``random`` function.
ru: Работает как random, но позволяет пользователю указать ``seed`` для изменения значения функции ``random``.

source: Like above, with ``max`` as the maximum value of the transition.
ru: Как и выше, с ``max`` в качестве максимального значения перехода.

source: Like above, with ``min`` and ``max`` as the minimum and maximum values of the transition.
ru: Как и выше, с ``min`` и ``max`` в качестве минимального и максимального значений перехода.

source: Generates a periodic sawtooth shaped curve according to the ``length`` and ``height`` values; if ``height`` is not expressed it is assumed to be equal to ``length`` .
ru: Генерирует периодическую пилообразную кривую в соответствии со значениями ``length`` и ``height``; если высота не выражена, предполагается, что она равна длине.

source: The same as ``sin(f*2*pi/length)`` .
ru: То же, что и ``sin(f*2*pi/length)``.

source: The predefined function ``saw`` , ``wave`` and ``pulse`` use implicitly a variable independent from the frame number. You can provide explicitly a variable using the form: ``fun (var; argument...)`` .
ru: Предопределенные функции ``saw``, ``wave`` и ``pulse`` неявно используют переменную, независимую от номера кадра. Вы можете явно указать переменную, используя форму: ``fun (var; arguments...)``.

source: **To set an interpolation based on an Expression:**
ru: **Чтобы установить интерполяцию на основе выражения:**

source: Choose **Expression** from the dropdown menu available in the Interpolation area of the Function Editor and click the **Apply** button.
ru: Выберите **Выражение** в раскрывающемся меню, доступном в области интерполяции редактора функций, и нажмите кнопку **Применить**.

source: Right-click the curve segment you want to set the transformation for, and choose **Expression Interpolation** from the menu that opens.
ru: Щелкните правой кнопкой мыши сегмент кривой, для которого вы хотите установить преобразование, и выберите **Интерполяция выражений** в открывшемся меню.

source: **To set the expression:**
ru: **Чтобы установить выражение:**

source: Type the expression in the Interpolation area of the Function Editor. As you type, if the syntax is recognized, a menu automatically opens suggesting you the possible terms.
ru: Введите выражение в области интерполяции редактора функций. По мере ввода, если синтаксис распознается, автоматически открывается меню, предлагающее вам возможные термины.

source: Press **Enter** to submit the expression and check its syntax.
ru: Нажмите **Enter**, чтобы отправить выражение и проверить его синтаксис.

source: If the expression refers to a movement, change the unit if needed.
ru: Если выражение относится к движению, при необходимости измените единицу измерения.

source: Press the **Apply** button to apply the desired change.
ru: Нажмите кнопку **Применить**, чтобы применить желаемое изменение.

source: **To select a suggested term:**
ru: **Чтобы выбрать предложенный термин:**

source: Use the **Up Arrow** and **Down Arrow** keys to select the term in the menu that opens, then press **Enter**.
ru: Используйте клавиши **Стрелка вверх** и **Стрелка вниз**, чтобы выбрать термин в открывшемся меню, затем нажмите **Enter**.

source: Click the term in the menu that opens.
ru: Нажмите термин в открывшемся меню.

source: When selecting a term with the Arrow keys a tooltip box displays the term correct syntax.
ru: При выборе термина с помощью клавиш со стрелками в окне подсказки отображается термин правильный синтаксис.

source: Using Transformation References
ru: Использование ссылок на трансформацию

source: It is possible to use in expressions references to any *object*, *effect* or *Plastic vertex* transformation. In this way, expressions can be used to create relationships between different transformations belonging to different items that can be of any of the aforementioned types.
ru: В выражениях можно использовать ссылки на любое преобразование *object*, *effect* или *Plastic vertex*. Таким образом, выражения могут использоваться для создания отношений между различными преобразованиями, принадлежащими различным элементам, которые могут быть любого из вышеупомянутых типов.

source: The syntax to create a reference to an object transformation is the following:
ru: Синтаксис для создания ссылки на преобразование объекта следующий:

source: ``object.transformation`` or ``object.transformation(delta)``
ru: ``object.transformation`` или ``object.transformation (delta)``

source: where ``object`` is the ID name of a *camera*, *column*, *pegbar* or the *table*, as can be read in the Stage and FX Schematic nodes' tooltips; ``transformation`` can be any of its available transformations; and ``delta`` is the difference between the target frame and the current one.
ru: где ``object`` - это идентификационное имя *camera*, *column*, *pegbar* или *table *, которое можно прочитать во всплывающих подсказках узлов Stage и FX Schematic; `` преобразование`` может быть любым из доступных преобразований; и ``delta`` - это разница между целевым кадром и текущим.

source: For example ``camera1.ns`` refers to the N/S position of the Camera1. Whereas ``camera1.ns(f-5)`` refers to the N/S position of the Camera1, 5 frames before the current frame.
ru: Например, ``camera1.ns`` относится к положению N/S камеры Camera1. Принимая во внимание, что ``camera1.ns (f-5)`` относится к положению N/S камеры1, за 5 кадров до текущего кадра.

source: **Objects**
ru: **Объекты**

source: Refer to the camera ``n`` .
ru: Относится к камере ``n``.

source: Refers to the column ``n`` .
ru: Относится к столбцу ``n`` .

source: Refer to the pegbar ``n`` .
ru: Относится к штифтам ``n`` .

source: Refer to the table.
ru: Относится к анимационному столу.

source: **Transformations**
ru: **Преобразования**

source: Refer to the vertical and horizontal position.
ru: Относится к вертикальному и горизонтальному положению.

source: Refer to the position along the motion path.
ru: Относится к положению вдоль траектории движения.

source: Refers to the rotation.
ru: Относится к вращению.

source: Refer to the global, horizontal and vertical scaling.
ru: Относится к глобальному, вертикальному и горизонтальному масштабированию.

source: Refer to the horizontal and vertical shear.
ru: Относится к горизонтальному и вертикальному сдвигу.

source: Refers to the position along the z axis.
ru: Относится к положению вдоль оси Z.

source: The syntax to create a reference to an effect parameter is the following:
ru: Синтаксис для создания ссылки на параметр эффекта следующий:

source: ``fx.name.parameter`` or ``fx.name.parameter(delta)``
ru: ``fx.name.parameter`` или ``fx.name.parameter (delta)``

source: where ``name`` is the ID name of an *effect*, as can be read in the FX Schematic nodes' tooltips, ``parameter`` is any of the available effect parameters, and ``delta`` is the difference between the target frame and the current one.
ru: где ``name`` - это имя *эффекта*, которое можно прочитать во всплывающих подсказках к узлам FX Schematic, ``parameter`` - любой из доступных параметров эффекта, а ``delta`` - разница между целевым кадром и текущим.

source: When an effect parameter has multiple sub-parameters, for example the Center parameter has X and Y sub-parameters, the syntax has to be the following:
ru: Когда параметр эффекта имеет несколько подпараметров, например, параметр Center имеет подпараметры X и Y, синтаксис должен быть следующим:

source: ``fx.name.parameter.subparameter`` or ``fx.name.parameter.subparameter(delta)``
ru: ``fx.name.parameter.subparameter`` или ``fx.name.parameter.subparameter (delta)``

source: where ``name`` can be any used effect, ``parameter`` the main effect parameter, ``subparameter`` is the effect sub-parameter, and ``delta`` is the difference between the target frame and the current one.
ru: где ``name`` может быть любым используемым эффектом, ``parameter`` основным параметром эффекта, ``subparameter`` является субпараметром эффекта, а ``delta`` является разницей между целевым кадром и текущим один.

source: For example ``fx.blur2.value`` refers to the Value parameter of the effect Blur2; ``fx.blur2.value(f-5)`` refers to the Value parameter of the effect Blur2, 5 frames before the current frame; and ``fx.raylit1.center.x`` refers to the X sub-parameter of the Center parameter of the effect Raylit1.
ru: Например, ``fx.blur2.value`` относится к параметру Value эффекта Blur2; ``fx.blur2.value(f-5)`` ссылается на параметр Value эффекта Blur2, за 5 кадров до текущего кадра; и ``fx.raylit1.center.x`` относится к подпараметру X параметра Center эффекта Raylit1.

source: If the effect parameter name consists of several words, they have to be typed in expressions *without* blank spaces.
ru: Если имя параметра эффекта состоит из нескольких слов, они должны быть набраны в выражениях *без* пробелов.

source: The syntax to create a reference to a Plastic vertex transformation is the following:
ru: Синтаксис для создания ссылки на пластическое преобразование вершины следующий:

source: ``vertex(column_number, "vertex_name").transformation`` or ``vertex(column_number, "vertex_name").transformation(delta)``
ru: ``vertex (column_number, "vertex_name").transformation`` или ``vertex (column_number, "vertex_name").transformation(delta) ``

source: where ``column_number`` is the ID number of the *column* in which the referenced vertex exist, ``vertex_name`` is the exact name of the referenced Plastic vertex, ``transformation`` is any of the available vertex transformations (see below), and ``delta`` is the difference between the target frame and the current one.
ru: где ``column_number`` - это идентификационный номер *столбца*, в котором существует указанная вершина, ``vertex_name`` - точное имя упомянутой пластиковой вершины, ``transformation`` - любое из доступных преобразований вершины (см. ниже), а ``delta`` - это разница между целевым кадром и текущим.

source: **Plastic Vertex Transformations**
ru: **Пластиковые вершинные преобразования**

source: Refers to the angle between the vertex and its parent.
ru: Относится к углу между вершиной и ее родителем.

source: Refers to the distance between the vertex and its parent.
ru: Относится к расстоянию между вершиной и ее родителем.

source: Refers to the vertex sorting order.
ru: Относится к порядку сортировки вершин.

source: See :ref:`Use Mathematical Expression in Plastic Animation <use_mathematical_expression_in_plastic_animation>` for further details on animating a Plastic mesh using expressions.
ru: См. :ref:`Использование математических выражений в пластической анимации <use_mathematical_expression_in_plastic_animation>` для получения дополнительной информации об анимации пластиковой сетки с использованием выражений.

source: Using Interpolations Based on File Data
ru: Использование интерполяций на основе данных файла

source: When an interpolation is based on File data, the segment values are retrieved from the contents of a file. In this case the keyframes at both ends of the segment may change as well, according to the file data.
ru: Когда интерполяция основана на данных файла, значения сегмента извлекаются из содержимого файла. В этом случае ключевые кадры на обоих концах сегмента также могут изменяться, согласно данным файла.

source: The file can be created by an external device or other applications, such as motion-control cameras or 3D software; supported file formats are BAT, DAT, RTF and TXT.
ru: Файл может быть создан внешним устройством или другими приложениями, такими как камеры управления движением или программное обеспечение 3D; поддерживаемые форматы файлов: BAT, DAT, RTF и TXT.

source: The value for each frame is taken from the file content, that must consist of a series of numbers listed in several lines.
ru: Значение для каждого кадра берется из содержимого файла, которое должно состоять из последовательности чисел, перечисленных в нескольких строках.

source: In case the file contains several values in each line, it is possible to define which value in each line has to be used by specifying a column number. For example, if you have a file like this:
ru: Если файл содержит несколько значений в каждой строке, можно определить, какое значение в каждой строке следует использовать, указав номер столбца. Например, если у вас есть такой файл:

source: the value 2 will cause 200, 201, 202 to be loaded.
ru: значение 2 приведет к загрузке 200, 201, 202.

source: The unit used for the data is displayed in a box next to the file path; in case the unit refers to a movement, the default unit can be changed, and the values will be automatically converted to the default one.
ru: Единица, используемая для данных, отображается в поле рядом с путем к файлу; если единица относится к движению, единицу по умолчанию можно изменить, и значения будут автоматически преобразованы в единицу по умолчанию.

source: **To set an interpolation based on File data:**
ru: **Чтобы установить интерполяцию на основе данных файла:**

source: Choose **File** from the option menu available in the Interpolation area of the Function Editor and click the **Apply** button.
ru: Выберите **Файл** в меню параметров, доступном в области интерполяции редактора функций, и нажмите кнопку **Применить**.

source: Right-click the curve segment you want to set the transformation for, and choose **File Interpolation** from the menu that opens.
ru: Щелкните правой кнопкой мыши сегмент кривой, для которого вы хотите установить преобразование, и выберите **Интерполяция из файла** в открывшемся меню.

source: **To set the File information:**
ru: **Чтобы установить информацию о файле:**

source: Type in the **File Path** field, or use the browser button, to set the path to the data file.
ru: Введите в поле **Путь к файлу** или используйте кнопку браузера, чтобы указать путь к файлу данных.

source: Specify which value in each line has to be used by specifying the **Column** number.
ru: Укажите, какое значение в каждой строке следует использовать, указав число **Столбец**.

source: If the File data refers to a movement, change the unit if needed.
ru: Если данные файла относятся к движению, при необходимости измените единицу измерения.

source: If in the Browser you choose any project default folder, in the path field the full path will be replaced by the related default folder alias (see :ref:`Project Default Folders <project_default_folders>` ).
ru: Если в браузере вы выбираете какую-либо папку проекта по умолчанию, в поле пути полный путь будет заменен соответствующим псевдонимом папки по умолчанию (см. :ref:`Папки проекта по умолчанию <project_default_folders>`).

source: Using Constant Interpolations
ru: Использование постоянных интерполяций

source: When an interpolation is **Constant**, the segment values are always equal to the value of the first key defining the segment.
ru: Когда интерполяция **Равномерная**, значения сегмента всегда равны значению первого ключа, определяющего сегмент.

source: **To set a Constant interpolation:**
ru: **Чтобы установить постоянную интерполяцию:**

source: Choose **Constant** from the option menu available in the Interpolation area of the Function Editor and click the **Apply** button.
ru: Выберите **Постоянная** в меню параметров, доступном в области интерполяции редактора функций, и нажмите кнопку **Применить**.

source: Right-click the curve segment you want to set the interpolation for, and choose **Constant Interpolation** from the menu that opens.
ru: Щелкните правой кнопкой мыши сегмент кривой, для которого вы хотите установить интерполяцию, и выберите **Равномерная Интерполяция** в открывшемся меню.

source: Using Interpolations Based on Similar Shapes
ru: Использование интерполяций на основе похожих фигур

source: When the interpolation is based on a Similar Shape, the segment values changes according to the shape of the curve you specify as reference (see :ref:`Using Transformation References <using_transformation_references>` ). As soon as the interpolation is set, whenever the reference curve is edited, the segment will change accordingly.
ru: Когда интерполяция основана на аналогичной форме, значения сегмента изменяются в соответствии с формой кривой, которую вы указываете в качестве ссылки (см. :ref:`Использование ссылок на преобразование <using_transformation_references>`). Как только интерполяция установлена, каждый раз, когда эталонная кривая редактируется, сегмент изменяется соответственно.

source: This interpolation proves useful when you want to control at once several curves: if all of them share the same reference curve, by modifying the reference curve you will modify automatically all the curves referring to it.
ru: Эта интерполяция оказывается полезной, когда вы хотите управлять сразу несколькими кривыми: если все они имеют одну и ту же базовую кривую, изменяя базовую кривую, вы автоматически модифицируете все кривые, относящиеся к ней.

source: It is also possible to set a **Frame Offset** value so that the interpolation will refer not to the same frame range of the reference curve, but to a different one.
ru: Также можно установить значение **Смещение кадра**, чтобы интерполяция относилась не к тому же диапазону кадров эталонной кривой, а к другому.

source: **To set an interpolation based on a Similar Shape:**
ru: **Чтобы установить интерполяцию на основе аналогичной формы:**

source: Choose **Similar Shape** from the option menu available in the Interpolation area of the Function Editor and click the **Apply** button.
ru: Выберите **Аналогичная форма** в меню параметров, доступных в области интерполяции редактора функций, и нажмите кнопку **Применить**.

source: Right-click the curve segment you want to set the transformation for, and choose **Similar Shape Interpolation** from the menu that opens.
ru: Щелкните правой кнопкой мыши по сегменту кривой, для которого вы хотите установить преобразование, и выберите **Интерполяция аналогичной формы** в открывшемся меню.

source: **To set the reference curve:**
ru: **Чтобы установить референсную кривую:**

source: Set the **Reference Curve:** in the Interpolation area of the Function Editor by typing the reference to an object or an effect transformation by using the appropriate syntax (see :ref:`Using Transformation References <using_transformation_references>` ).
ru: Задайте **Референсную кривую:** в области интерполяции редактора функций, введя ссылку на объект или преобразование эффекта, используя соответствующий синтаксис (см. :ref:`Использование ссылок на преобразование <using_transformation_references>`).

source: Set a **Frame Offset** in the Interpolation area of the Function Editor if you want the interpolation to refer not to the same frame range of the reference curve, but to a different one.
ru: Установите **Смещение кадра** в области интерполяции редактора функций, если вы хотите, чтобы интерполяция ссылалась не на тот же диапазон кадров эталонной кривой, а на другой.

source: Controlling Several Function Curves at the Same Time
ru: Управление несколькими функциональными кривыми одновременно

source: It's possible to control the keys and the interpolations of all the function curves visualized in the Function Editor by using widgets available in a horizontal strip at the top of the **Graph Editor** area, below the frame ruler.
ru: Можно управлять ключами и интерполяцией всех функциональных кривых, визуализированных в Редакторе функций, используя виджеты, доступные в горизонтальной полосе в верхней части области **Редактор графиков**, под линейкой кадров.
