Repository: Savraska2/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/editing_curves_and_numerical_columns.po
Languages: ru

source: This allows you to define keys and control the interpolation speed for different curves at the same time, such as a camera truck and pan, or an effect animation and a pegbar movement.
ru: Это позволяет вам определять ключи и управлять скоростью интерполяции для разных кривых одновременно, например, для камеры и панорамирования, или для анимации эффекта и движения штифтов.

source: With respect to keys, a keyframe is visible in the strip for each keyframe defined for any curve visible in the Graph Editor; a line connects the keyframes for all the frames where there is an animation going on. The strip keyframe can be moved, automatically moving the keyframes it refers to; in case the strip keyframe refers to keyframes at the same frame in several curves, all the keyframes will move along.
ru: Что касается ключей, ключевой кадр виден в полосе для каждого ключевого кадра, определенного для любой кривой, видимой в редакторе графиков; линия соединяет ключевые кадры для всех кадров, в которых происходит анимация. Ключевой кадр полосы можно перемещать, автоматически перемещая ключевые кадры, к которым он относится; если ключевой кадр полосы ссылается на ключевые кадры в одном и том же кадре в нескольких кривых, все ключевые кадры будут двигаться вдоль.

source: With respect to interpolation, if all the visible curves have a key at the same specific frame, and the segment on the side of the key has the same **Ease In / Ease Out** value or the same **Speed In / Speed Out** horizontal component, a marker will be visible in the strip on the side of the strip keyframes. The marker shaped as an *opening square bracket* is for the segment to the right of the keyframe, the one shaped like a *closing square bracket* is for the segment on the left of the keyframe. The markers can be moved, automatically changing the **Ease In / Ease Out** or the **Speed In / Speed Out** values of all the segments they refer to.
ru: Что касается интерполяции, если все видимые кривые имеют ключ в одном и том же конкретном кадре, а сегмент на стороне ключа имеет одинаковое значение **Ease In/Ease Out** или одинаковое **Speed ​​In/Speed Out** горизонтальный компонент, маркер будет виден в полосе на боковой стороне ключевых кадров полосы. Маркер в форме *открывающей квадратной скобки* предназначен для сегмента справа от ключевого кадра, а маркер в форме *закрывающей квадратной скобки* - для сегмента слева от ключевого кадра. Маркеры можно перемещать, автоматически изменяя значения **Ease In/Ease Out** или **Speed ​​In / Speed ​​Out** всех сегментов, к которым они относятся.

source: **To set which curves have to be controlled:**
ru: **Чтобы установить, какие кривые должны контролироваться:**

source: Display the curves in the Graph Editor (see :ref:`Using the Graph Editor <using_function_curves>` ).
ru: Отобразите кривые в редакторе графиков (см. :ref:`Использование редактора графиков <using_function_curves>`).

source: Ctrl-click (PC) or Cmd-click (Mac) the frame ruler where you want to add the keyframe: a keyframe will be added to all the visible curves.
ru: Кликните, нажав клавишу Ctrl (PC) или Cmd (Mac) на линейке кадров, в которую вы хотите добавить ключевой кадр: ключевой кадр будет добавлен ко всем видимым кривым.

source: Click and drag the strip keyframe: all the keyframes it refers to will move along.
ru: Нажмите и перетащите ключевой кадр полосы: все ключевые кадры, на которые он ссылается, будут перемещаться.

source: **To control the speed of the interpolation:**
ru: **Для контроля скорости интерполяции:**

source: Move the markers visible on the sides of the strip keyframes.
ru: Переместите маркеры, видимые по бокам ключевых кадров полосы.

source: Example expressions
ru: Примеры выражений
