Repository: Savraska2/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/editing_curves_and_numerical_columns.po
Languages: ru

source: Editing Using Spreadsheet and Curves
ru: Редактирование с использованием электронных таблиц и кривых

source: Changes in Object transformations and effects parameters are shown in the **Function Editor** window, where keyframes and their related interpolations can be controlled and modified by using a *Spreadsheet* of numerical columns or a *Graph Editor*.
ru: Изменения в преобразованиях объектов и параметрах эффектов отображаются в окне **Редактор функций**, где ключевые кадры и связанные с ними интерполяции можно контролировать и изменять с помощью *электронной таблицы* числовых столбцов или *редактора графиков*.

source: The **Spreadsheet** displays changes in columns where each column represents a single animatable parameter and each row shows the value of a parameter at each frame.
ru: **Электронная таблица** отображает изменения в столбцах, где каждый столбец представляет один анимируемый параметр, а в каждой строке отображается значение параметра в каждом кадре.

source: Blank cells represent the absence of a change in a parameters value due to no keyframes being defined.
ru: Пустые ячейки представляют собой отсутствие изменения значения параметров из-за отсутствия определяемых ключевых кадров.

source: The **Graph Editor** displays changes as curves in a graph, where frames are laid horizontally and values are laid vertically.
ru: **Редактор графиков** отображает изменения в виде кривых на графике, где кадры располагаются горизонтально, а значения - вертикально.

source: Keyframes are represented as points and the interpolated values between them are visualized as red lines.
ru: Ключевые кадры представлены в виде точек, а интерполированные значения между ними отображаются в виде красных линий.

source: The spreadsheet's columns and the graph editor's curves are different representations of the same data, so any changes made in one view are also reflected in the other.
ru: Столбцы электронной таблицы и кривые редактора графиков представляют собой разные представления одних и тех же данных, поэтому любые изменения, сделанные в одном представлении, также отражаются в другом.

source: Using the Function Editor
ru: Использование редактора функций

source: The function editor window is divided into three sections. On the left there is an area where the Spreadsheet or Graph Editor is displayed, on the right top is an area where the interpolation of the current transformation segment is displayed, and on the right bottom is the objects/effects tree.
ru: Окно редактора функций разделено на три раздела. Слева находится область, где отображается электронная таблица или редактор графиков, справа вверху - область, где отображается интерполяция текущего сегмента преобразования, а справа внизу - дерево объектов/эффектов.

source: The tree has two main item folders, *Stage* and *FX*: in the first you can find folders for the defined cameras, the table, used pegbars and columns; in the second one you can find folders for each used effect. Each folder contains the related transformation parameters.
ru: В дереве есть две основные папки элементов, *Сцена* и *FX*: в первой вы можете найти папки для определенных камер, таблицы, используемых штифтов и столбцов; во втором вы можете найти папки для каждого используемого эффекта. Каждая папка содержит связанные параметры преобразования.

source: The objects/effects tree tells if the object/effect is animated and which parameter is animated, by using the following icons:
ru: Дерево объектов/эффектов сообщает, является ли объект/эффект анимированным и какой параметр анимирован, используя следующие значки:

source: A plain folder is for non-animated objects/effects.
ru: Простая папка для неанимированных объектов/эффектов.

source: A folder with an arrow is for animated objects/effects.
ru: Папка со стрелкой предназначена для анимированных объектов/эффектов.

source: An icon with a dotted straight line is for non-animated parameters.
ru: Значок с пунктирной прямой линией предназначен для неанимированных параметров.

source: An icon with a continuos curve is for animated parameters.
ru: Значок с непрерывной кривой для анимированных параметров.

source: Clicking these icons allows you to select which object/effect and which parameters have to be displayed as a spreadsheet or curves in the area on the left.
ru: Щелкнув по этим значкам, вы можете выбрать, какой объект/эффект и какие параметры должны отображаться в виде электронной таблицы или кривых в области слева.

source: Transformation data can be saved and loaded as a CURVE file, to allow the exporting and importing from one scene to another, and they can be exported as well as a DAT file in order to be used in other software.
ru: Данные преобразования могут быть сохранены и загружены в виде файла CURVE, чтобы разрешить экспорт и импорт из одной сцены в другую, и их можно экспортировать, а также файл DAT для использования в другом программном обеспечении.

source: **To resize the Function Editor sections:**
ru: **Чтобы изменить размер разделов редактора функций:**

source: Do any of the following:
ru: Выполните любое из следующих действий:

source: Click and drag the separators to resize sections.
ru: Нажмите и перетащите разделители, чтобы изменить размер разделов.

source: Click and drag a separator toward the window border to hide a section.
ru: Нажмите и перетащите разделитель к границе окна, чтобы скрыть раздел.

source: Click and drag the separator collapsed to the window border toward the window center to display again the hidden section.
ru: Щелкните и перетащите разделитель, свернутый к границе окна, к центру окна, чтобы снова отобразить скрытый раздел.

source: **To display or hide column parameters:**
ru: **Чтобы отобразить или скрыть параметры столбцов:**

source: Retrieve the object or the effect in the objects/effect tree.
ru: Получить объект или эффект в дереве объектов/эффектов.

source: Do one of the following:
ru: Выполните одно из следующих действий:

source: Click the folder to display or hide all columns or curves related to its parameters.
ru: Нажмите на папку, чтобы отобразить или скрыть все столбцы или кривые, связанные с ее параметрами.

source: Click the parameter icon to display or hide its related column or curve.
ru: Щелкните значок параметра, чтобы отобразить или скрыть связанный столбец или кривую.

source: Click a parameter icon and drag to display or hide all the columns or curves you pass upon.
ru: Щелкните значок параметра и перетащите, чтобы отобразить или скрыть все столбцы или кривые, по которым вы проходите.

source: Right-click the folder and choose **Show Animated Only** from the menu that opens to display or hide only the animated columns or curves related to its parameters.
ru: Щелкните правой кнопкой мыши папку и выберите **Показать только анимированные** в открывшемся меню, чтобы отобразить или скрыть только анимированные столбцы или кривые, связанные с ее параметрами.

source: Right-click the folder and choose **Show All** from the menu that opens to display or hide all columns or curves related to its parameters.
ru: Щелкните правой кнопкой мыши папку и выберите **Показать все** в открывшемся меню, чтобы отобразить или скрыть все столбцы или кривые, связанные с ее параметрами.

source: **To open the Graph Editor in a separate window:**
ru: **Чтобы открыть редактор графиков в отдельном окне:**

source: Make sure the option **Graph Editor Opens in Popup** is selected from the **Function Editor:** dropdown menu, in the Preferences → Interface window. (Restart OpenToonz).
ru: Убедитесь, что параметр **Редактор графиков, открывающийся во всплывающем окне**, выбран в раскрывающемся меню **Редактор функций:** в окне Настройки программы → Интерфейс. (Перезапустите OpenToonz).

source: Click the **Function Editor Toggle** button (|schematic|) in the top bar of the Function Editor.
ru: Нажмите кнопку **Переключатель редактора функций** (|schematic|) в верхней панели Редактора функций.

source: **To open the Spreadsheet in a separate window:**
ru: **Чтобы открыть электронную таблицу в отдельном окне:**

source: Make sure the option **Spreadsheet Opens in Popup** is selected from the **Function Editor:** dropdown menu, in the Preferences → Interface window. (Restart OpenToonz).
ru: Убедитесь, что в раскрывающемся меню **Редактор функций:** в меню Настройки программы → Интерфейс выбран параметр **Электронная таблица откроется во всплывающем окне**. (Перезапустите OpenToonz).

source: **To switch between Spreadsheet and Graph Editor in the Function Editor:**
ru: **Для переключения между электронной таблицей и редактором графиков в редакторе функций:**

source: Make sure the option **Toggle Between Graph Editor and Spreadsheet** is selected from the **Function Editor:** dropdown menu, in the Preferences → Interface window. (Restart OpenToonz).
ru: Убедитесь, что опция **Переключение между редактором графиков и электронной таблицей** выбрана в раскрывающемся меню **Редактор функций:** в окне Настройки программы → Интерфейс. (Перезапустите OpenToonz).

source: **To scroll the Spreadsheet:**
ru: **Для прокрутки таблицы:**

source: Middle-click and drag to scroll in any direction.
ru: Нажмите среднюю кнопку мыши и перетащите, чтобы прокрутить в любом направлении.

source: Use the mouse wheel to scroll up or down.
ru: Используйте колесо мыши для прокрутки вверх или вниз.

source: Use the scrolling bars to scroll only within the actual spreadsheet extent.
ru: Используйте полосы прокрутки для прокрутки только в пределах фактического экстента электронной таблицы.

source: Use the Up Arrow and Down Arrow keys to move one frame up or down.
ru: Используйте клавиши со стрелками вверх и вниз для перемещения на один кадр вверх или вниз.

source: Use the Page Up and Page Down keys to scroll the visible frames up or down.
ru: Используйте клавиши Page Up и Page Down для прокрутки видимых кадров вверх или вниз.

source: Use the Home and End keys to scroll up to the beginning or the end of the Xsheet/Timeline content.
ru: Используйте клавиши Home и End для прокрутки вверх до начала или конца содержимого Xsheet/Timeline.

source: **To navigate the Graph Editor:**
ru: **Для навигации в редакторе графиков:**

source: Use the mouse wheel, or the zoom shortcut keys (by default **+** and **-** keys) to zoom in and zoom out.
ru: Используйте колесико мыши или сочетания клавиш увеличения (по умолчанию клавиши **+** и **-**) для увеличения или уменьшения масштаба.

source: Click in the horizontal ruler and drag up to zoom in horizontally, down to zoom out; click in the value vertical ruler and drag up to zoom in vertically, down to zoom out.
ru: Нажмите на горизонтальную линейку и перетащите вверх, чтобы увеличить по горизонтали, вниз, чтобы уменьшить; щелкните по значению вертикальной линейки и перетащите вверх, чтобы увеличить по вертикали, вниз, чтобы уменьшить.

source: Middle-click and drag the graph area to scroll in any direction, the horizontal ruler to scroll horizontally, and the vertical ruler to scroll vertically.
ru: Нажмите среднюю кнопку мыши и перетащите область графика для прокрутки в любом направлении, горизонтальную линейку для горизонтальной прокрутки и вертикальную линейку для вертикальной прокрутки.

source: Use the reset view shortcut (by default the **Alt + 0** key) or right-click the graph area and choose Fit from the menu that opens, to display all the visible curves in the current Function Curve Editor window.
ru: Используйте сочетание клавиш для сброса (по умолчанию клавиши **Alt + 0**) или щелкните правой кнопкой мыши область графика и выберите Подогнать в открывшемся меню, чтобы отобразить все видимые кривые в текущем окне редактора функциональных кривых.

source: **To save transformation data:**
ru: **Для сохранения данных трансформации:**

source: Right-click the relevant parameter in the objects/effects tree, and choose **Save Curve** from the menu that opens.
ru: Щелкните правой кнопкой мыши соответствующий параметр в дереве объектов/эффектов и выберите **Сохранить кривую** в открывшемся меню.

source: Use the Browser to choose a name and location for the file to be saved: the data will be saved as a CURVE file.
ru: Используйте Браузер, чтобы выбрать имя и местоположение файла для сохранения: данные будут сохранены в виде файла CURVE.

source: **To load transformation data:**
ru: **Чтобы загрузить данные преобразования:**

source: Right-click the relevant parameter in the objects/effects tree, and choose **Load Curve** from the menu that opens.
ru: Щелкните правой кнопкой мыши соответствующий параметр в дереве объектов/эффектов и выберите **Загрузить кривую** в открывшемся меню.

source: Use the Browser to retrieve the curve to load; valid files are in CURVE format.
ru: Используйте браузер, чтобы получить кривую для загрузки; допустимые файлы в формате CURVE.

source: **To export transformation data:**
ru: **Чтобы экспортировать данные преобразований:**

source: Right-click the relevant parameter in the objects and effects tree, and choose **Export Data** from the menu that opens.
ru: Щелкните правой кнопкой мыши соответствующий параметр в дереве объектов и эффектов и выберите **Экспорт данных** в открывшемся меню.

source: Use the Browser to choose a name and location for the file to be saved: the data will be saved as a DAT file that can be used in other software supporting this type of information.
ru: Используйте Браузер, чтобы выбрать имя и местоположение для файла, который будет сохранен: данные будут сохранены как файл DAT, который может использоваться в другом программном обеспечении, поддерживающем этот тип данных.

source: Defining keyframes
ru: Определение ключевых кадров

source: Keyframes, including those belonging to object transformations done by using the **Animate** tool (|animate|) and those defined for effects parameters in the **FX Settings** window, can be controlled and edited both using the Spreadsheet's numerical columns and the Graph Editor's curves (see :ref:`Animating Objects <animating_objects>` and :ref:`Editing FX Settings <editing_fx_settings>` ).
ru: Ключевые кадры, включая те, которые относятся к преобразованиям объектов, выполненным с помощью инструмента **Анимирования** (|animate|), и те, которые определены для параметров эффектов в окне **FX Settings**, можно контролировать и редактировать как с помощью числовых столбцов электронной таблицы и кривые редактора графиков (см. :ref:`Анимация объектов <animating_objects>` и :ref:`Редактирование FX Settings <editing_fx_settings>`).

source: In the Spreadsheet, keyframes are displayed as orange cells; in the Graph Editor, keyframes are represented as control points along the curve. In both cases they can be added, edited, moved and deleted.
ru: В электронной таблице ключевые кадры отображаются в виде оранжевых ячеек; в редакторе графиков ключевые кадры представлены в виде контрольных точек на кривой. В обоих случаях их можно добавлять, редактировать, перемещать и удалять.

source: Using the Spreadsheet
ru: Использование электронной таблицы

source: The Spreadsheet displays transformations in columns like the ones available in the Xsheet/Timeline, having one for each parameter. For each frame, the column's cells display the related transformation values.
ru: В электронной таблице отображаются преобразования в столбцах, подобные тем, которые доступны на Xsheet/Timeline, по одному для каждого параметра. Для каждого кадра в ячейках столбца отображаются соответствующие значения преобразования.

source: Keyframes are displayed in different-colored cells, and can be moved along the column to different frames positions. In-between values are automatically generated according to the keyframes and to the set interpolation (see :ref:`Setting Segment Interpolations <setting_segment_interpolations>` ).
ru: Ключевые кадры отображаются в разноцветных ячейках и могут перемещаться вдоль столбца в разные позиции кадров. Промежуточные значения автоматически генерируются в соответствии с ключевыми кадрами и установленной интерполяцией (см. :ref:`Настройка интерполяции сегментов <setting_segment_interpolations>`).

source: All the columns referring to the same object or effects are grouped under one single header. For example under a pegbar header you can find all the columns referring to its transformations.
ru: Все столбцы, относящиеся к одному и тому же объекту или эффектам, сгруппированы в один заголовок. Например, под заголовком штифта вы можете найти все столбцы, относящиеся к его преобразованиям.

source: Columns cells can be used to type in directly values for keys, edit or move them. Values contained in cells can be cut, copied and pasted, so that transformations can be displaced, repeated and deleted.
ru: Ячейки столбцов можно использовать для непосредственного ввода значений ключей, их редактирования или перемещения. Значения, содержащиеся в ячейках, могут быть вырезаны, скопированы и вставлены, так что преобразования могут быть смещены, повторены и удалены.

source: **To define keyframes directly in Spreadsheet columns:**
ru: **Чтобы определить ключевые кадры непосредственно в столбцах электронной таблицы:**

source: Double click in the column cell where you want to define a keyframe: the cell becomes editable.
ru: Дважды щелкните ячейку столбца, в которой вы хотите определить ключевой кадр: ячейка станет редактируемой.

source: Type in the value for the key, and press **Enter** to confirm.
ru: Введите значение для клавиши и нажмите **Enter** для подтверждения.

source: **To move a keyframe:**
ru: **Чтобы переместить ключевой кадр:**

source: Click the *vertical strip* at the left of a keyframe cell, and drag it up or down to the new position; the in-between values change accordingly.
ru: Нажмите на *вертикальную полосу* слева от ячейки ключевого кадра и перетащите ее вверх или вниз на новую позицию; промежуточные значения изменяются соответственно.

source: **To displace the channel along the column:**
ru: **Чтобы сместить канал вдоль столбца:**

source: Click the *vertical strip* at the left of the selected column cells, and drag it up or down to the new position: the content of the segments completely included in the selection will move along the column.
ru: Нажмите *вертикальную полосу* слева от выбранных ячеек столбца и перетащите ее вверх или вниз на новую позицию: содержимое сегментов, полностью включенных в выделение, будет перемещаться вдоль столбца.

source: **To copy/cut and paste column values:**
ru: **Чтобы скопировать/вырезать и вставить значения столбца:**

source: Click and drag to perform a selection; the selection can be extended to several columns.
ru: Нажмите и перетащите, чтобы выполнить выделение; выделение может быть расширено до нескольких столбцов.

source: Use the **Copy** command: the selection will be kept in memory for further operations.
ru: Используйте команду **Копировать**: выделение будет сохранено в памяти для дальнейших операций.

source: Use the **Cut** command: the selection will be removed from the columns and will be kept in memory for further operations. The cells removal causes the following cells to shift up.
ru: Используйте команду **Вырезать**: выделение будет удалена из столбцов и будет сохранена в памяти для дальнейших операций. Удаление ячеек вызывает сдвиг следующих ячеек вверх.

source: Use the **Paste** command: the selection kept in memory will be pasted starting from the selected insertion cell. The command causes the following cells to shift down.
ru: Используйте команду **Вставить**: сохраненное в памяти выделение будет вставлено, начиная с выбранной ячейки вставки. Команда вызывает смещение следующих ячеек вниз.

source: Use the **Delete** command: selected cells will be deleted, causing the following cells to shift up.
ru: Используйте команду **Удалить**: выбранные ячейки будут удалены, в результате чего следующие ячейки сместятся вверх.

source: Using the Graph Editor
ru: Использование редактора графиков

source: The Graph Editor displays transformations as curves in a graph where *time* is laid horizontally, and parameter *values* are laid vertically.
ru: Редактор графиков отображает преобразования в виде кривых на графике, где *время* располагается горизонтально, а значения параметра *значения* располагаются вертикально.

source: Curves are defined by control points representing keyframes. Points can be easily added by working directly in the graph or using the **Set Key** button (|key|) in the top bar of the **Function Editor**.
ru: Кривые определяются контрольными точками, представляющими ключевые кадры. Точки можно легко добавлять, работая непосредственно на графике или используя кнопку **Установить ключ** (|key|) в верхней панели **Редактора функций**.

source: Control points can also be selected in order to be edited, moved or deleted.
ru: Контрольные точки также могут быть выбраны для редактирования, перемещения или удаления.

source: The **Set Key** button (|key|) is either *grey* when no keyframe is defined for the current curve at the current frame, or *blue* when a keyframe is defined for the current curve at the current frame.
ru: Кнопка **Установить ключ** (|key|) либо *серого* цвета, если для текущей кривой в текущем кадре не определен ключевой кадр, либо *синего*, если для текущей кривой в текущем кадре определен ключевой кадр.

source: Frames and keyframes can be navigated by using the related buttons in the top bar of the editor. The **Next Key** (|next_key|) and **Previous Key** buttons (|prevkey|) are available only if more than one keyframe is defined.
ru: Кадры и ключевые кадры можно перемещать с помощью соответствующих кнопок в верхней панели редактора. Кнопки **Следующий ключ** (|next_key|) и **Предыдущий ключ** (|prevkey|) доступны, только если определено более одного ключевого кадра.

source: **To set the current curve:**
ru: **Чтобы установить текущую кривую:**

source: Click the related parameter name in the objects/effects tree.
ru: Щелкните по имени соответствующего параметра в дереве объектов/эффектов.

source: Display the curve in the Graph Editor, then click to select it.
ru: Отобразите кривую в Редакторе графиков, затем щелкните, чтобы выбрать ее.

source: **To set the current frame:**
ru: **Чтобы установить текущий кадр:**

source: Click in the frame horizontal ruler to set a position for the current frame marker.
ru: Нажмите на горизонтальную линейку рамки, чтобы установить позицию для текущего маркера кадров.

source: Click and drag the current frame marker in a horizontal direction.
ru: Нажмите и перетащите маркер текущего кадра в горизонтальном направлении.

source: Type the frame number in the **Frame** text box, or use the **Next Frame** and **Previous Frame** buttons available in the top bar of the editor.
ru: Введите номер кадра в текстовом поле **Кадр** или используйте кнопки **Следующий кадр** и **Предыдущий кадр**, доступные в верхней панели редактора.

source: Move the current frame cursor in the Xsheet/Timeline.
ru: Переместите курсор текущего кадра в Xsheet/Timeline.

source: Use the frame bar or the playback buttons in the bottom bar of the main viewer.
ru: Используйте панель кадров или кнопки воспроизведения в нижней панели основного окна просмотра.

source: **To add a keyframe:**
ru: **Чтобы добавить ключевой кадр:**

source: Click the **Set Key** button (|key|) to add a keyframe at the current frame.
ru: Нажмите кнопку **Установить ключ** (|key|), чтобы добавить ключевой кадр в текущем кадре.

source: Type a value in the **Value** text box to add a keyframe at the current frame.
ru: Введите значение в текстовое поле **Значение**, чтобы добавить ключевой кадр в текущем кадре.

source: Right-click and choose **Set Key** from the menu that opens.
ru: Щелкните правой кнопкой мыши и выберите **Установить ключ** в открывшемся меню.
