Repository: Savraska2/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/painting_animation_levels.po
Languages: ru

source: Some other times you may need to merge two or several animation levels into a single one, or automatically add the same drawing on all of the drawings of an animation level, for example a line closing the drawing areas that fall outside the shot and that the animator left open.
ru: В некоторых других случаях вам может понадобиться объединить два или несколько уровней анимации в один или автоматически добавить один и тот же чертеж на все чертежи уровня анимации, например, линию, закрывающую области рисования, которые выходят за пределы кадра, и что Аниматор оставлен открытым.

source: In both cases you can use the match lines feature to achieve your tasks, as it allows you to merge the levels exposed in two columns/layers, and if needed to delete the merged match lines.
ru: В обоих случаях вы можете использовать функцию линий соответствия для выполнения ваших задач, так как она позволяет объединять уровни, представленные в двух столбцах/слоях, и при необходимости удалять объединенные линии соответствия.

source: Match lines can only be applied to Toonz Raster (TLV) animation levels.
ru: Разделительные линии могут применяться только к уровням анимации Toonz Raster (TLV).

source: In the Xsheet, when two columns are merged, the column drawings on the right are considered as match lines applied to the drawings on the left (in the Timeline, when two layers are merged, the layer drawings on top are considered as match lines applied to the drawings on the bottom).
ru: В Xsheet при объединении двух столбцов рисунки столбцов справа рассматриваются как разделительные линии, примененные к рисункам слева (на Timeline при объединении двух слоев чертежи слоев сверху рассматриваются как примененные разделительные линии к рисункам внизу).

source: In both cases it's possible to define the following:
ru: В обоих случаях можно определить следующее:

source: **Add Match Line Inks** preserves the original match line styles and adds them to the destination level palette in a separate page named **match lines**.
ru: **Добавить цвет разделительных линий** сохраняет исходные стили линий соответствия и добавляет их в палитру целевого уровня на отдельной странице с именем **разделительных линий**.

source: **Use Ink:** allows you to define which style, among those in the destination level palette, has to be used for the applied match lines, replacing any original styles the match lines may be painted with.
ru: **Использовать цвет:** позволяет вам определить, какой из стилей в палитре целевого уровня должен использоваться для применяемых разделительных линий, заменяя любые оригинальные стили, которыми могут быть окрашены разделительные линии.

source: **Merge Inks** if the target level has the same styles (i.e. with the same index and color) as the match lines inks, the existing styles will be used. Otherwise, the original match line styles will be preserved and added to the destination level palette in a separate page named **match lines**.
ru: **Слить цвета** если целевой уровень имеет те же стили (т.е. с тем же индексом и цветом), что и цвета разделительных линий, будут использоваться существующие стили. В противном случае исходные стили разделительных линий будут сохранены и добавлены в палитру целевого уровня на отдельной странице с именем **разделительных линий**.

source: **Line Stacking Order** let you graphically select which of the two columns (left or right) will be drawn on top, and also how to merge them: **Keep Halftones** or **Fill Gaps**
ru: **Порядок переркрытия линий** позволяет вам графически выбрать, какой из двух столбцов (левый или правый) будет нарисован сверху, а также как объединить их: **Держать полутон** или **Заполнить Пробелы**

source: **Line Prevalence** sets whether the match lines have to be placed behind the lines of the destination level (value set to 0), or on top of them (value set to 100).
ru: **Распространение линий** устанавливает, должны ли разделительные линии располагаться позади линий целевого уровня (значение установлено на 0) или поверх них (значение установлено на 100).

source: When the **Line Prevalence** value is set to 0, the match lines are applied without modifying the lines in the destination level at all.
ru: Когда значение **Распространение линий** установлено равным 0, разделительные линии применяются без изменения линий на уровне назначения вообще.

source: When the match lines are applied, any geometrical transformation achieved by editing and moving the related column/layer or pegbar, will be retained.
ru: При применении разделительных линий любое геометрическое преобразование, достигнутое путем редактирования и перемещения соответствующего столбца/слоя или pegbar будет сохранено.

source: Match lines are associated to the animation level drawings according to the following guidelines:
ru: Разделительные линии связаны с рисунками уровня анимации в соответствии со следующими рекомендациями:

source: The Xsheet/Timeline frame numbering order is followed. This means that the match line drawing exposed at frame 1 will be applied to the animation drawing exposed at frame 1.
ru: Порядок нумерации кадров Xsheet/Timeline соблюдается. Это означает, что рисунок разделительной линии, экспонированный в кадре 1, будет применен к анимационному рисунку, экспонированному в кадре 1.

source: If two different match line drawings are associated to the same drawing of the animation level at different frames, only the first one (according to the frame numbering order) will be applied.
ru: Если два разных рисунка разделительных линий связаны с одним и тем же рисунком уровня анимации в разных кадрах, будет применяться только первый (в соответствии с порядком нумерации кадров).

source: For all the drawings not corresponding to any match line drawing, no match lines will be applied.
ru: Для всех рисунков, не соответствующих ни одной из разделительных линий, разделительные линии не применяются.

source: Match lines not corresponding to any drawing will be ignored.
ru: Разделительные линии, не соответствующие ни одному рисунку, будут игнорироваться.

source: If several animation levels are exposed in the column/layer to which match lines have to be applied, only the first one (according to the frame numbering order) will be considered.
ru: Если в столбце/слое, к которому должны быть применены разделительные линии, выставлено несколько уровней анимации, будет рассматриваться только первый (в соответствии с порядком нумерации кадров).

source: If several animation levels are exposed in the column used as match line, all of them will be applied.
ru: Если в столбце, используемом в качестве разделительной линии, отображается несколько уровней анимации, все они будут применены.

source: Several match lines can be added to the same animation level, by applying them one at a time.
ru: Несколько разделительных линий могут быть добавлены к одному и тому же уровню анимации, применяя их по одной за раз.

source: Applied match lines can be deleted as a whole from the destination level, or it is possible to delete specific lines according to their style indexes.
ru: Применяемые разделительные линии могут быть удалены целиком с целевого уровня, либо можно удалить определенные линии в соответствии с их индексами стилей.

source: **To apply match lines to an animation level:**
ru: **Чтобы применить разделительные линии к уровню анимации:**

source: Expose in a column/layer the level you want to apply the match lines to.
ru: Выставьте в столбце/слое уровень, к которому вы хотите применить линии соответствия.

source: Expose the match line animation level(s) in another column of the Xsheet, to the right of the previous one (or if using the Timeline, expose the match line animation level(s) in another layer, above the previous one).
ru: Расположите уровни анимации разделительные линии в другом столбце таблицы Xsheet справа от предыдущего (или, если используется Timeline, откройте уровни анимации разделительные линии в другом слое выше предыдущего).

source: Move, scale, rotate the match line drawings if needed.
ru: Перемещайте, масштабируйте, поворачивайте рисунки разделительных линий, если это необходимо.

source: Select the two columns by shift-clicking or click-draging their headers.
ru: Выделите два столбца, кликая с зажатой Shift или перетаскивая их заголовки.

source: Choose Xsheet → **Apply Match Lines...**
ru: Выберите пункт меню Xsheet → **Применить разделительные линии...**

source: In the dialog that opens choose the styles to be used for the match lines and the line prevalence, and click the Apply button.
ru: В открывшемся диалоговом окне выберите стили, которые будут использоваться для разделительных линий и распространенности линий, и нажмите кнопку Применить.

source: **To delete all applied match lines:**
ru: **Чтобы удалить все примененные разделительные линии:**

source: Select the columns/layers, the cells, or the Level Strip frames where the animation level with the applied match lines is.
ru: Выберите столбцы/слои, ячейки или кадры Level Strip, где находится уровень анимации с примененными разделительными линиями.

source: Choose Xsheet → **Delete Match Lines**.
ru: Выберите пункт меню Xsheet → **Удалить разделительные линии**.

source: **To delete lines by selecting the style index:**
ru: **Чтобы удалить линии выбрав индекс стиля:**

source: Select the columns/layers, the cells, or the Level Strip frames where the animation level whose lines you want to delete is.
ru: Выберите столбцы/слои, ячейки или кадры Level Strip, где находится уровень анимации, линии которого вы хотите удалить.

source: Choose Xsheet → **Delete Lines...**
ru: Выберите Xsheet → **Удалить линии...**

source: In the dialog that opens choose the indexes of the styles used for lines you want to delete, and the frames where you want to apply the deletion.
ru: В открывшемся диалоговом окне выберите индексы стилей, используемых для линий, которые вы хотите удалить, и кадры, к которым вы хотите применить удаление.

source: Click the Delete button.
ru: Нажмите кнопку Удалить.

source: To specify multiple indexes or frames, values have to be separated by a comma; to define a range of values, you can type the first and the last separated by a dash (e.g. 4-7 will refer to values 4, 5, 6 and 7).
ru: Чтобы указать несколько индексов или кадров, значения должны быть разделены запятой; чтобы определить диапазон значений, вы можете ввести первое и последнее, разделенные тире (например, 4-7 относятся к значениям 4, 5, 6 и 7).

source: Using the Autopaint for Lines Option
ru: Использование опции Автозаливка линий

source: Toonz Raster levels may include colored lines coming from a color cleanup session, or from some applied match line levels (see :ref:`Processing Colored Lineart Drawings <processing_colored_lineart_drawings>` and :ref:`Using Match Lines <using_match_lines>` for details).
ru: Уровни Toonz Raster могут включать в себя цветные линии, поступающие из сеанса очистки цвета или из некоторых примененных уровней разделительных линий (подробности см. в разделе :ref:`Обработка цветных рисунков линейных линий <processing_colored_lineart_drawings>` и :ref:`Использование разделительных линий <using_match_lines>`).

source: In most of the cases these colored lines are meant to set the outline of the body shadow, or body highlight, and for this reason usually they have to be painted with the same color of the shadow or highlight areas they help define.
ru: В большинстве случаев эти цветные линии предназначены для установки контура тени тела или подсветки тела, и по этой причине обычно они должны быть окрашены в тот же цвет тени или областей подсветки, которые они помогают определить.

source: This task can be performed automatically by setting a special property for the color, so that when you paint an area defined totally or partially by a line whose color has this property, the line is automatically painted with the same color you use for the area.
ru: Эту задачу можно выполнить автоматически, установив специальное свойство для цвета, чтобы при рисовании области, определенной полностью или частично линией, цвет которой имеет это свойство, линия автоматически закрашивается тем же цветом, который вы используете для этой области.

source: **To set the autopaint property for a color:**
ru: **Чтобы установить свойство автозаливки для цвета:**

source: Select the color in the palette.
ru: Выберите цвет в палитре.

source: In the Style Editor select the Settings page and activate the **Autopaint for Lines** option.
ru: В редакторе стилей выберите страницу настроек и активируйте опцию **Автозаливка линий**.

source: **To automatically paint lines when painting areas:**
ru: **Чтобы автоматически закрашивать линии при рисовании областей:**

source: Paint an area defined totally or partially by a line whose color has the **Autopaint for Lines** option activated: the line is automatically painted with the same color you use for the area.
ru: Нарисуйте область, определенную полностью или частично линией, цвет которой включает опцию **Автозаливка линий**: линия автоматически закрашивается тем же цветом, который вы используете для этой области.

source: Using a Color Model
ru: Использование цветовой модели

source: Color models, usually created for accurate color-referencing during a production, in the form of images or animation levels, can be used while painting animation levels.
ru: Цветовые модели, обычно создаваемые для точной цветовой привязки во время производства, в виде изображений или уровней анимации, могут использоваться при рисовании уровней анимации.

source: Any image or animation level can be used as a reference by loading it in the Color Model viewer. In case an animation level is loaded, you can select any frame as a reference at any moment; in this way you can also create color models made of several drawings, for example one drawing for the Front view of the character, and one for the Back view.
ru: Любое изображение или уровень анимации можно использовать в качестве образца, загрузив его во окно просмотра цветовой модели. Если загружен уровень анимации, вы можете в любой момент выбрать любой кадр в качестве образца; таким образом, вы также можете создавать цветовые модели из нескольких рисунков, например, один рисунок для вида персонажа спереди и один для вида сзади.

source: When a color model is loaded for the current level, you can decide to load its palette, thus overwriting the current level palette, or to keep the current animation level palette.
ru: Когда цветовая модель загружается для текущего уровня, вы можете решить загрузить ее палитру, перезаписав, таким образом, палитру текущего уровня или сохранить текущую палитру уровней анимации.

source: If the color model is a Toonz Raster or Vector level (TLV or PLI file), it already comes with a palette, whose style names and page configuration will be preserved.
ru: Если цветовая модель имеет уровень Toonz Raster или Vector (файл TLV или PLI), она уже поставляется с палитрой, чьи имена стилей и конфигурация страницы будут сохранены.

source: If the color model is a full-color Raster image or animation level, the palette is automatically generated by extracting colors from the image, or the first image of the level. If the full-color image contains many shaded colors, the palette will be optimized to reduce the number of colors.
ru: Если цветовая модель представляет собой полноцветное растровое изображение или уровень анимации, палитра автоматически создается путем извлечения цветов из изображения или первого изображения уровня. Если полноцветное изображение содержит много затененных цветов, палитра будет оптимизирована для уменьшения количества цветов.

source: Best results can be achieved by preparing models painted with flat colors and whose lines have no antialiasing.
ru: Наилучших результатов можно достичь, подготовив модели, окрашенные в плоские цвета, в линиях которых нет сглаживания.

source: When a color model is loaded for a certain animation level, it is associated to that level and the related palette, and it's displayed in the Color Model viewer every time that level is selected.
ru: Когда цветовая модель загружается для определенного уровня анимации, она ассоциируется с этим уровнем и соответствующей палитрой и отображается в окне просмотра цветовой модели при каждом выборе этого уровня.

source: A color model can be associated to palettes stored in the Studio Palette. In this way every time you assign a palette to an animation level retrieving it from the Studio Palette, its related color model will be automatically associated to the level (see :ref:`Using the Studio Palette <using_the_studio_palette>` for details).
ru: Цветовая модель может быть связана с палитрами, хранящимися в палитре Studio. Таким образом, каждый раз, когда вы назначаете палитру для уровня анимации, извлекая ее из палитры Studio, связанная с ней цветовая модель будет автоматически ассоциироваться с уровнем (подробности см. в разделе :ref:`Использование палитры Studio <using_the_studio_palette>`).

source: You can also use any drawing belonging to the animation level as a color model to be used on the fly, but in this case it will neither be associated to the level, nor to the palette saved in the Studio Palette.
ru: Вы также можете использовать любой рисунок, принадлежащий к уровню анимации, в качестве цветовой модели, которая будет использоваться на лету, но в этом случае он не будет связан ни с уровнем, ни с палитрой, сохраненной в палитре Studio.

source: When the image is displayed in the Color Model viewer, you can use it not only as visual reference, but also for picking styles with no need to use the Palette or the Style Picker tool (|style_picker|). The color model can also be panned and zoomed in or out, by using standard shortcuts.
ru: Когда изображение отображается в средстве просмотра Цветовой модели, вы можете использовать его не только в качестве визуальной справки, но и для выбора стилей без необходимости использовать инструмент Палитру или Пипетка (|style_picker|). Цветовая модель также может быть панорамирована и увеличена или уменьшена с помощью стандартных сочетаний клавиш.

source: **To load a color model:**
ru: **Чтобы загрузить цветовую модель:**

source: Choose File → **Load Color Model...**, and load the Toonz level or the full color raster image you want to use as a reference.
ru: Выберите пункт меню Файл → **Загрузить цветовую модель...** и загрузите уровень Toonz или полноцветное растровое изображение, которое вы хотите использовать в качестве образца.

source: **Right-click** in the Color Model viewer and choose **Load Color Model** from the menu that opens.
ru: **Щелкните правой кнопкой мыши** в окне просмотра цветовой модели и выберите **Загрузить цветовую модель** в открывшемся меню.

source: Drag and drop the Toonz level or the full color raster image you want to use as reference to the Color Model viewer.
ru: Перетащите уровень Toonz или полноцветное растровое изображение, которое вы хотите использовать в качестве образца на окно просмотра Цветовой модели.

source: Choose whether to overwrite current palette with the Color Model palette, or to keep the current animation level palette.
ru: Выберите, следует ли перезаписать текущую палитру с помощью палитры Цветовой модели или оставить текущую палитру уровня анимации.

source: If you decide to keep the current animation level palette, the current level palette will be applied to the Color Model as well.
ru: Если вы решите сохранить текущую палитру уровней анимации, палитра текущего уровня будет применена и к цветовой модели.

source: **To select a frame from the loaded color model level:**
ru: **Чтобы выбрать кадр из уровня загруженной цветовой модели:**

source: Use the playback buttons.
ru: Используйте кнопки воспроизведения.

source: Drag the frame bar cursor.
ru: Переместите ползунок полосы кадров.

source: Type in the frame bar field the number of the frame you want to view.
ru: Введите в поле панели кадров номер кадра, который вы хотите просмотреть.

source: **To pick styles from a color model:**
ru: **Чтобы выбрать стили из цветовой модели:**

source: Click the area or line whose style you want to pick, whatever your current tool is.
ru: Нажмите на область или линию, стиль которой вы хотите выбрать, независимо от того, какой у вас текущий инструмент.

source: If you are using a Raster image as reference and you decided to keep the current animation level palette, when you click an area or a line, the closest style available in the palette will be picked.
ru: Если вы используете растровое изображение в качестве образца и решили сохранить текущую палитру уровней анимации, при нажатии на область или линию будет выбран ближайший стиль, доступный в палитре.

source: **To navigate the color model viewer:**
ru: **Для навигации в окне просмотра цветовой модели:**

source: Use the zoom shortcut keys (by default + and - keys) to zoom in and zoom out at specific steps (e.g. 50%, 100%, 200%, etc.).
ru: Используйте горячие клавиши масштабирования (по умолчанию клавиши + и -), чтобы увеличивать и уменьшать масштаб с определенным шагом (например, 50%, 100%, 200% и т.д.).

source: Use the mouse wheel to zoom in and zoom out.
ru: Используйте колесико мыши для увеличения и уменьшения масштаба.

source: Use the Reset View shortcut (by default the 0 key), or right-click in the viewer and choose **Reset View** from the menu that opens, to display the flipbook content at its actual size, centered on the image center.
ru: Используйте горячую клавишу Вид по умолчанию (по умолчанию клавиша 0) или щелкните правой кнопкой мыши в окне просмотра и выберите **Вид по умолчанию** в открывшемся меню, чтобы отобразить содержание Flipbook в его реальном размере с центром в центре изображения.

source: Middle-click and drag to scroll in any direction.
ru: Нажмите среднюю кнопку мыши и перетащите, чтобы прокрутить в любом направлении.

source: **To create a color model from an original drawing:**
ru: **Чтобы создать цветовую модель из оригинального рисунка:**

source: Scan and cleanup, or draw, your color model.
ru: Отсканируйте и очищайте или нарисуйте вашу цветовую модель.

source: Create the needed styles in the palette and paint the image.
ru: Создайте требуемые стили в палитре и нарисуйте изображение.

source: Save the image and load it as color model whenever it is needed.
ru: Сохраните изображение и загрузите его в качестве цветовой модели всякий раз, когда это необходимо.

source: **To use a drawing from the current animation level as a model:**
ru: **Чтобы использовать рисунок из текущего уровня анимации в качестве модели:**

source: Select the drawing you want to use as a reference for the current animation level.
ru: Выберите рисунок, который вы хотите использовать в качестве образца для текущего уровня анимации.

source: Right-click in the Color Model viewer and choose **Use Current Frame** from the menu that opens.
ru: Щелкните правой кнопкой мыши в окне просмотра Цветовой модели и выберите **Использовать текущий кадр** в открывшемся меню.

source: **To store a color model together with a palette in the studio palette:**
ru: **Чтобы сохранить цветовую модель вместе с палитрой в Studio Palette:**

source: Load the color model to associate it to the current level palette.
ru: Загрузите цветовую модель, чтобы связать ее с палитрой текущего уровня.

source: Store the level palette in the Studio Palette (see :ref:`Using the Studio Palette <using_the_studio_palette>` for details).
ru: Сохраните палитру уровня в палитре Studio (подробности см. в разделе :ref:`Использование Studio Palette <using_the_studio_palette>`).

source: **To associate a color model to a palette already saved in the studio palette:**
ru: **Чтобы связать цветовую модель с палитрой, уже сохраненной в Studio Palette:**
