Repository: Savraska2/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/painting_animation_levels.po
Languages: ru

source: In the Studio Palette select the palette to which you want to associate a color model, and do one of the following:
ru: В палитре Studio выберите палитру, с которой вы хотите связать цветовую модель, и выполните одно из следующих действий:

source: Choose File → **Load Color Model...**.
ru: Выберите пункт меню Файл → **Загрузить цветовую модель...**.

source: Right-click the palette in the studio palette tree and choose **Load Color Model...** from the menu that opens (see :ref:`Using the Studio Palette <using_the_studio_palette>` for details).
ru: Щелкните правой кнопкой мыши палитру в дереве Studio Palette и выберите **Загрузить цветовую модель...** в открывшемся меню (подробности см. в разделе :ref:`Использование Studio Palette <using_the_studio_palette>`).

source: Retrieve the color model from the browser that opens.
ru: Получите цветовую модель из открывшегося браузера.

source: If the color model uses a palette different from the one stored in the Studio Palette, you will be prompted whether to keep it or to overwrite it.
ru: Если цветовая модель использует палитру, отличную от той, которая хранится в палитре Studio, вам будет предложено сохранить ее или перезаписать.

source: **To retrieve a color model stored in the studio palette:**
ru: **Чтобы получить цветовую модель, сохраненную в Studio Palette:**

source: Load the palette it's associated to from the Studio Palette as the current level palette (see :ref:`Using the Studio Palette <using_the_studio_palette>` for details).
ru: Загрузите палитру, с которой она связана, из палитры Studio в качестве палитры текущего уровня (подробности см. в разделе :ref:`Использование палитры Studio <using_the_studio_palette>`).

source: **To remove the association of a palette to a color model:**
ru: **Чтобы удалить связь палитры с цветовой моделью:**

source: Right-click in the Color Model viewer and choose **Remove Color Model** from the menu that opens.
ru: Щелкните правой кнопкой мыши в окне просмотра Цветовой модели и выберите **Удалить цветовую модель** в открывшемся меню.
