Repository: Savraska2/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/painting_animation_levels.po
Languages: ru

source: Painting Animation Levels
ru: Покраска уровней анимации

source: Toonz animation levels, both those cleaned up, and those made directly in OpenToonz, can be painted by using the styles, stored in the palette, and a set of tools.
ru: Уровни анимации Toonz, как очищенные, так и созданные непосредственно в OpenToonz, могут быть покрашены с использованием стилей, сохраненных в палитре, и набора инструментов.

source: All Toonz level drawings are made of **lines** (determined by the strokes of scanned or vector drawings), and **areas** defined by *closed lines*. Raster and vector lines can be painted or erased, partially or for their full extent; areas can be filled with styles, or remain empty, with complete transparency.
ru: Все рисунки уровней Toonz состоят из **линий** (определенных штрихами отсканированных или векторных рисунков) и **областей**, определенных *замкнутыми линиями*. Растровые и векторные линии могут быть закрашены или стерты, частично или полностью; области могут быть заполнены стилями или оставаться пустыми с полной прозрачностью.

source: All the painting work is not saved until you save the related level, or use the **Save All** command (see :ref:`Saving Levels <saving_levels>` ).
ru: Все работы по покраске не сохраняются до тех пор, пока вы не сохраните соответствующий уровень или не воспользуетесь командой **Сохранить все** (см. :ref:`Сохранение уровней <saving_levels>`).

source: If the computer performance worsens during the painting process of Toonz Raster animation levels, try activating the **Minimize Raster Memory Fragmentation** option in the Preferences → General dialog (see :ref:`Optimizing the Memory Usage <optimizing_the_memory_usage>` ).
ru: Если производительность компьютера ухудшается в процессе покраски уровней анимации Toonz Raster, попробуйте активировать параметр **Минимизировать фрагментацию памяти в растре** в диалоговом окне Настройки программы → Общие (см. :ref:`Оптимизация использования памяти <optimizing_the_memory_usage>`).

source: Painting Tools
ru: Инструменты покраски

source: Painting operations can be performed by using the **Fill** tool (|fill|) and the **Paint Brush** tool (|paint_brush|).
ru: Операции рисования можно выполнить с помощью инструмента **Заливки** (|fill|) и инструмента **Покраски** (|paint_brush|).

source: In case you want to retrieve a style already used in the drawing, you can pick it with the **Style Picker** tool (|style_picker|).
ru: Если вы хотите получить стиль, уже использующийся на рисунке, то вы можете выбрать его с помощью инструмента **Пипетка** (|style_picker|).

source: The filling operation can be performed by activating different options, that can be combined together to perform particular tasks, for example to fill several areas at the same time with the same style, or several frames, with a single operation.
ru: Операция заливки может быть выполнена путем активации различных опций, которые могут быть объединены вместе для выполнения конкретных задач, например, для одновременного заполнения нескольких областей одним и тем же стилем или нескольких кадров одной операцией.

source: The **Fill** tool (|fill|) allows you to paint a drawing area or line by clicking it. Options available are the following:
ru: Инструмент **Заливка** (|fill|) позволяет рисовать область или линию рисования, щелкая ее. Доступны следующие варианты:

source: **Type:** has the options **Normal**, to fill an area by clicking in it; **Rectangular**, to fill all the areas included in the box you define; **Freehand**, to fill all the areas included in the area you outline by clicking and dragging; and **Polyline**, to fill all the areas included in the area you outline by defining a series of lines.
ru: **Тип:** имеет параметры **Обычная**, чтобы заполнить область, нажав на нее; **Прямоугольная**, чтобы заполнить все области, включенные в поле, которое вы определяете; **От руки**, чтобы заполнить все области, включенные в область, которую вы обводите, нажав и перетащив; и **Полилиния**, чтобы заполнить все области, включенные в область, которую вы очерчиваете, определив серию линий.

source: **Mode:** has the options **Areas**, to fill only areas, **Lines**, to paint only the strokes, and **Lines and Areas**, to perform both operations.
ru: **Режим:** имеет параметры **Области**, чтобы заполнить только области, **Линии**, чтобы нарисовать только штрихи, и **Линии и области**, чтобы выполнить обе операции.

source: **Selective** prevents the fill operation to be performed on *already filled* areas.
ru: **Избирательно** предотвращает выполнение операции заполнения на *уже залитых* областях.

source: **Fill Depth** sets how much the fill style passes through the antialiasing of the area lines. With low values, even a very thin line made of semitransparent pixels will be effective to stop de filling operation; with high values, only the more opaque pixels will stop color from flooding outside. This option applies to Toonz Raster drawings only. It is possible to set two values: the minimum value is used when using the tool with the standard mouse **click**, the maximum value when using the tool with the **Shift-click**.
ru: **Глубина заливки** устанавливает, насколько стиль заливки проходит через сглаживание линий области. При низких значениях даже очень тонкая линия, состоящая из полупрозрачных пикселей, будет эффективной, чтобы остановить операцию заполнения; с высокими значениями, только более непрозрачные пиксели не позволят цвету затопить снаружи. Эта опция применяется только к чертежам Toonz Raster. Можно установить два значения: минимальное значение используется при использовании инструмента со стандартным **щелчком мыши**, максимальное значение при использовании инструмента с **зажатой клавишей Shift**.

source: **Segment** lets you apply the fill only to a segment of raster lines. A segment is determined by an abrupt change of *thickness* or *direction* in the stroke. This is available for Toonz Raster drawings only.
ru: **Сегмент** позволяет применять заливку только к сегменту растровых линий. Сегмент определяется резким изменением *толщины* или *направления* хода. Это доступно только для рисунков Toonz Raster.

source: **Onion Skin** lets you pick the style to use for the filling operation from other drawings, visible in onion skin mode, and apply it to the current drawing (see :ref:`Using Onion Skin <using_onion_skin>` ).
ru: **Калька** позволяет вам выбрать стиль, который будет использоваться для операции заливки из других рисунков, видимых в режиме кальки и применить его к текущему рисунку (см. :ref:`Применение кальки <using_onion_skin>`).

source: **Frame Range** allows you to perform the filling on a range of frames, by clicking in the first and then in the last frame of the range. You can also Shift-click to define the filling position for intermediate frames.
ru: **Диапазон кадров** позволяет выполнять заполнение диапазона кадров, щелкая первый, а затем последний кадр диапазона. Вы также можете нажать Shift, чтобы определить позицию заполнения для промежуточных кадров.

source: The **Paint Brush** tool (|paint_brush|) allows you to paint a drawing area or a line, as if you were using a brush. It is available for Toonz Raster drawings only. Options are the following:
ru: Инструмент **Покраски** (|paint_brush|) позволяет закрасить область рисования или линию как если бы вы использовали кисть. Он доступен только для рисунков Toonz Raster. Присутствуют следующие настройки:

source: **Size** sets the brush size.
ru: **Размер** устанавливает размер кисти.

source: **Mode:** has the options **Areas**, to paint only inside areas, **Lines**, to paint manually only the drawing lines, and **Lines and Areas**, to perform both operations.
ru: **Режим:** имеет опции **Области**, для рисования только внутри областей, **Линии**, для рисования вручную только линий рисования, и **Линии и области**, для выполнения обеих операций.

source: **Selective** prevents the painting operation to be performed on *already painted* areas.
ru: **Избирательно** предотвращает выполнение операции покраски на *уже окрашенных* участках.

source: Filling Areas
ru: Заливка областей

source: Areas can be filled when their outline is well-defined, with no gaps occurring along it. For vector drawings, the outline can be defined by a single vector with overlapping or joined ends, or by different vectors.
ru: Области могут быть заполнены когда их контур четко определен и вдоль них не должно быть пробелов. Для векторных рисунков контур может быть определен одним вектором с перекрывающимися или соединенными концами или разными векторами.

source: Options available for the painting tools can help you to speed up the painting job. You can decide which options are the most suitable for your task by following the guidelines below.
ru: Опции, доступные для инструментов покраски могут помочь вам ускорить работу покраски. Вы можете решить, какие варианты являются наиболее подходящими для вашей задачи, следуя приведенным ниже инструкциям.

source: In Toonz Raster levels, the areas that can be painted are limited either by the image border or by the image Savebox, according to the **Use the TLV Savebox to Limit Filling Operations** option available in Preferences → Tools.
ru: На уровнях Toonz Raster области, которые могут быть покрашены, ограничены либо границей изображения, либо изображением Savebox, в соответствии с параметром **Используйте команду «Сохранить в TLV» для ограничения заливки**, доступным в Настройках программы → Инструменты.

source: Some styles may not be suitable for filling areas, such as the **Trail** or **Vector** styles or some of the **Generated** styles. If you select one of these styles in the Palette, and you use it to fill an area, no operation will be performed.
ru: Некоторые стили могут не подходить для заполнения областей, например, стили **Хвост** или **Вектор** или некоторые стили **Сформирован**. Если вы выберете один из этих стилей в палитре и используете его для заполнения области, никакие операции выполняться не будут.

source: **To fill an area:**
ru: **Чтобы залить область:**

source: Select the **Fill** tool (|fill|), set the fill type to **Normal** and the mode to **Areas**, and select a style in the Palette.
ru: Выберите Инструмент **Заливки** (|fill|), установите тип заливки **Обычная**, а режим - **Области** и выберите стиль в палитре.

source: Click in the area you want to fill.
ru: Нажмите на область, которую вы хотите залить.

source: If the filling color doesn’t flood the narrowest areas in raster drawings because of semitransparent pixels, try to increase the minimum **Fill Depth** value, or **Shift-click** to use the maximum value (see :ref:`Painting Tools <painting_tools>` ).
ru: Если цвет заливки не заливает самые узкие области в растровых чертежах из-за полупрозрачных пикселов, попробуйте увеличить минимальное значение **Глубина заливки** или **кликнуть, зажав клавишу Shift**, чтобы использовать максимальное значение (см. :ref:`Инструменты покраски <painting_tools>`).

source: **To fill several frames with a single command:**
ru: **Чтобы покрасить несколько кадров одной командой:**

source: Select the **Fill** tool (|fill|), set the fill type to **Normal** and the mode to **Areas**, and activate the **Frame Range** option.
ru: Выберите инструмент **Заливки** (|fill|), установите тип заполнения на **Обычная**, а режим на **Области** и активируйте опцию **Диапазон кадров**.

source: Select the first frame of the range and **click** in the area you want to fill, for example the character’s face.
ru: Выберите первый кадр диапазона и **нажмите** по области, которую вы хотите заполнить, например, по лицу персонажа.

source: Do one of the following:
ru: Выполните одно из следующих действий:

source: Select the last frame of the range you want to apply the Fill to, and **click** in the same area, in the example the character’s face: the areas in all of the frames in the range will be automatically filled according to the first and second clicking positions.
ru: Выберите последний кадр диапазона, к которому вы хотите применить заливку, и **щелкните** по той же области, как в примере с лицом персонажа: области во всех кадрах в диапазоне будут автоматически заполнены в соответствии с первой и второй позицией нажатия.

source: Select an intermediate frame of the range you want to apply the Fill to, and **Shift-click** in the same area, in the example the character’s face: the areas in all of the frames in the range will be automatically filled according to the first and second clicking positions. Select another intermediate frame and **Shift-click** again: the areas in all of the frames in the new range will be automatically filled according to the second and third clicking positions. Do the same as many times as you like, then **click** in the same area on the last frame of the range to complete the multi frame filling mode.
ru: Выберите промежуточный кадр диапазона, к которому вы хотите применить заливку, и **кликните с нажатым Shift** в той же области, в примере с лицом персонажа: области во всех кадрах в диапазоне будут автоматически заполнены согласно первой и второй позиции нажатия. Выберите другой промежуточный кадр и снова **нажмите с нажатым Shift**: области во всех кадрах в новом диапазоне будут автоматически заполнены в соответствии со второй и третьей позициями щелчка. Сделайте столько раз, сколько вам требуется, затем **нажмите** в той же области в последнем кадре диапазона, чтобы завершить режим заполнения нескольких кадров.

source: Since the **Fill** with the **Frame Range** option is applied making a linear interpolation from the first clicking point to the following one, some painting mistakes may occur. The more the area you want to fill moves along the frame range, the more mistakes may be made.
ru: Поскольку применяется **Заливка** с параметром **Диапазон кадров**, делая линейную интерполяцию от первой точки щелчка до следующей, могут возникнуть некоторые ошибки рисования. Чем больше область, которую вы хотите заполнить, перемещается вдоль диапазона кадра, тем больше ошибок может быть сделано.

source: **To fill several areas at once with the same style:**
ru: **Чтобы заполнить несколько областей одновременно одним и тем же стилем:**

source: Select the **Fill** tool (|fill|), set the fill mode to **Areas**.
ru: Выберите инструмент **Заливки** (|fill|), установите режим заполнения на **Области**.

source: Set the type to **Rectangular** and click and drag to define a box: all the areas *completely included* in the box will be filled with the current style.
ru: Установите тип **Прямоугольный** и щелкните и перетащите, чтобы определить поле: все области *полностью включенные* в поле будут заполнены текущим стилем.

source: Set the type to **Freehand** and click and drag to outline an area: all the areas *completely included* in the area you outline will be filled with the current style. If the ends of the outline you draw are open, the area will be defined as if joining the two open ends.
ru: Установите тип **От руки** и нажмите и перетащите, чтобы обвести область: все области, *полностью включенные* в область, которую вы обрисовали, будут заполнены текущим стилем. Если концы нарисованного контура открыты, область будет определяться так, как если бы она соединяла два открытых конца.

source: Set the type to **Polyline** and click to outline an area by defining a series of lines: all the areas *completely included* in the area you outline will be filled with the current style. If the ends of the outline you draw are open, the area will be defined as if joining the two open ends.
ru: Установите тип **Полилиния** и щелкните, чтобы обвести область, определив серию линий: все области *полностью включенные* в области, которую вы наметите, будут заполнены текущим стилем. Если концы нарисованного контура открыты, область будет определяться так, как если бы она соединяла два открытых конца.

source: **To fill all remaining areas in a level drawing with the same style:**
ru: **Чтобы заполнить все оставшиеся области на рисунке уровня одним и тем же стилем:**

source: Select the **Fill** tool (|fill|), set the fill type to **Rectangular** and the mode to **Areas**, and activate the **Selective** option.
ru: Выберите Инструмент **Заливки** (|fill|), установите тип заливки **Прямоугольный** и режим **Области**, и активируйте опцию **Избирательно**.

source: **Click and drag** to define a box: all the outlined non-filled areas *completely included* in the box will be filled with the current style. This option combination may be useful if the drawing has a lot of areas to be painted with the same style, that can be painted at the end at once by using this command.
ru: **Нажмите и потяните**, чтобы задать поле: все выделенные незаполненные области *полностью включенные* в поле будут заполнены текущим стилем. Эта комбинация опций может быть полезна, если на рисунке много областей, которые должны быть окрашены в одном стиле, который можно покрасить в конце сразу с помощью этой команды.

source: You can add to this combination the **Frame Range** option as well, to perform the same task extended to a range of frames.
ru: Вы также можете добавить к этой комбинации параметр **Диапазон кадров**, чтобы выполнить ту же задачу, расширенную для диапазона кадров.

source: **To fill drawing areas using as reference a previously painted drawing:**
ru: **Чтобы залить области рисования, используя в качестве эталона заранее приготовленный рисунок:**

source: **Activate the onion skin** mode to display the painted drawing behind your current drawing (see :ref:`Using Onion Skin <using_onion_skin>` ).
ru: **Активируйте режим кальки**, чтобы отобразить нарисованный рисунок за текущим рисунком (см. :ref:`Использование кальки <using_onion_skin>`)

source: Select the **Fill** tool (|fill|), set the fill mode to **Areas** and activate the **Onion Skin** option.
ru: Выберите Инструмент **Заливка** (|fill|), установите режим заполнения на **Области** и активируйте опцию **Калька**.

source: **Click** to pick the style to use from the drawing displayed in onion skin mode.
ru: **Нажмите**, чтобы выбрать стиль для использования на рисунке, отображаемом в режиме кальки.

source: **Release** to fill the area where the cursor is.
ru: **Отпустите** кнопку мыши, чтобы заполнить область, где находится курсор.

source: **Drag** to the area you want to fill and **release** the mouse button.
ru: **Перетяните** в область, которую вы хотите заполнить и **отпустите** кнопку мыши.

source: If several drawings are displayed in onion skin mode, only the drawing closest to the current one will be considered.
ru: Если в режиме Кальки отображается несколько рисунков, будет рассматриваться только рисунок, ближайший к текущему.

source: **To automatically fill a whole drawing using as reference a previously painted drawing:**
ru: **Чтобы автоматически залить весь рисунок, используя в качестве ссылки ранее нарисованный изображение:**

source: Select the **Fill** tool (|fill|), set the fill type to **Rectangular**, the mode to **Areas**, and activate the **Onion Skin** option.
ru: Выберите инструмент **Заливки** (|fill|), установите тип заливки **Прямоугольный**, режим **Области** и активируйте опцию **Калька**.

source: **Click and drag** to define a box: all the areas *completely included* in the box will be filled with the styles picked from the painted areas of the drawing displayed in onion skin mode.
ru: **Нажмите и потяните**, чтобы определить блок: все области, *полностью включенные* в блок будут заполнены стилями, выбранными из окрашенных областей рисунка, отображаемых в режиме кальки.

source: If some areas are automatically painted with the wrong style, fix them to prevent the mistake to be amplified in the following frames you are going to paint.
ru: Если некоторые области автоматически закрашиваются с неправильным стилем, исправьте их, чтобы избежать усиления ошибки в следующих кадрах, которые вы собираетесь рисовать.

source: **To retrieve a style from a drawing:**
ru: **Чтобы извлечь стиль из рисунка:**

source: Select the **Style Picker** tool (|style_picker|).
ru: Выберите инструмент **Пипетка** (|style_picker|).

source: Click in the area whose style you want to pick. The picked style becomes the current one.
ru: Нажмите на область, стиль которой вы хотите выбрать. Выбранный стиль становится текущим.

source: Closing Gaps in Drawing Outline
ru: Закрытие пробелов в контуре рисунка

source: If the area outline is not perfectly defined, you will not be able to fill it. The gap can be closed by adding a line with the **Brush** (|brush|) or **Geometric** (|geometric|) tools (see :ref:`Drawing Tools <drawing_tools>` ), or by using the **Tape** tool (|tape|).
ru: Если контур области определен не полностью, вы не сможете его залить. Разрыв можно закрыть, добавив линию с помощью инструментов **Кисть** (|brush|) или **Геометрический** (|geometry|) (см. :ref:`Инструменты рисования <drawing_tools>`), или с помощью инструмент **Скотч** (|tape|).

source: For Toonz Vector drawings the **Tape** tool (|tape|) allows you to join vector strokes manually or automatically, both considering their endpoints and any point along the strokes themselves, according to the tool settings. Options available are the following:
ru: Для векторных рисунков Toonz инструмент **Скотч** (|tape|) позволяет вам присоединять векторные штрихи вручную или автоматически, с учетом их конечных точек и любой точки вдоль самих штрихов, в соответствии с настройками инструмента. Доступны следующие варианты:

source: **Type:** has the options **Normal**, to manually define joining vectors, or **Rectangular**, to automatically close all the gaps detected in the box you define.
ru: **Тип:** имеет параметры **Обычный**, чтобы вручную определить векторы соединения, или **Прямоугольный**, чтобы автоматически закрыть все пропуски, обнаруженные в определенном вами поле.

source: When the type is set to **Rectangular** only gaps between endpoints, and between an endpoint and a line, are considered.
ru: Когда тип установлен на **Прямоугольный**, рассматриваются только промежутки между конечными точками, а также между конечной точкой и линией.

source: **Mode:** has the option **Endpoint to Endpoint**, to join two lines endpoints; **Endpoint to Line**, to join an endpoint to any point along a line; and **Line to Line**, to join any point along a line to any other point along another line.
ru: **Режим:** имеет параметр **Вершина к вершине**, чтобы соединить две конечные точки линии; **Вершина к линии**, чтобы присоединить конечную точку к любой точке вдоль линии; и **Линия к Линии**, чтобы соединить любую точку вдоль линии с любой другой точкой вдоль другой линии.

source: **Distance** sets the maximum distance between endpoints, and between an endpoint and a line, that are automatically joined when using the Rectangular option.
ru: **Расстояние** устанавливает максимальное расстояние между конечными точками, а также между конечной точкой и линией, которые автоматически объединяются при использовании параметра Прямоугольный.

source: **Join Vectors**, when activated, connects the join stroke to the endpoint thus creating a single stroke; if deactivated the join stroke will be a new independent stroke (see :ref:`Joining and Splitting <joining_and_splitting>` ).
ru: **Соединять векторы** когда активировано, соединяет штрих соединения с конечной точкой, создавая тем самым один штрих; если деактивировано, объединяющий штрих будет новым независимым штрихом (см. :ref:`Соединение и разделение <joining_and_splitting>`).
