Repository: Savraska2/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/painting_animation_levels.po
Languages: ru

source: If the strokes you are going to join have different styles, the style of the first stroke you click on will be assigned to the second one, after the joining.
ru: Если штрихи, к которым вы собираетесь присоединиться, имеют разные стили, стиль первого, на который вы щелкнете, будет назначен второму после присоединения.

source: **Smooth**, when activated, creates a smooth joined stroke with no corners.
ru: **Плавность**, когда активировано, создает гладкий соединенный штрих без углов.

source: For Toonz Raster drawings the **Tape** tool (|tape|) automatically joins the open ends detected in the drawing according to the tool settings. Options available are the following:
ru: Для чертежей Toonz Raster инструмент **Скотч** (|tape|) автоматически соединяет открытые концы, обнаруженные на рисунке, в соответствии с настройками инструмента. Доступны следующие варианты:

source: **Type:** has the options **Normal**, to close all the gaps detected in the drawing by clicking in it; **Rectangular**, to close all the gaps detected in the box you define; **Freehand**, to close on all the gaps detected in the area you define by clicking and dragging; and **Polyline**, to close on all the gaps detected in the area you define by drawing a series of straight lines.
ru: **Тип:** имеет параметры **Обычный**, чтобы закрыть все пробелы, обнаруженные на рисунке, щелкнув по нему; **Прямоугольный**, чтобы закрыть все пробелы, обнаруженные в поле, которое вы определяете; **От руки**, чтобы закрыть все пробелы, обнаруженные в области, которую вы определяете, щелкая и перетаскивая; и **Полилиния**, чтобы закрыть все пропуски, обнаруженные в области, которую вы определяете, рисуя серию прямых линий.

source: **Frame Range** allows you to perform the joining on a range of frames, by clicking in the first and then in the last frame of the range.
ru: **Диапазон кадров** позволяет выполнять объединение для диапазона кадров, щелкая в первом, а затем в последнем кадре диапазона.

source: **Distance** sets the maximum distance between two open ends to be detected, in order to join them.
ru: **Расстояние** устанавливает максимальное расстояние между двумя открытыми концами, которые будут обнаружены, чтобы соединить их.

source: **Angle** sets the maximum angle between two open ends to be detected, in order to join them.
ru: **Угол** устанавливает максимальный угол между двумя открытыми концами, которые будут обнаружены, чтобы соединить их.

source: **Style Index** sets the style to be used for the line joining the open ends. If instead of a style index you type ``current`` , the currentntly selected style will be used.
ru: **Номер стиля** устанавливает стиль, который будет использоваться для линии, соединяющей открытые концы. Если вместо индекса стиля вы наберете ``current``, будет использован текущий выбранный стиль.

source: **Opacity** sets the opacity of the style used for the line joining the open ends.
ru: **Непрозрачность** устанавливает непрозрачность стиля, используемого для линии, соединяющей открытые концы.

source: Please note that by default **Opacity** value is set to 1, and with this value the gap will be closed using a transparent line that will not be seen in the Viewer. Also, note that the value of this option will equally affect how the Gap Check function is displayed in the Viewer.
ru: Обратите внимание что по умолчанию значение **Непрозрачности** установлено равным 1, и с этим значением разрыв будет закрыт с помощью прозрачной линии, которая не будет видна в средстве просмотра. Также обратите внимание, что значение этой опции будет в равной степени влиять на то, как функция Проверка замкнутости отображается в Окне просмотра.

source: **To close a gap in a vector drawing outline:**
ru: **Чтобы закрыть разрыв в контуре векторного рисования:**

source: Select the **Tape** tool (|tape|), set the type to **Normal** and set whether to join vectors, or to create a smooth joining.
ru: Выберите инструмент **Скотч** (|tape|), установите тип **Обычный** и укажите, следует ли объединять векторы или создать плавное соединение.

source: Set the mode to **Endpoint to Endpoint**, then click a stroke endpoint and drag to a different endpoint; the pointer snaps to the closest detected stroke endpoint, as start and end.
ru: Установите режим **Вершина к вершине**, затем щелкните конечную точку обводки и перетащите на другую конечную точку; указатель привязывается к ближайшей обнаруженной конечной точке хода, как к началу, так и к концу.

source: Set the mode to **Endpoint to Line**, then click a stroke endpoint and drag to any point along a stroke; the pointer snaps to the closest detected stroke endpoint as start, and to any closest point along a stroke as end.
ru: Установите режим **Вершина к линии**, затем щелкните конечную точку обводки и перетащите ее в любую точку вдоль обводки; указатель привязывается к ближайшей обнаруженной конечной точке штриха в качестве начала и к любой ближайшей точке вдоль штриха в качестве конца.

source: Set the mode to **Line to Line**, then click any point along a stroke and drag to any other point along a stroke; the pointer snaps to the closest point along a stroke as start, and to the any other closest point along a stroke as end.
ru: Установите режим **Линия к линии**, затем щелкните любую точку вдоль обводки и перетащите ее в любую другую точку вдоль обводки; указатель привязывается к ближайшей точке по обводке в качестве начала и к любой другой ближайшей точке по обводке в качестве конца.

source: **To close all gaps in a vector drawing outline in a specific area:**
ru: **Чтобы закрыть все пропуски в контуре векторного рисования в определенной области:**

source: Select the **Tape** tool (|tape|), set the type to **Rectangular**.
ru: Выберите инструмент **Скотч** (|tape|), установите тип **Прямоугольный**.

source: Click and drag to define an area: all the gaps between endpoints, and between endpoints and lines, detected in the area according to the set distance will be closed.
ru: Щелкните и перетащите, чтобы определить область: все промежутки между конечными точками, а также между конечными точками и линиями, обнаруженными в области в соответствии с заданным расстоянием, будут закрыты.

source: **To close all gaps in a raster drawing outline:**
ru: **Чтобы закрыть все пропуски в контуре растрового рисунка:**

source: Select the **Tape** tool (|tape|).
ru: Выберите инструмент **Скотч** (|tape|).

source: Click in the viewer to close all the gaps detected according to the set distance and angle.
ru: Щелкните в окне просмотра, чтобы закрыть все обнаруженные промежутки в соответствии с заданным расстоянием и углом.

source: **To close a specific gap in a raster drawing outline:**
ru: **Чтобы закрыть определенный разрыв в контуре растрового рисунка:**

source: Select the **Tape** tool (|tape|) and activate the **Rectangular** option.
ru: Выберите инструмент **Скотч** (|tape|) и активируйте опцию **Прямоугольный**.

source: Click and drag to define an area: all the gaps detected in the area according to the set distance and angle will be closed.
ru: Нажмите и перетащите, чтобы определить область: все зазоры, обнаруженные в области в соответствии с заданным расстоянием и углом, будут закрыты.

source: Checking Gaps in the Drawing Outline
ru: Проверка замкнутости контуров рисунка

source: To control the drawing outline and see if areas are well-defined in order to be filled with colors, it is possible to activate a series of checks:
ru: Чтобы управлять контуром чертежа и видеть, хорошо ли определены области, чтобы их можно было закрасить цветами, можно активировать серию проверок:

source: The **Gap Check** highlights with *magenta lines* the gaps that can be automatically closed by using the **Tape** tool (|tape|) with its current settings; if you change the **Distance** and **Angle** values of the Tape tool, while the check is activated, you can check interactively if the gaps that are detected.
ru: **Проверка замкнутости** выделяет *пурпурными линиями* промежутки, которые могут быть автоматически закрыты с помощью инструмента **Скотч** (|tape|) с его текущими настройками; если вы измените значения **Расстояние** и **Угол** инструмента Скотч, когда проверка активирована, вы можете в интерактивном режиме проверить, обнаружены ли пропуски.

source: Please note that the **Tape** tool **Opacity** value will affect the display of the Gap Check in Toonz Raster levels, so if it is set to the default value of 1, you will not be able to see anything with the Gap Check function. Set it to 255 instead, to be able to use this check.
ru: Обратите внимание, что значение инструмента **Скотч** **Непрозрачность** повлияет на отображение уровней Проверка замкнутости в Toonz Raster, поэтому, если для него установлено значение по умолчанию 1, вы не сможете ничего видеть с функция Проверка замкнутости. Вместо этого установите 255, чтобы иметь возможность использовать эту проверку.

source: The **Fill Check** displays all the well-defined areas that can be filled with colors in grey, all the lines or vector strokes in black, and the not well-defined areas and the background in white; if the **Black BG Check** is activated, all the lines or vector strokes are displayed in white (see :ref:`Checking Painted Drawings <checking_painted_drawings>` ).
ru: **Проверка заполнения** отображает все четко определенные области, которые могут быть заполнены серым цветом, все линии или векторные штрихи черным, а также нечетко определенные области и фон белым; если включена **На черном фоне**, все линии или векторные штрихи отображаются белым цветом (см. :ref:`Проверка закрашенных рисунков <checking_painted_drawings>`).

source: All the checks can also be combined in order to achieve specific display modes (see also :ref:`Checking Painted Drawings <checking_painted_drawings>` ).
ru: Все проверки также могут быть объединены для достижения определенных режимов отображения (см. также :ref:`Проверка покрашенных рисунков <checking_painted_drawings>`).

source: **To check if gaps occur in the drawing outline:**
ru: **Чтобы проверить, есть ли пропуски в контуре рисунка:**

source: Activate or deactivate the **Gap Check** from the View menu.
ru: Активируйте или деактивируйте **Проверка заполнения** из меню Вид.

source: **To check if the areas in the drawing are well-defined:**
ru: **Чтобы проверить, хорошо ли определены области на чертеже:**

source: Activate or deactivate the **Fill Check** from the View menu.
ru: Активируйте или деактивируйте **Проверка заполнения** из меню Вид.

source: Checking Painted Drawings
ru: Проверка покрашенных рисунков

source: To control if all the drawings areas are properly painted, and to see if the filling left small gaps along the lines antialiasing, or where a certain style is being used to paint lines or areas, it is possible to activate a series of checks:
ru: Чтобы контролировать, правильно ли покрашены все области рисунков, и чтобы увидеть, оставила ли заливка небольшие зазоры вдоль сглаживания линий или где определенный стиль используется для рисования линий или областей, можно активировать серию проверок:

source: The **Transparency Check** displays all the painted areas in the color defined in Preferences → Colors → Paint Color, all the lines or vector strokes in the color defined in Preferences → Colors → Ink Color on White Bg (or Preferences → Colors → Ink Color on Black Bg, depending on the chosen background color).
ru: **Проверка прозрачности** отображает все окрашенные области в цвете, определенном в Настройки программы → Цвета → Цвет краски, все линии или векторные штрихи в цвете, определенном в Настройках программы → Цвета → Цвет штриха на белом фоне (или Настройках программы → Цвета → Цвет штриха на черном фоне, в зависимости от выбранного цвета фона).

source: The **Ink Check** displays the *lines or vector strokes*, colored with the current style in red.
ru: **Проверка штриха** отображает *линии или векторные штрихи* текущего стиля в красном цвете.

source: The **Paint Check** displays the *areas* painted with the current color in red.
ru: **Проверка цвета** отображает *области* текущим цвета в красном цвете.

source: The **Black BG Check** displays the background color, defined in the Scene Settings, in black (see :ref:`Customizing the Viewer <customizing_the_work_area>` ).
ru: **На черном фоне** отображает цвет фона, определенный в настройках сцены, черным цветом (см. :ref:`Настройка окна просмотра <customizing_the_work_area>`).

source: All the checks can also be combined in order to achieve specific display modes (see also :ref:`Checking Gaps in the Drawing Outline <checking_gaps_in_the_drawing_outline>` ).
ru: Все проверки также могут быть объединены для достижения определенных режимов отображения (см. также :ref:`Проверка пропусков в контуре рисунка <checking_gaps_in_the_drawing_outline>`).

source: **To activate or deactivate a check:**
ru: **Чтобы активировать или деактивировать проверку:**

source: Activate or deactivate the check from the View menu.
ru: Активируйте или деактивируйте проверку в меню Вид.

source: Painting Lines
ru: Линии покраски

source: Lines of a drawing can be painted with the **Fill** tool (|fill|). For Toonz Raster drawings, the Fill tool (|fill|) affects continuous lines sharing the same style; for Toonz Vector drawings, only a single vector stroke at a time.
ru: Линии покраски могут быть покрашены с помощью инструмента **Заливка** (|fill|). Для рисунков Toonz Raster инструмент Заливка (|fill|) влияет на сплошные линии, имеющие одинаковый стиль; для векторных рисунков Toonz - только один векторный штрих за раз.

source: For Toonz Raster drawings, lines can be also painted with the **Paint Brush** tool (|paint_brush|) set to **Lines** mode. In this case by setting the size of the tool, you can paint any section of the lines as if you were using a brush.
ru: Для рисунков Toonz Raster линии также можно рисовать с помощью инструмента **Покраски** (|paint_brush|), установленного в режим **Линии**. В этом случае, установив размер инструмента, вы можете нарисовать любой участок линий, как если бы вы использовали кисть.

source: For Toonz Vector drawings, a vector stroke can be also painted by selecting it first, then selecting the style you want in the level Palette.
ru: Для векторных рисунков Toonz векторную обводку также можно нарисовать, сначала выделив ее, а затем выбрав нужный стиль в палитре уровней.

source: **To paint a Toonz Raster line:**
ru: **Чтобы покрасить линию Toonz Raster:**

source: Select the **Fill** tool (|fill|), set the fill mode to **Lines** and select a style in the palette.
ru: Выберите инструмент **Заливки** (|fill|), установите режим заливки на **Линии** и выберите стиль в палитре.

source: Click the line you want to paint.
ru: Нажмите на линию, которую хотите залить.

source: **To paint a Toonz Vector stroke:**
ru: **Чтобы покрасить штрих Toonz Vector:**

source: Select the **Fill** tool (|fill|), set the fill mode to **Lines**, select a style in the Palette and click the stroke you want to paint.
ru: Выберите инструмент **Заливки** (|fill|), установите режим заливки на **Линии**, выберите стиль в палитре и щелкните по линии, которую вы хотите залить.

source: With the **Selection** tool (|selection|) select the strokes you want to paint, then select a style in the Palette (see :ref:`Using the Selection Tool <using_the_selection_tool>` ).
ru: С помощью инструмента **Выделения** (|selection|) выберите линии, которые вы хотите нарисовать, затем выберите стиль в палитре (см. :ref:`Использование инструмента выделения <using_the_selection_tool>`).

source: **To partially paint a Toonz Raster line:**
ru: **Чтобы частично покрасить линию Toonz Raster:**

source: Select the **Fill** tool (|fill|), set the fill mode to **Lines**, activate the **Segment** option, and click the line section you want to paint.
ru: Выберите инструмент **Заливки** (|fill|), установите режим заливки на **Линии**, активируйте опцию **Сегмент** и щелкните участок линии, который вы хотите нарисовать.

source: Select the **Paint Brush** tool (|paint_brush|), set the mode to **Lines** and use it on the line section you want to paint.
ru: Выберите инструмент **Покраски** (|paint_brush|), установите режим на **Линии** и используйте его на участке линии, который вы хотите нарисовать.

source: Use the **Paint Brush** tool (|paint_brush|) with the proper style to split a continuous line into sections, then use the **Fill** tool (|fill|) to paint the previously separated sections.
ru: Используйте инструмент **Покраски** (|paint_brush|) с соответствующим стилем, чтобы разбить непрерывную линию на секции, затем используйте инструмент **Заливки** (|fill|), чтобы закрасить ранее разделенные секции.

source: **To paint several separated lines or vector strokes, at once:**
ru: **Чтобы нарисовать несколько отдельных линий или векторных штрихов, одновременно:**

source: Select the **Fill** tool (|fill|), set the fill mode to **Lines**.
ru: Выберите инструмент **Заливки** (|fill|), установите режим заполнения на **Линии**.

source: Set the type to **Rectangular** and click and drag to define a box: all the lines included in the box will be painted with the current style.
ru: Установите тип **Прямоугольный**, щелкните и перетащите, чтобы определить блок: все линии, включенные в блок, будут окрашены в текущем стиле.

source: Set the type to **Freehand** and click and drag to define an area: all the lines included in the area you defined will be painted with the current style. If the ends of the area you draw are open, it will be defined as if joining the two open ends.
ru: Установите тип **От руки**, нажмите и перетащите, чтобы определить область: все линии, включенные в определенную область, будут окрашены в текущем стиле. Если концы нарисованной области открыты, она будет определяться так, как если бы она соединяла два открытых конца.

source: Set the type to **Polyline** and click to define an area by drawing a series of straight lines: all the lines *completely included* in the area you defined will be painted with the current style. If the ends of the area you draw are open, the area will be defined as if joining the two open ends.
ru: Установите тип **Полилиния** и щелкните, чтобы определить область путем рисования серии прямых линий: все линии *полностью включенные* в определенной вами области будут окрашены в текущем стиле. Если концы нарисованной области открыты, эта область будет определяться так, как если бы она соединяла два открытых конца.

source: A vector stroke will be painted only if it's *fully included* in the area you define.
ru: Векторный штрих будет покрашен только если он *полностью включен* в определенную вами область.

source: **To paint lines or vector strokes, in several frames with a single command:**
ru: **Для покраски линий или векторных штрихов в нескольких кадрах одной командой:**

source: Select the **Fill** tool (|fill|), set the fill mode to **Lines** and activate the **Frame Range** option.
ru: Выберите инструмент **Заливки** (|fill|), установите режим заполнения на **Линии** и активируйте опцию **Диапазон кадров**.

source: Select the first frame of the range and **click** the line you want to paint.
ru: Выберите первый кадр диапазона и **нажмите** линию, которую вы хотите нарисовать.

source: Select the last frame of the range you want to apply the paint to, and **click** on the same line: the line in all the frames in the range will be automatically painted according to the first and second clicking positions.
ru: Выберите последний кадр диапазона, к которому вы хотите применить покраску, и **нажмите** на той же строке: линия во всех кадрах в диапазоне будет автоматически окрашена в соответствии с первой и второй позициями щелчка.

source: Select an intermediate frame of the range you want to apply the paint to, and **Shift-click** in the same line: the line in all of the frames in the range will be automatically painted, according to the first and second clicking positions. Select another intermediate frame and **Shift-click** again: the line in all of the frames in the new range will be automatically painted, according to the second and third clicking positions. Do the same as many times as you like, then **click** in the same line on the last frame of the range, to complete the multi frame painting mode.
ru: Выберите промежуточный кадр диапазона, к которому вы хотите применить краску, и **кликните с зажатым Shift** в той же строке: линия во всех кадрах в диапазоне будет автоматически покрашена, в соответствии с первым и вторым позиции нажатия. Выберите другой промежуточный кадр и снова **кликните с зажатой клавишей Shift**: линия во всех кадрах в новом диапазоне будет автоматически закрашена в соответствии со вторым и третьим положениями щелчка. Сделайте столько раз, сколько хотите, затем **нажмите** в той же строке в последнем кадре диапазона, чтобы завершить режим многокадрового рисования.

source: Since the Fill tool (|fill|) with the Frame Range option is applied making a linear interpolation from the first to the second clicking point, some painting mistakes may occur. The more the line you want to fill moves along the frame range, the more mistakes may be made.
ru: Поскольку инструмент Заливка (|fill|) с параметром Диапазон кадров применяется с линейной интерполяцией от первой до второй точки щелчка, могут возникнуть некоторые ошибки рисования. Чем больше линия, которую вы хотите заполнить, перемещается вдоль диапазона кадра, тем больше ошибок может быть сделано.

source: **To paint a line using as reference a previously painted drawing:**
ru: **Чтобы нарисовать линию, используя в качестве образца ранее нарисованный рисунок:**

source: Select the **Fill** tool (|fill|), set the fill mode to Lines and activate the **Onion Skin** option.
ru: Выберите инструмент **Заливки** (|fill|), установите режим заполнения на Линии и активируйте опцию **Калька**.

source: Click to pick the style to use, from the drawing displayed in onion skin mode.
ru: Нажмите, чтобы выбрать стиль для использования из рисунка, отображаемого в режиме кальки.

source: Release to paint the line where the cursor is.
ru: Отпустите, чтобы нарисовать линию, где находится курсор.

source: Drag to the line you want to paint and release the mouse button.
ru: Перетащите на линию, которую хотите нарисовать, и отпустите кнопку мыши.

source: Click the line whose style you want to pick. The picked style becomes the current one.
ru: Нажмите на линию, стиль которой вы хотите выбрать. Выбранный стиль становится текущим.

source: Using Match Lines
ru: Использование разделительных линий

source: Sometimes it may be useful to split a hand-drawn animation level into several animation levels that can be scanned separately, and later re-assembled before the painting process. For example you can draw an animation level with some shadow lines that match perfectly a character animation, then apply them with a color different from the character lines in order to paint them more easily.
ru: Иногда бывает полезно разделить нарисованный от руки уровень анимации на несколько уровней анимации, которые можно отсканировать отдельно, а затем заново собрать перед процессом рисования. Например, вы можете нарисовать уровень анимации с некоторыми теневыми линиями, которые идеально соответствуют анимации персонажа, а затем применить их цветом, отличным от линий персонажа, чтобы нарисовать их более легко.
